; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { i128, [32 x i8] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }

$std.collections.object.Object.to_format = comdat any

$std.collections.object.Object.free = comdat any

$std.collections.object.Object.is_null = comdat any

$std.collections.object.Object.is_empty = comdat any

$std.collections.object.Object.is_map = comdat any

$std.collections.object.Object.is_array = comdat any

$std.collections.object.Object.is_bool = comdat any

$std.collections.object.Object.is_string = comdat any

$std.collections.object.Object.is_float = comdat any

$std.collections.object.Object.is_int = comdat any

$std.collections.object.Object.is_keyable = comdat any

$std.collections.object.Object.is_indexable = comdat any

$std.collections.object.Object.set_object = comdat any

$std.collections.object.Object.get = comdat any

$std.collections.object.Object.has_key = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 16)
!2 = !DIFile(filename: "object.c3", directory: "C:/Dev/C3/c3-windows/lib/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 16, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 17, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 18, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 19, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 7, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 9, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 499, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 501, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 502, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 503, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 504, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 10, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 11, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 12, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 13, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 16)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 16)
!73 = !{i32 4, !"PIC Level", i32 2}
!74 = !{i32 1, !"CodeView", i32 1}
!75 = !{i32 1, !"uwtable", i32 2}
!76 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !77, splitDebugInlining: false)
!77 = !{!0, !69, !71}
!78 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !79, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !101)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !83, !43, !84}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !82)
!82 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 31, size: 384, align: 64, elements: !86, identifier: "std.io.Formatter")
!86 = !{!87, !88, !93}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !2, line: 33, baseType: !11, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !85, file: !2, line: 34, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !90, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DISubroutineType(types: !92)
!92 = !{!81, !11, !11, !28}
!93 = !DIDerivedType(tag: DW_TAG_member, scope: !85, file: !2, line: 35, baseType: !94, size: 256, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !85, file: !2, line: 35, size: 256, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !2, line: 37, baseType: !57, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !94, file: !2, line: 38, baseType: !57, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !94, file: !2, line: 39, baseType: !57, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !94, file: !2, line: 40, baseType: !30, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !94, file: !2, line: 41, baseType: !81, size: 64, align: 64, offset: 192)
!101 = !{}
!102 = !DILocation(line: 29, column: 1, scope: !78)
!103 = !DILocalVariable(name: "self", arg: 1, scope: !78, file: !2, line: 28, type: !43)
!104 = !DILocation(line: 28, column: 26, scope: !78)
!105 = !DILocalVariable(name: "formatter", arg: 2, scope: !78, file: !2, line: 28, type: !84)
!106 = !DILocation(line: 28, column: 44, scope: !78)
!107 = !DILocation(line: 30, column: 10, scope: !108)
!108 = distinct !DILexicalBlock(scope: !78, file: !2, line: 30, column: 2)
!109 = !DILocation(line: 32, column: 8, scope: !108)
!110 = !DILocation(line: 33, column: 11, scope: !111)
!111 = distinct !DILexicalBlock(scope: !108, file: !2, line: 33, column: 4)
!112 = !DILocation(line: 34, column: 8, scope: !108)
!113 = !DILocation(line: 35, column: 11, scope: !114)
!114 = distinct !DILexicalBlock(scope: !108, file: !2, line: 35, column: 4)
!115 = !DILocation(line: 36, column: 8, scope: !108)
!116 = !DILocation(line: 37, column: 36, scope: !117)
!117 = distinct !DILexicalBlock(scope: !108, file: !2, line: 37, column: 4)
!118 = !DILocation(line: 37, column: 11, scope: !117)
!119 = !DILocation(line: 38, column: 8, scope: !108)
!120 = !DILocation(line: 39, column: 28, scope: !121)
!121 = distinct !DILexicalBlock(scope: !108, file: !2, line: 39, column: 4)
!122 = !DILocation(line: 39, column: 46, scope: !121)
!123 = !DILocation(line: 39, column: 11, scope: !121)
!124 = !DILocation(line: 40, column: 8, scope: !108)
!125 = !DILocalVariable(name: "n", scope: !126, file: !2, line: 41, type: !30, align: 8)
!126 = distinct !DILexicalBlock(scope: !108, file: !2, line: 41, column: 4)
!127 = !DILocation(line: 41, column: 8, scope: !126)
!128 = !DILocation(line: 41, column: 12, scope: !126)
!129 = !DILocalVariable(name: ".temp", scope: !130, file: !2, line: 42, type: !131, align: 8)
!130 = distinct !DILexicalBlock(scope: !126, file: !2, line: 42, column: 4)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ObjectInternalList*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DILocation(line: 42, column: 21, scope: !130)
!133 = !DILocalVariable(name: ".temp", scope: !130, file: !2, line: 42, type: !30, align: 8)
!134 = !DILocation(line: 42, column: 13, scope: !130)
!135 = !DILocalVariable(name: "i", scope: !136, file: !2, line: 42, type: !30, align: 8)
!136 = distinct !DILexicalBlock(scope: !130, file: !2, line: 43, column: 4)
!137 = !DILocation(line: 42, column: 13, scope: !136)
!138 = !DILocalVariable(name: "ol", scope: !136, file: !2, line: 42, type: !42, align: 8)
!139 = !DILocation(line: 42, column: 16, scope: !136)
!140 = !DILocation(line: 42, column: 21, scope: !136)
!141 = !DILocation(line: 366, column: 9, scope: !142, inlinedAt: !139)
!142 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !143, file: !143, line: 364, scopeLine: 364, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !76)
!143 = !DIFile(filename: "list.c3", directory: "C:/Dev/C3/c3-windows/lib/std/collections")
!144 = !DILocation(line: 366, column: 22, scope: !142, inlinedAt: !139)
!145 = !DILocation(line: 44, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !136, file: !2, line: 43, column: 4)
!147 = !DILocation(line: 44, column: 16, scope: !146)
!148 = !DILocation(line: 44, column: 21, scope: !146)
!149 = !DILocation(line: 45, column: 5, scope: !146)
!150 = !DILocation(line: 45, column: 10, scope: !146)
!151 = !DILocation(line: 47, column: 4, scope: !126)
!152 = !DILocation(line: 47, column: 9, scope: !126)
!153 = !DILocation(line: 48, column: 11, scope: !126)
!154 = !DILocation(line: 49, column: 8, scope: !108)
!155 = !DILocalVariable(name: "n", scope: !156, file: !2, line: 50, type: !30, align: 8)
!156 = distinct !DILexicalBlock(scope: !108, file: !2, line: 50, column: 4)
!157 = !DILocation(line: 50, column: 8, scope: !156)
!158 = !DILocation(line: 50, column: 12, scope: !156)
!159 = !DILocalVariable(name: "buffer", scope: !160, file: !2, line: 484, type: !162, align: 16)
!160 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !161, file: !161, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !76, retainedNodes: !101)
!161 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 1024, lowerBound: 0)
!165 = !DILocation(line: 484, column: 14, scope: !160, inlinedAt: !166)
!166 = !DILocation(line: 51, column: 4, scope: !156)
!167 = !DILocalVariable(name: "allocator", scope: !160, file: !2, line: 485, type: !168, align: 8)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !169, identifier: "std.core.mem.allocator.OnStackAllocator")
!169 = !{!170, !171, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !168, file: !2, line: 5, baseType: !8, size: 128, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !2, line: 6, baseType: !24, size: 128, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !2, line: 7, baseType: !30, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !168, file: !2, line: 8, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !176, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !175, file: !2, line: 14, baseType: !21, size: 8, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !2, line: 15, baseType: !174, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !2, line: 16, baseType: !11, size: 64, align: 64, offset: 128)
!180 = !DILocation(line: 485, column: 19, scope: !160, inlinedAt: !166)
!181 = !DILocation(line: 486, column: 18, scope: !160, inlinedAt: !166)
!182 = !DILocation(line: 486, column: 2, scope: !160, inlinedAt: !166)
!183 = !DILocalVariable(name: "mem", scope: !156, file: !2, line: 51, type: !8, align: 8)
!184 = !DILocation(line: 51, column: 31, scope: !156)
!185 = !DILocation(line: 488, column: 9, scope: !186, inlinedAt: !166)
!186 = distinct !DILexicalBlock(scope: !160, file: !161, line: 488, column: 2)
!187 = !DILocalVariable(name: ".temp", scope: !188, file: !2, line: 53, type: !190, align: 8)
!188 = distinct !DILexicalBlock(scope: !189, file: !2, line: 53, column: 5)
!189 = distinct !DILexicalBlock(scope: !156, file: !2, line: 52, column: 4)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key[]", size: 128, align: 64, elements: !191, identifier: "Key[]")
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !190, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Key*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !190, baseType: !30, size: 64, align: 64, offset: 64)
!195 = !DILocation(line: 53, column: 23, scope: !188)
!196 = !DILocalVariable(name: ".temp", scope: !188, file: !2, line: 53, type: !30, align: 8)
!197 = !DILocation(line: 53, column: 14, scope: !188)
!198 = !DILocalVariable(name: "i", scope: !199, file: !2, line: 53, type: !30, align: 8)
!199 = distinct !DILexicalBlock(scope: !188, file: !2, line: 54, column: 5)
!200 = !DILocation(line: 53, column: 14, scope: !199)
!201 = !DILocalVariable(name: "key", scope: !199, file: !2, line: 53, type: !23, align: 8)
!202 = !DILocation(line: 53, column: 17, scope: !199)
!203 = !DILocation(line: 53, column: 23, scope: !199)
!204 = !DILocation(line: 55, column: 10, scope: !205)
!205 = distinct !DILexicalBlock(scope: !199, file: !2, line: 54, column: 5)
!206 = !DILocation(line: 55, column: 17, scope: !205)
!207 = !DILocation(line: 55, column: 22, scope: !205)
!208 = !DILocation(line: 487, column: 8, scope: !209, inlinedAt: !166)
!209 = distinct !DILexicalBlock(scope: !160, file: !161, line: 487, column: 8)
!210 = !DILocation(line: 56, column: 6, scope: !205)
!211 = !DILocation(line: 56, column: 37, scope: !205)
!212 = !DILocation(line: 56, column: 11, scope: !205)
!213 = !DILocation(line: 487, column: 8, scope: !214, inlinedAt: !166)
!214 = distinct !DILexicalBlock(scope: !160, file: !161, line: 487, column: 8)
!215 = !DILocation(line: 57, column: 6, scope: !205)
!216 = !DILocation(line: 57, column: 11, scope: !205)
!217 = !DILocation(line: 487, column: 8, scope: !218, inlinedAt: !166)
!218 = distinct !DILexicalBlock(scope: !160, file: !161, line: 487, column: 8)
!219 = !DILocation(line: 487, column: 8, scope: !220, inlinedAt: !166)
!220 = distinct !DILexicalBlock(scope: !160, file: !161, line: 487, column: 8)
!221 = !DILocation(line: 60, column: 4, scope: !156)
!222 = !DILocation(line: 60, column: 9, scope: !156)
!223 = !DILocation(line: 61, column: 11, scope: !156)
!224 = !DILocation(line: 63, column: 12, scope: !225)
!225 = distinct !DILexicalBlock(scope: !226, file: !2, line: 63, column: 4)
!226 = distinct !DILexicalBlock(scope: !108, file: !2, line: 63, column: 4)
!227 = !DILocation(line: 66, column: 44, scope: !228)
!228 = distinct !DILexicalBlock(scope: !225, file: !2, line: 66, column: 6)
!229 = !DILocation(line: 66, column: 13, scope: !228)
!230 = !DILocation(line: 68, column: 45, scope: !231)
!231 = distinct !DILexicalBlock(scope: !225, file: !2, line: 68, column: 6)
!232 = !DILocation(line: 68, column: 13, scope: !231)
!233 = !DILocation(line: 70, column: 36, scope: !234)
!234 = distinct !DILexicalBlock(scope: !225, file: !2, line: 70, column: 6)
!235 = !DILocation(line: 70, column: 13, scope: !234)
!236 = !DILocation(line: 72, column: 36, scope: !237)
!237 = distinct !DILexicalBlock(scope: !225, file: !2, line: 72, column: 6)
!238 = !DILocation(line: 72, column: 13, scope: !237)
!239 = !DILocation(line: 74, column: 13, scope: !240)
!240 = distinct !DILexicalBlock(scope: !225, file: !2, line: 74, column: 6)
!241 = distinct !DISubprogram(name: "free", linkageName: "std.collections.object.Object.free", scope: !2, file: !2, line: 115, type: !242, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !101)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !43}
!244 = !DILocation(line: 116, column: 1, scope: !241)
!245 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !2, line: 115, type: !43)
!246 = !DILocation(line: 115, column: 21, scope: !241)
!247 = !DILocation(line: 117, column: 10, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !2, line: 117, column: 2)
!249 = !DILocation(line: 119, column: 8, scope: !248)
!250 = !DILocation(line: 120, column: 4, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !2, line: 120, column: 4)
!252 = !DILocation(line: 121, column: 8, scope: !248)
!253 = !DILocation(line: 122, column: 20, scope: !254)
