; ModuleID = 'std::time::datetime'
source_filename = "std::time::datetime"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%TzDateTime = type { %DateTime, i32 }
%DateTime = type { i32, i8, i8, i8, i8, i8, i8, i32, i16, i64 }
%"char[]" = type { ptr, i64 }
%Tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.time.DateTime.to_local = comdat any

$std.time.DateTime.with_gmt_offset = comdat any

$std.time.TzDateTime.with_gmt_offset = comdat any

$std.time.DateTime.to_gmt_offset = comdat any

$std.time.TzDateTime.to_gmt_offset = comdat any

$std.time.DateTime.set_date = comdat any

$std.time.DateTime.set_time = comdat any

$std.time.DateTime.add_seconds = comdat any

$std.time.DateTime.add_minutes = comdat any

$std.time.DateTime.add_hours = comdat any

$std.time.DateTime.add_days = comdat any

$std.time.DateTime.add_weeks = comdat any

$std.time.DateTime.add_years = comdat any

$std.time.DateTime.add_months = comdat any

$std.time.TzDateTime.add_seconds = comdat any

$std.time.TzDateTime.add_minutes = comdat any

$std.time.TzDateTime.add_hours = comdat any

$std.time.TzDateTime.add_days = comdat any

$std.time.TzDateTime.add_weeks = comdat any

$std.time.TzDateTime.add_years = comdat any

$std.time.TzDateTime.add_months = comdat any


!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "datetime.c3", directory: "C:/Dev/C3/c3-windows/lib/std/time")
!5 = !{!6, !18}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Month", scope: !7, file: !4, line: 60, baseType: !12, size: 8, align: 8, elements: !33)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "DateTime", scope: !4, file: !4, line: 29, size: 256, align: 64, elements: !8, identifier: "std.time.DateTime")
!8 = !{!9, !11, !13, !14, !15, !16, !17, !27, !28, !30}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "usec", scope: !7, file: !4, line: 31, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !7, file: !4, line: 32, baseType: !12, size: 8, align: 8, offset: 32)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !7, file: !4, line: 33, baseType: !12, size: 8, align: 8, offset: 40)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !7, file: !4, line: 34, baseType: !12, size: 8, align: 8, offset: 48)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !7, file: !4, line: 35, baseType: !12, size: 8, align: 8, offset: 56)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !7, file: !4, line: 36, baseType: !6, size: 8, align: 8, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !7, file: !4, line: 37, baseType: !18, size: 8, align: 8, offset: 72)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Weekday", scope: !7, file: !4, line: 49, baseType: !12, size: 8, align: 8, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26}
!20 = !DIEnumerator(name: "MONDAY", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "TUESDAY", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "WEDNESDAY", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "THURSDAY", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "FRIDAY", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "SATURDAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "SUNDAY", value: 6, isUnsigned: true)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !7, file: !4, line: 38, baseType: !10, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "year_day", scope: !7, file: !4, line: 39, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !7, file: !4, line: 40, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", scope: !4, file: !4, line: 4, baseType: !32, align: 8)
!32 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!34 = !DIEnumerator(name: "JANUARY", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "FEBRUARY", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "MARCH", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "APRIL", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MAY", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "JUNE", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "JULY", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "AUGUST", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "SEPTEMBER", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "OCTOBER", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "NOVEMBER", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "DECEMBER", value: 11, isUnsigned: true)
!46 = distinct !DISubprogram(name: "to_local", linkageName: "std.time.DateTime.to_local", scope: !4, file: !4, line: 36, type: !47, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !54)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !53}
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "TzDateTime", scope: !4, file: !4, line: 43, size: 320, align: 64, elements: !50, identifier: "std.time.TzDateTime")
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "date_time", scope: !49, file: !4, line: 45, baseType: !7, size: 256, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "gmt_offset", scope: !49, file: !4, line: 46, baseType: !10, size: 32, align: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DateTime*", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !{}
!55 = !DILocation(line: 37, column: 1, scope: !46)
!56 = !DILocalVariable(name: "self", arg: 1, scope: !46, file: !4, line: 36, type: !53)
!57 = !DILocation(line: 36, column: 33, scope: !46)
!58 = !DILocalVariable(name: "tm", scope: !46, file: !4, line: 38, type: !59, align: 4)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tm", scope: !4, file: !4, line: 400, size: 288, align: 32, elements: !60, identifier: "libc.Tm")
!60 = !{!61, !63, !64, !65, !66, !67, !68, !69, !70}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !59, file: !4, line: 402, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !4, file: !4, line: 21, baseType: !10, align: 4)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !59, file: !4, line: 403, baseType: !62, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !59, file: !4, line: 404, baseType: !62, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !59, file: !4, line: 405, baseType: !62, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !59, file: !4, line: 406, baseType: !62, size: 32, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !59, file: !4, line: 407, baseType: !62, size: 32, align: 32, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !59, file: !4, line: 408, baseType: !62, size: 32, align: 32, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !59, file: !4, line: 409, baseType: !62, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !59, file: !4, line: 410, baseType: !62, size: 32, align: 32, offset: 256)
!71 = !DILocation(line: 38, column: 5, scope: !46)
!72 = !DILocalVariable(name: "time_t", scope: !46, file: !4, line: 39, type: !73, align: 8)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !4, file: !4, line: 63, baseType: !32, align: 8)
!74 = !DILocation(line: 39, column: 9, scope: !46)
!75 = !DILocation(line: 39, column: 26, scope: !46)
!76 = !DILocation(line: 39, column: 19, scope: !46)
!77 = !DILocation(line: 49, column: 70, scope: !78, inlinedAt: !80)
!78 = distinct !DISubprogram(name: "localtime_r", linkageName: "localtime_r", scope: !79, file: !79, line: 49, scopeLine: 49, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!79 = !DIFile(filename: "win32.c3", directory: "C:/Dev/C3/c3-windows/lib/std/libc/os")
!80 = !DILocation(line: 40, column: 8, scope: !46)
!81 = !DILocation(line: 49, column: 50, scope: !78, inlinedAt: !80)
!82 = !DILocalVariable(name: "dt", scope: !46, file: !4, line: 41, type: !49, align: 8)
!83 = !DILocation(line: 41, column: 13, scope: !46)
!84 = !DILocation(line: 42, column: 24, scope: !46)
!85 = !DILocation(line: 42, column: 13, scope: !46)
!86 = !DILocation(line: 43, column: 2, scope: !46)
!87 = !DILocation(line: 43, column: 17, scope: !46)
!88 = !DILocation(line: 44, column: 2, scope: !46)
!89 = !DILocation(line: 44, column: 17, scope: !46)
!90 = !DILocation(line: 45, column: 2, scope: !46)
!91 = !DILocation(line: 45, column: 18, scope: !46)
!92 = !DILocation(line: 46, column: 2, scope: !46)
!93 = !DILocation(line: 46, column: 17, scope: !46)
!94 = !DILocation(line: 47, column: 2, scope: !46)
!95 = !DILocation(line: 47, column: 20, scope: !46)
!96 = !DILocation(line: 47, column: 14, scope: !46)
!97 = !DILocation(line: 48, column: 2, scope: !46)
!98 = !DILocation(line: 48, column: 12, scope: !46)
!99 = !DILocation(line: 49, column: 2, scope: !46)
!100 = !DILocation(line: 49, column: 16, scope: !46)
!101 = !DILocation(line: 49, column: 29, scope: !46)
!102 = !DILocation(line: 49, column: 55, scope: !46)
!103 = !DILocation(line: 49, column: 47, scope: !46)
!104 = !DILocation(line: 50, column: 2, scope: !46)
!105 = !DILocation(line: 50, column: 24, scope: !46)
!106 = !DILocation(line: 51, column: 2, scope: !46)
!107 = !DILocation(line: 51, column: 12, scope: !46)
!108 = !DILocalVariable(name: "timezone", scope: !46, file: !4, line: 56, type: !109, align: 4)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLong", scope: !4, file: !4, line: 23, baseType: !10, align: 4)
!110 = !DILocation(line: 56, column: 9, scope: !46)
!111 = !DILocation(line: 57, column: 9, scope: !46)
!112 = !DILocation(line: 58, column: 3, scope: !46)
!113 = !DILocation(line: 58, column: 25, scope: !46)
!114 = !DILocation(line: 60, column: 9, scope: !46)
!115 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.DateTime.with_gmt_offset", scope: !4, file: !4, line: 69, type: !116, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !54)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !7, !10}
!118 = !DILocalVariable(name: "self", arg: 1, scope: !115, file: !4, line: 69, type: !7)
!119 = !DILocation(line: 69, column: 40, scope: !115)
!120 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !115, file: !4, line: 69, type: !10)
!121 = !DILocation(line: 69, column: 50, scope: !115)
!122 = !DILocation(line: 67, column: 11, scope: !123)
!123 = distinct !DILexicalBlock(scope: !115, file: !4, line: 70, column: 1)
!124 = !DILocation(line: 67, column: 39, scope: !123)
!125 = !DILocalVariable(name: "dt", scope: !115, file: !4, line: 71, type: !49, align: 8)
!126 = !DILocation(line: 71, column: 13, scope: !115)
!127 = !DILocation(line: 71, column: 20, scope: !115)
!128 = !DILocation(line: 71, column: 26, scope: !115)
!129 = !DILocation(line: 72, column: 9, scope: !115)
