; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$"std.core.builtin.IteratorResult$NO_MORE_ELEMENT" = comdat any

$"$ct.std.core.builtin.IteratorResult" = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"std.core.builtin.CastResult$TYPE_MISMATCH" = comdat any

$"$ct.std.core.builtin.CastResult" = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 114, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "builtin.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 135, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 133, baseType: !7, align: 8)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10, !19}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !12, identifier: "char[]")
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !18)
!18 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 367, type: !22, isLocal: false, isDefinition: true, align: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 366, baseType: !23, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 371, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{i32 4, !"PIC Level", i32 2}
!28 = !{i32 1, !"CodeView", i32 1}
!29 = !{i32 1, !"uwtable", i32 2}
!30 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !31, splitDebugInlining: false)
!31 = !{!0, !4, !20, !24}
!32 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 137, type: !33, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !45)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !10, !10, !10, !19, !35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !36, identifier: "any[]")
!36 = !{!37, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !40, identifier: "any")
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !39, baseType: !23, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, baseType: !17, size: 64, align: 64, offset: 64)
!45 = !{}
!46 = !DILocalVariable(name: "fmt", arg: 1, scope: !32, file: !2, line: 137, type: !10)
!47 = !DILocation(line: 137, column: 23, scope: !32)
!48 = !DILocalVariable(name: "file", arg: 2, scope: !32, file: !2, line: 137, type: !10)
!49 = !DILocation(line: 137, column: 35, scope: !32)
!50 = !DILocalVariable(name: "function", arg: 3, scope: !32, file: !2, line: 137, type: !10)
!51 = !DILocation(line: 137, column: 48, scope: !32)
!52 = !DILocalVariable(name: "line", arg: 4, scope: !32, file: !2, line: 137, type: !19)
!53 = !DILocation(line: 137, column: 63, scope: !32)
!54 = !DILocalVariable(name: "args", arg: 5, scope: !32, file: !2, line: 137, type: !35)
!55 = !DILocation(line: 137, column: 69, scope: !32)
!56 = !DILocation(line: 139, column: 6, scope: !32)
!57 = !DILocation(line: 202, column: 19, scope: !58, inlinedAt: !60)
!58 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !59, file: !59, line: 200, scopeLine: 200, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!59 = !DIFile(filename: "io.c3", directory: "C:/Dev/C3/c3-windows/lib/std/io")
!60 = !DILocation(line: 141, column: 7, scope: !61)
!61 = distinct !DILexicalBlock(scope: !32, file: !2, line: 140, column: 2)
!62 = !DILocation(line: 118, column: 24, scope: !63, inlinedAt: !64)
!63 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !59, file: !59, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!64 = !DILocation(line: 202, column: 3, scope: !58, inlinedAt: !60)
!65 = !DILocation(line: 212, column: 20, scope: !66, inlinedAt: !67)
!66 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !59, file: !59, line: 210, scopeLine: 210, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!67 = !DILocation(line: 142, column: 7, scope: !61)
!68 = !DILocalVariable(name: "len", scope: !69, file: !2, line: 168, type: !17, align: 8)
!69 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !59, file: !59, line: 166, scopeLine: 166, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !45)
!70 = !DILocation(line: 168, column: 6, scope: !69, inlinedAt: !71)
!71 = !DILocation(line: 212, column: 3, scope: !66, inlinedAt: !67)
!72 = !DILocation(line: 118, column: 24, scope: !73, inlinedAt: !74)
!73 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !59, file: !59, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!74 = !DILocation(line: 168, column: 12, scope: !69, inlinedAt: !71)
!75 = !DILocation(line: 169, column: 17, scope: !69, inlinedAt: !71)
!76 = !DILocation(line: 169, column: 2, scope: !69, inlinedAt: !71)
!77 = !DILocation(line: 174, column: 4, scope: !69, inlinedAt: !71)
!78 = !DILocation(line: 176, column: 9, scope: !69, inlinedAt: !71)
!79 = !DILocation(line: 143, column: 9, scope: !61)
!80 = !DILocation(line: 145, column: 13, scope: !32)
!81 = !DILocalVariable(name: "buffer", scope: !82, file: !2, line: 484, type: !84, align: 16)
!82 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !83, file: !83, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !45)
!83 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 512, lowerBound: 0)
!87 = !DILocation(line: 484, column: 14, scope: !82, inlinedAt: !88)
!88 = !DILocation(line: 146, column: 2, scope: !32)
!89 = !DILocalVariable(name: "allocator", scope: !82, file: !2, line: 485, type: !90, align: 8)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !91, identifier: "std.core.mem.allocator.OnStackAllocator")
!91 = !{!92, !97, !98, !99}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !90, file: !2, line: 5, baseType: !93, size: 128, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !94, identifier: "Allocator")
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !93, baseType: !23, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, baseType: !43, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !2, line: 6, baseType: !11, size: 128, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !90, file: !2, line: 7, baseType: !17, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !90, file: !2, line: 8, baseType: !100, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !102, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!102 = !{!103, !104, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !101, file: !2, line: 14, baseType: !3, size: 8, align: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !2, line: 15, baseType: !100, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !2, line: 16, baseType: !23, size: 64, align: 64, offset: 128)
!106 = !DILocation(line: 485, column: 19, scope: !82, inlinedAt: !88)
!107 = !DILocation(line: 486, column: 18, scope: !82, inlinedAt: !88)
!108 = !DILocation(line: 486, column: 2, scope: !82, inlinedAt: !88)
!109 = !DILocalVariable(name: "allocator", scope: !32, file: !2, line: 146, type: !93, align: 8)
!110 = !DILocation(line: 146, column: 28, scope: !32)
!111 = !DILocation(line: 488, column: 9, scope: !112, inlinedAt: !88)
!112 = distinct !DILexicalBlock(scope: !82, file: !83, line: 488, column: 2)
!113 = !DILocalVariable(name: "s", scope: !114, file: !2, line: 148, type: !115, align: 8)
!114 = distinct !DILexicalBlock(scope: !32, file: !2, line: 147, column: 2)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !23, align: 8)
!116 = !DILocation(line: 148, column: 11, scope: !114)
!117 = !DILocation(line: 149, column: 3, scope: !114)
!118 = !DILocation(line: 150, column: 3, scope: !114)
!119 = !DILocation(line: 151, column: 14, scope: !114)
!120 = !DILocation(line: 152, column: 3, scope: !114)
!121 = !DILocation(line: 152, column: 9, scope: !114)
!122 = !DILocation(line: 487, column: 8, scope: !123, inlinedAt: !88)
!123 = distinct !DILexicalBlock(scope: !82, file: !83, line: 487, column: 8)
!124 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 63, type: !125, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !45)
!125 = !DISubroutineType(types: !126)
!126 = !{!3, !10, !26}
!127 = !DILocalVariable(name: "message", arg: 1, scope: !124, file: !2, line: 63, type: !10)
!128 = !DILocation(line: 63, column: 32, scope: !124)
!129 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !124, file: !2, line: 63, type: !26)
!130 = !DILocation(line: 63, column: 45, scope: !124)
!131 = !DILocalVariable(name: "current", scope: !132, file: !2, line: 536, type: !133, align: 8)
!132 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !83, file: !83, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !45)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !135, identifier: "std.core.mem.allocator.TempAllocator")
!135 = !{!136, !137, !150, !151, !152}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !134, file: !2, line: 12, baseType: !93, size: 128, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !134, file: !2, line: 13, baseType: !138, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !139, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !140, identifier: "std.core.mem.allocator.TempAllocatorPage")
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !139, file: !2, line: 24, baseType: !138, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !139, file: !2, line: 25, baseType: !23, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !139, file: !2, line: 26, baseType: !17, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !2, line: 27, baseType: !17, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !139, file: !2, line: 28, baseType: !17, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !2, line: 29, baseType: !147, align: 8, offset: 320)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 0, lowerBound: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !134, file: !2, line: 14, baseType: !17, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !134, file: !2, line: 15, baseType: !17, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !2, line: 16, baseType: !147, align: 8, offset: 320)
!153 = !DILocation(line: 536, column: 17, scope: !132, inlinedAt: !154)
!154 = !DILocation(line: 65, column: 2, scope: !124)
!155 = !DILocation(line: 396, column: 7, scope: !156, inlinedAt: !158)
!156 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !157, file: !157, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!157 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!158 = !DILocation(line: 536, column: 38, scope: !132, inlinedAt: !154)
!159 = !DILocation(line: 398, column: 3, scope: !160, inlinedAt: !158)
!160 = distinct !DILexicalBlock(scope: !156, file: !157, line: 397, column: 2)
!161 = !DILocation(line: 400, column: 9, scope: !156, inlinedAt: !158)
!162 = !DILocalVariable(name: "mark", scope: !132, file: !2, line: 542, type: !17, align: 8)
!163 = !DILocation(line: 542, column: 6, scope: !132, inlinedAt: !154)
!164 = !DILocation(line: 542, column: 13, scope: !132, inlinedAt: !154)
!165 = !DILocalVariable(name: "buffer", scope: !166, file: !2, line: 67, type: !167, align: 16)
!166 = distinct !DILexicalBlock(scope: !124, file: !2, line: 66, column: 2)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 64, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 256, lowerBound: 0)
!170 = !DILocation(line: 67, column: 14, scope: !166)
!171 = !DILocalVariable(name: "backtraces", scope: !166, file: !2, line: 68, type: !172, align: 8)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !173, identifier: "void*[]")
!173 = !{!174, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !172, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !172, baseType: !17, size: 64, align: 64, offset: 64)
!177 = !DILocation(line: 68, column: 11, scope: !166)
!178 = !DILocation(line: 68, column: 52, scope: !166)
!179 = !DILocation(line: 68, column: 35, scope: !166)
!180 = !DILocation(line: 69, column: 3, scope: !166)
!181 = !DILocalVariable(name: "backtrace", scope: !166, file: !2, line: 70, type: !182, align: 8)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !183, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !182, file: !2, line: 16, baseType: !17, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !182, file: !2, line: 17, baseType: !17, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !182, file: !2, line: 18, baseType: !93, size: 128, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !182, file: !2, line: 19, baseType: !188, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !189, size: 64, align: 64, dwarfAddressSpace: 0)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !190, align: 8)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !191, identifier: "std.os.backtrace.Backtrace")
!191 = !{!192, !194, !195, !196, !197, !198, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !190, file: !2, line: 17, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !18)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !190, file: !2, line: 18, baseType: !10, size: 128, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !190, file: !2, line: 19, baseType: !10, size: 128, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !190, file: !2, line: 20, baseType: !10, size: 128, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !190, file: !2, line: 21, baseType: !19, size: 32, align: 32, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !190, file: !2, line: 22, baseType: !93, size: 128, align: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !190, file: !2, line: 23, baseType: !3, size: 8, align: 8, offset: 640)
!200 = !DILocation(line: 70, column: 18, scope: !166)
!201 = !DILocation(line: 396, column: 7, scope: !202, inlinedAt: !203)
!202 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !157, file: !157, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!203 = !DILocation(line: 70, column: 84, scope: !166)
!204 = !DILocation(line: 398, column: 3, scope: !205, inlinedAt: !203)
!205 = distinct !DILexicalBlock(scope: !202, file: !157, line: 397, column: 2)
!206 = !DILocation(line: 400, column: 9, scope: !202, inlinedAt: !203)
!207 = !DILocation(line: 70, column: 41, scope: !166)
!208 = !DILocation(line: 71, column: 13, scope: !166)
!209 = !DILocation(line: 545, column: 17, scope: !210, inlinedAt: !154)
!210 = distinct !DILexicalBlock(scope: !132, file: !83, line: 544, column: 2)
!211 = !DILocation(line: 545, column: 3, scope: !210, inlinedAt: !154)
!212 = !DILocation(line: 549, column: 2, scope: !210, inlinedAt: !154)
!213 = !DILocation(line: 72, column: 7, scope: !166)
!214 = !DILocation(line: 72, column: 26, scope: !166)
!215 = !DILocation(line: 545, column: 17, scope: !216, inlinedAt: !154)
!216 = distinct !DILexicalBlock(scope: !132, file: !83, line: 544, column: 2)
!217 = !DILocation(line: 545, column: 3, scope: !216, inlinedAt: !154)
!218 = !DILocation(line: 549, column: 2, scope: !216, inlinedAt: !154)
!219 = !DILocation(line: 202, column: 19, scope: !220, inlinedAt: !221)
!220 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !59, file: !59, line: 200, scopeLine: 200, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!221 = !DILocation(line: 73, column: 7, scope: !166)
!222 = !DILocation(line: 118, column: 24, scope: !223, inlinedAt: !224)
!223 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !59, file: !59, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!224 = !DILocation(line: 202, column: 3, scope: !220, inlinedAt: !221)
!225 = !DILocation(line: 202, column: 19, scope: !226, inlinedAt: !227)
!226 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !59, file: !59, line: 200, scopeLine: 200, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!227 = !DILocation(line: 74, column: 7, scope: !166)
!228 = !DILocation(line: 118, column: 24, scope: !229, inlinedAt: !230)
!229 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !59, file: !59, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!230 = !DILocation(line: 202, column: 3, scope: !226, inlinedAt: !227)
!231 = !DILocation(line: 212, column: 20, scope: !232, inlinedAt: !233)
!232 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !59, file: !59, line: 210, scopeLine: 210, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!233 = !DILocation(line: 75, column: 7, scope: !166)
!234 = !DILocalVariable(name: "len", scope: !235, file: !2, line: 168, type: !17, align: 8)
!235 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !59, file: !59, line: 166, scopeLine: 166, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !45)
!236 = !DILocation(line: 168, column: 6, scope: !235, inlinedAt: !237)
!237 = !DILocation(line: 212, column: 3, scope: !232, inlinedAt: !233)
!238 = !DILocation(line: 118, column: 24, scope: !239, inlinedAt: !240)
!239 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !59, file: !59, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!240 = !DILocation(line: 168, column: 12, scope: !235, inlinedAt: !237)
!241 = !DILocation(line: 169, column: 17, scope: !235, inlinedAt: !237)
!242 = !DILocation(line: 169, column: 2, scope: !235, inlinedAt: !237)
