; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"void*[]", %NativeConditionVariable }
%NativeMutex = type { %.anon, i32, i8, i8 }
%.anon = type { [5 x i64] }
%"QueueItem[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%NativeConditionVariable = type { %.anon.0, i32, [5 x i64] }
%.anon.0 = type { %.anon.1 }
%.anon.1 = type { ptr, ptr }
%"any[]" = type { ptr, i64 }
%QueueItem = type { ptr, %"any[]" }

$std.thread.threadpool.FixedThreadPool.init = comdat any

$std.thread.threadpool.FixedThreadPool.destroy = comdat any

$std.thread.threadpool.FixedThreadPool.stop_and_destroy = comdat any

$std.thread.threadpool.FixedThreadPool.push = comdat any

$.dyn_search = comdat any

$"std.thread.threadpool.ThreadPoolResult$QUEUE_FULL" = comdat any

$"$ct.std.thread.threadpool.ThreadPoolResult" = comdat any

$"$ct.std.thread.threadpool.FixedThreadPool" = comdat any

$"$ct.std.thread.threadpool.QueueItem" = comdat any

$"$ct.anyfault" = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any


!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!4 = !DIFile(filename: "fixed_pool.c3", directory: "C:/Dev/C3/c3-windows/lib/std/threads")
!5 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !4, file: !4, line: 39, type: !6, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !89)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !10, !11, !24, !24}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !9)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !4, file: !4, line: 13, size: 1344, align: 64, elements: !13, identifier: "std.thread.threadpool.FixedThreadPool")
!13 = !{!14, !34, !59, !60, !61, !63, !71}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !12, file: !4, line: 15, baseType: !15, size: 384, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !4, file: !4, line: 11, baseType: !16, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !4, file: !4, line: 6, size: 384, align: 64, elements: !17, identifier: "std.thread.os.NativeMutex")
!17 = !{!18, !29, !31, !33}
!18 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !4, line: 8, baseType: !19, size: 320, align: 64)
!19 = !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !4, line: 8, size: 320, align: 64, elements: !20)
!20 = !{!21, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "critical_section", scope: !19, file: !4, line: 10, baseType: !22, size: 320, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_CRITICAL_SECTION", scope: !4, file: !4, line: 191, baseType: !23, align: 8)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 320, align: 64, elements: !25)
!24 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!26}
!26 = !DISubrange(count: 5, lowerBound: 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !19, file: !4, line: 11, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !4, file: !4, line: 17, baseType: !10, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "locks", scope: !16, file: !4, line: 15, baseType: !30, size: 32, align: 32, offset: 320)
!30 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !16, file: !4, line: 16, baseType: !32, size: 8, align: 8, offset: 352)
!32 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "timed", scope: !16, file: !4, line: 17, baseType: !32, size: 8, align: 8, offset: 360)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !12, file: !4, line: 16, baseType: !35, size: 128, align: 64, offset: 384)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !36, identifier: "QueueItem[]")
!36 = !{!37, !58}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !4, file: !4, line: 28, size: 192, align: 64, elements: !40, identifier: "std.thread.threadpool.QueueItem")
!40 = !{!41, !57}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !39, file: !4, line: 30, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !4, file: !4, line: 11, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !47, identifier: "any[]")
!47 = !{!48, !55}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !51, identifier: "any")
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !50, baseType: !10, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !24)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !39, file: !4, line: 31, baseType: !46, size: 128, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, baseType: !56, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !12, file: !4, line: 17, baseType: !56, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !12, file: !4, line: 18, baseType: !56, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, scope: !12, file: !4, line: 19, baseType: !62, size: 8, align: 8, offset: 640)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !12, file: !4, line: 24, baseType: !64, size: 128, align: 64, offset: 704)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !65, identifier: "Thread[]")
!65 = !{!66, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !4, file: !4, line: 16, baseType: !69, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeThread", scope: !4, file: !4, line: 4, baseType: !10, align: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, baseType: !56, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !12, file: !4, line: 25, baseType: !72, size: 512, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !4, file: !4, line: 15, baseType: !73, align: 8)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeConditionVariable", scope: !4, file: !4, line: 26, size: 512, align: 64, elements: !74, identifier: "std.thread.os.NativeConditionVariable")
!74 = !{!75, !87, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !4, line: 28, baseType: !76, size: 128, align: 64)
!76 = !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !4, line: 28, size: 128, align: 64, elements: !77)
!77 = !{!78, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !4, line: 30, baseType: !79, size: 128, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !76, file: !4, line: 30, size: 128, align: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "event_one", scope: !79, file: !4, line: 32, baseType: !28, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "event_all", scope: !79, file: !4, line: 33, baseType: !28, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !76, file: !4, line: 35, baseType: !84, size: 128, align: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 64, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 2, lowerBound: 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "waiters_count", scope: !73, file: !4, line: 37, baseType: !30, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "waiters_count_lock", scope: !73, file: !4, line: 38, baseType: !22, size: 320, align: 64, offset: 192)
!89 = !{}
!90 = !DILocation(line: 40, column: 1, scope: !5)
!91 = !DILocalVariable(name: "self", arg: 1, scope: !5, file: !4, line: 39, type: !11)
!92 = !DILocation(line: 39, column: 31, scope: !5)
!93 = !DILocalVariable(name: "threads", arg: 2, scope: !5, file: !4, line: 39, type: !56)
!94 = !DILocation(line: 39, column: 42, scope: !5)
!95 = !DILocalVariable(name: "queue_size", arg: 3, scope: !5, file: !4, line: 39, type: !56)
!96 = !DILocation(line: 39, column: 55, scope: !5)
!97 = !DILocation(line: 35, column: 12, scope: !98)
!98 = distinct !DILexicalBlock(scope: !5, file: !4, line: 40, column: 1)
!99 = !DILocation(line: 35, column: 11, scope: !98)
!100 = !DILocation(line: 36, column: 11, scope: !98)
!101 = !DILocation(line: 36, column: 26, scope: !98)
!102 = !DILocation(line: 37, column: 11, scope: !98)
!103 = !DILocation(line: 41, column: 6, scope: !5)
!104 = !DILocation(line: 41, column: 36, scope: !5)
!105 = !DILocation(line: 43, column: 9, scope: !5)
!106 = !DILocation(line: 44, column: 3, scope: !5)
!107 = !DILocation(line: 45, column: 18, scope: !5)
!108 = !DILocation(line: 46, column: 18, scope: !5)
!109 = !DILocation(line: 286, column: 55, scope: !110, inlinedAt: !112)
!110 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !111, file: !111, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!111 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!112 = !DILocation(line: 269, column: 9, scope: !113, inlinedAt: !114)
!113 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !111, file: !111, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!114 = !DILocation(line: 708, column: 20, scope: !115, inlinedAt: !117)
!115 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !116, file: !116, line: 706, scopeLine: 706, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!116 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!117 = !DILocation(line: 47, column: 17, scope: !5)
!118 = !DILocation(line: 286, column: 40, scope: !110, inlinedAt: !112)
!119 = !DILocation(line: 62, column: 7, scope: !120, inlinedAt: !121)
!120 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !111, file: !111, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!121 = !DILocation(line: 286, column: 11, scope: !110, inlinedAt: !112)
!122 = !DILocation(line: 62, column: 20, scope: !120, inlinedAt: !121)
!123 = !DILocation(line: 28, column: 71, scope: !124, inlinedAt: !125)
!124 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !111, file: !111, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!125 = !DILocation(line: 68, column: 10, scope: !120, inlinedAt: !121)
!126 = !DILocation(line: 286, column: 67, scope: !110, inlinedAt: !112)
!127 = !DILocation(line: 252, column: 55, scope: !128, inlinedAt: !129)
!128 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !111, file: !111, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!129 = !DILocation(line: 244, column: 9, scope: !130, inlinedAt: !131)
!130 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !111, file: !111, line: 242, scopeLine: 242, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!131 = !DILocation(line: 691, column: 20, scope: !132, inlinedAt: !133)
!132 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !116, file: !116, line: 689, scopeLine: 689, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
