; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%Socket = type { ptr, i64, [128 x i8] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.net.tcp.connect = comdat any

$std.net.tcp.connect_async = comdat any

$std.net.tcp.connect_to = comdat any

$std.net.tcp.connect_async_to = comdat any

$std.net.tcp.listen = comdat any

$std.net.tcp.accept = comdat any

$std.net.tcp.listen_to = comdat any

$"$ct.std.net.tcp.TcpSocket" = comdat any

$"$ct.std.net.Socket" = comdat any

$"$ct.std.net.tcp.TcpServerSocket" = comdat any

$"$ct.char" = comdat any

$"$ct.std.net.IpProtocol" = comdat any

$"std.net.IpProtocol$ai_family" = comdat any

$"std.net.NetError$INVALID_URL" = comdat any

$"std.net.NetError$URL_TOO_LONG" = comdat any

$"std.net.NetError$INVALID_SOCKET" = comdat any

$"std.net.NetError$GENERAL_ERROR" = comdat any

$"std.net.NetError$INVALID_IP_STRING" = comdat any

$"std.net.NetError$ADDRINFO_FAILED" = comdat any

$"std.net.NetError$CONNECT_FAILED" = comdat any

$"std.net.NetError$LISTEN_FAILED" = comdat any

$"std.net.NetError$ACCEPT_FAILED" = comdat any

$"std.net.NetError$WRITE_FAILED" = comdat any

$"std.net.NetError$READ_FAILED" = comdat any


!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "tcp.c3", directory: "C:/Dev/C3/c3-windows/lib/std/net")
!5 = !{!6, !14}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !4, file: !4, line: 84, baseType: !7, size: 8, align: 8, elements: !8)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KEEPALIVE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "BROADCAST", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "OOBINLINE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "DONTROUTE", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !4, file: !4, line: 5, baseType: !7, size: 8, align: 8, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!19 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !4, file: !4, line: 8, type: !20, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !52)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !24, !38, !45, !46, !47, !14}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !23)
!23 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpSocket*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !4, file: !4, line: 5, baseType: !26, align: 8)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !4, file: !4, line: 4, size: 1152, align: 64, elements: !27, identifier: "std.net.Socket")
!27 = !{!28, !31, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !26, file: !4, line: 6, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !4, file: !4, line: 15, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !26, file: !4, line: 7, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !4, file: !4, line: 10, baseType: !33, align: 8)
!33 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !26, file: !4, line: 10, baseType: !35, size: 1024, align: 8, offset: 128)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, align: 8, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 128, lowerBound: 0)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !40, identifier: "char[]")
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !39, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !33)
!45 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !4, file: !4, line: 5, baseType: !23, align: 8)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !48, identifier: "SocketOption[]")
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !47, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, baseType: !44, size: 64, align: 64, offset: 64)
!52 = !{}
!53 = !DILocalVariable(name: "host", arg: 1, scope: !19, file: !4, line: 8, type: !38)
!54 = !DILocation(line: 8, column: 30, scope: !19)
!55 = !DILocalVariable(name: "port", arg: 2, scope: !19, file: !4, line: 8, type: !45)
!56 = !DILocation(line: 8, column: 41, scope: !19)
!57 = !DILocalVariable(name: "timeout", arg: 3, scope: !19, file: !4, line: 8, type: !46)
!58 = !DILocation(line: 8, column: 56, scope: !19)
!59 = !DILocalVariable(name: "options", arg: 4, scope: !19, file: !4, line: 8, type: !47)
!60 = !DILocation(line: 8, column: 85, scope: !19)
!61 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !19, file: !4, line: 8, type: !14)
!62 = !DILocation(line: 8, column: 105, scope: !19)
!63 = !DILocalVariable(name: "ai", scope: !19, file: !4, line: 10, type: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !4, file: !4, line: 14, size: 384, align: 64, elements: !66, identifier: "std.net.os.AddrInfo")
!66 = !{!67, !70, !72, !74, !76, !77, !84}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !65, file: !4, line: 16, baseType: !68, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !4, file: !4, line: 7, baseType: !69, align: 4)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !65, file: !4, line: 17, baseType: !71, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !4, file: !4, line: 4, baseType: !69, align: 4)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !65, file: !4, line: 18, baseType: !73, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !4, file: !4, line: 6, baseType: !69, align: 4)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !65, file: !4, line: 19, baseType: !75, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !4, file: !4, line: 5, baseType: !69, align: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !65, file: !4, line: 20, baseType: !32, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, scope: !65, file: !4, line: 21, baseType: !78, size: 128, align: 64, offset: 192)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !65, file: !4, line: 21, size: 128, align: 64, elements: !79)
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !78, file: !4, line: 23, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !4, file: !4, line: 5, baseType: !42, align: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !78, file: !4, line: 24, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !4, file: !4, line: 12, baseType: !30, align: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !65, file: !4, line: 31, baseType: !64, size: 64, align: 64, offset: 320)
!85 = !DILocation(line: 10, column: 12, scope: !19)
!86 = !DILocation(line: 10, column: 44, scope: !19)
!87 = !DILocation(line: 9, column: 20, scope: !19)
!88 = !DILocation(line: 10, column: 23, scope: !19)
!89 = !DILocation(line: 12, column: 6, scope: !19)
!90 = !DILocation(line: 14, column: 26, scope: !91)
!91 = distinct !DILexicalBlock(scope: !19, file: !4, line: 13, column: 2)
!92 = !DILocation(line: 11, column: 25, scope: !93)
!93 = distinct !DILexicalBlock(scope: !19, file: !4, line: 11, column: 12)
!94 = !DILocation(line: 11, column: 12, scope: !93)
!95 = !DILocation(line: 11, column: 25, scope: !96)
!96 = distinct !DILexicalBlock(scope: !19, file: !4, line: 11, column: 12)
!97 = !DILocation(line: 11, column: 12, scope: !96)
!98 = !DILocation(line: 16, column: 9, scope: !19)
!99 = !DILocation(line: 11, column: 25, scope: !100)
!100 = distinct !DILexicalBlock(scope: !19, file: !4, line: 11, column: 12)
!101 = !DILocation(line: 11, column: 12, scope: !100)
!102 = !DILocation(line: 11, column: 25, scope: !103)
!103 = distinct !DILexicalBlock(scope: !19, file: !4, line: 11, column: 12)
!104 = !DILocation(line: 11, column: 12, scope: !103)
!105 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !4, file: !4, line: 19, type: !106, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !52)
!106 = !DISubroutineType(types: !107)
!107 = !{!22, !24, !38, !45, !47, !14}
!108 = !DILocalVariable(name: "host", arg: 1, scope: !105, file: !4, line: 19, type: !38)
!109 = !DILocation(line: 19, column: 36, scope: !105)
!110 = !DILocalVariable(name: "port", arg: 2, scope: !105, file: !4, line: 19, type: !45)
!111 = !DILocation(line: 19, column: 47, scope: !105)
!112 = !DILocalVariable(name: "options", arg: 3, scope: !105, file: !4, line: 19, type: !47)
!113 = !DILocation(line: 19, column: 69, scope: !105)
!114 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !105, file: !4, line: 19, type: !14)
!115 = !DILocation(line: 19, column: 89, scope: !105)
!116 = !DILocalVariable(name: "ai", scope: !105, file: !4, line: 21, type: !64, align: 8)
!117 = !DILocation(line: 21, column: 12, scope: !105)
!118 = !DILocation(line: 21, column: 43, scope: !105)
!119 = !DILocation(line: 21, column: 22, scope: !105)
!120 = !DILocation(line: 23, column: 9, scope: !105)
!121 = !DILocation(line: 22, column: 25, scope: !122)
!122 = distinct !DILexicalBlock(scope: !105, file: !4, line: 22, column: 12)
!123 = !DILocation(line: 22, column: 12, scope: !122)
!124 = !DILocation(line: 22, column: 25, scope: !125)
!125 = distinct !DILexicalBlock(scope: !105, file: !4, line: 22, column: 12)
!126 = !DILocation(line: 22, column: 12, scope: !125)
!127 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !4, file: !4, line: 26, type: !128, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !52)
!128 = !DISubroutineType(types: !129)
!129 = !{!22, !24, !64, !47}
!130 = !DILocalVariable(name: "ai", arg: 1, scope: !127, file: !4, line: 26, type: !64)
!131 = !DILocation(line: 26, column: 36, scope: !127)
!132 = !DILocalVariable(name: "options", arg: 2, scope: !127, file: !4, line: 26, type: !47)
!133 = !DILocation(line: 26, column: 56, scope: !127)
!134 = !DILocation(line: 28, column: 10, scope: !127)
!135 = distinct !DISubprogram(name: "connect_async_to", linkageName: "std.net.tcp.connect_async_to", scope: !4, file: !4, line: 31, type: !128, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !52)
!136 = !DILocalVariable(name: "ai", arg: 1, scope: !135, file: !4, line: 31, type: !64)
!137 = !DILocation(line: 31, column: 42, scope: !135)
!138 = !DILocalVariable(name: "options", arg: 2, scope: !135, file: !4, line: 31, type: !47)
