; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Win32_SECURITY_ATTRIBUTES = type { i32, ptr, i32 }
%File = type { ptr }
%SubProcess = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8 }
%"char[][]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Win32_PROCESS_INFORMATION = type { ptr, ptr, i32, i32 }
%Win32_STARTUPINFOW = type { i32, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, ptr, ptr, ptr, ptr }
%Win32_OVERLAPPED = type { i64, i64, %.anon, ptr }
%.anon = type { ptr }

$std.os.process.SubProcess.stdout = comdat any

$std.os.process.SubProcess.destroy = comdat any

$std.os.process.SubProcess.terminate = comdat any

$std.os.process.SubProcess.read_stdout = comdat any

$std.os.process.SubProcess.read_stderr = comdat any

$std.os.process.SubProcess.is_running = comdat any

$std.os.process.SubProcess.join = comdat any

$std.os.process.execute_stdout_to_buffer = comdat any

$std.os.process.create = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_CREATE_PIPE" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDIN" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDOUT" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "index", linkageName: "create_named_pipe_helper.index", scope: !2, file: !2, line: 56, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "C:/Dev/C3/c3-windows/lib/std/os")
!3 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"CodeView", i32 1}
!6 = !{i32 1, !"uwtable", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !8, splitDebugInlining: false)
!8 = !{!0}
!9 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 356, type: !10, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !17}
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !13, identifier: "std.io.File")
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !12, file: !2, line: 6, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 360, baseType: !16, align: 8)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 19, size: 512, align: 64, elements: !19, identifier: "std.os.process.SubProcess")
!19 = !{!20, !21, !22, !23, !25, !26, !27, !28}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !18, file: !2, line: 21, baseType: !15, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !18, file: !2, line: 22, baseType: !15, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !18, file: !2, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !18, file: !2, line: 25, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !2, file: !2, line: 17, baseType: !16, align: 8)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !18, file: !2, line: 26, baseType: !24, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hEventOutput", scope: !18, file: !2, line: 27, baseType: !24, size: 64, align: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hEventError", scope: !18, file: !2, line: 28, baseType: !24, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !18, file: !2, line: 33, baseType: !29, size: 8, align: 8, offset: 448)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{}
!31 = !DILocation(line: 357, column: 1, scope: !9)
!32 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !2, line: 356, type: !17)
!33 = !DILocation(line: 356, column: 27, scope: !9)
!34 = !DILocation(line: 358, column: 27, scope: !9)
!35 = !DILocation(line: 358, column: 15, scope: !9)
!36 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 380, type: !37, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!37 = !DISubroutineType(types: !38)
!38 = !{!29, !17}
!39 = !DILocation(line: 381, column: 1, scope: !36)
!40 = !DILocalVariable(name: "self", arg: 1, scope: !36, file: !2, line: 380, type: !17)
!41 = !DILocation(line: 380, column: 28, scope: !36)
!42 = !DILocation(line: 382, column: 6, scope: !36)
!43 = !DILocation(line: 382, column: 36, scope: !36)
!44 = !DILocation(line: 382, column: 29, scope: !36)
!45 = !DILocation(line: 383, column: 6, scope: !36)
!46 = !DILocation(line: 385, column: 16, scope: !47)
!47 = distinct !DILexicalBlock(scope: !36, file: !2, line: 384, column: 2)
!48 = !DILocation(line: 385, column: 9, scope: !47)
!49 = !DILocation(line: 386, column: 7, scope: !47)
!50 = !DILocation(line: 386, column: 27, scope: !47)
!51 = !DILocation(line: 386, column: 58, scope: !47)
!52 = !DILocation(line: 386, column: 51, scope: !47)
!53 = !DILocation(line: 388, column: 2, scope: !36)
!54 = !DILocation(line: 388, column: 20, scope: !36)
!55 = !DILocation(line: 388, column: 39, scope: !36)
!56 = !DILocation(line: 388, column: 58, scope: !36)
!57 = !DILocation(line: 390, column: 7, scope: !36)
!58 = !DILocation(line: 390, column: 41, scope: !36)
!59 = !DILocation(line: 390, column: 29, scope: !36)
!60 = !DILocation(line: 391, column: 7, scope: !36)
!61 = !DILocation(line: 391, column: 42, scope: !36)
!62 = !DILocation(line: 391, column: 30, scope: !36)
!63 = !DILocation(line: 392, column: 7, scope: !36)
!64 = !DILocation(line: 392, column: 45, scope: !36)
!65 = !DILocation(line: 392, column: 33, scope: !36)
!66 = !DILocation(line: 393, column: 7, scope: !36)
!67 = !DILocation(line: 393, column: 44, scope: !36)
!68 = !DILocation(line: 393, column: 32, scope: !36)
!69 = !DILocation(line: 394, column: 3, scope: !36)
!70 = !DILocation(line: 394, column: 19, scope: !36)
!71 = !DILocation(line: 394, column: 36, scope: !36)
!72 = !DILocation(line: 394, column: 56, scope: !36)
!73 = !DILocation(line: 394, column: 75, scope: !36)
!74 = !DILocation(line: 396, column: 9, scope: !36)
!75 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 399, type: !76, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !16, !17}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !3)
!79 = !DILocation(line: 400, column: 1, scope: !75)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !75, file: !2, line: 399, type: !17)
!81 = !DILocation(line: 399, column: 31, scope: !75)
!82 = !DILocation(line: 402, column: 32, scope: !75)
!83 = !DILocation(line: 402, column: 47, scope: !75)
!84 = !DILocation(line: 402, column: 15, scope: !75)
!85 = !DILocation(line: 402, column: 59, scope: !75)
!86 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 444, type: !87, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!87 = !DISubroutineType(types: !88)
!88 = !{!78, !89, !17, !92, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !91)
!91 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DILocation(line: 445, column: 1, scope: !86)
!95 = !DILocalVariable(name: "self", arg: 1, scope: !86, file: !2, line: 444, type: !17)
!96 = !DILocation(line: 444, column: 32, scope: !86)
!97 = !DILocalVariable(name: "buffer", arg: 2, scope: !86, file: !2, line: 444, type: !92)
!98 = !DILocation(line: 444, column: 45, scope: !86)
!99 = !DILocalVariable(name: "size", arg: 3, scope: !86, file: !2, line: 444, type: !90)
!100 = !DILocation(line: 444, column: 57, scope: !86)
!101 = !DILocation(line: 447, column: 31, scope: !86)
!102 = !DILocation(line: 447, column: 49, scope: !86)
!103 = !DILocation(line: 447, column: 10, scope: !86)
!104 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 453, type: !87, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!105 = !DILocation(line: 454, column: 1, scope: !104)
!106 = !DILocalVariable(name: "self", arg: 1, scope: !104, file: !2, line: 453, type: !17)
!107 = !DILocation(line: 453, column: 32, scope: !104)
!108 = !DILocalVariable(name: "buffer", arg: 2, scope: !104, file: !2, line: 453, type: !92)
!109 = !DILocation(line: 453, column: 45, scope: !104)
!110 = !DILocalVariable(name: "size", arg: 3, scope: !104, file: !2, line: 453, type: !90)
!111 = !DILocation(line: 453, column: 57, scope: !104)
!112 = !DILocation(line: 456, column: 31, scope: !104)
!113 = !DILocation(line: 456, column: 49, scope: !104)
!114 = !DILocation(line: 456, column: 10, scope: !104)
!115 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 462, type: !116, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!116 = !DISubroutineType(types: !117)
!117 = !{!78, !118, !17}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DILocation(line: 463, column: 1, scope: !115)
!120 = !DILocalVariable(name: "self", arg: 1, scope: !115, file: !2, line: 462, type: !17)
!121 = !DILocation(line: 462, column: 32, scope: !115)
!122 = !DILocation(line: 464, column: 7, scope: !115)
!123 = !DILocation(line: 464, column: 29, scope: !115)
!124 = !DILocalVariable(name: "is_alive", scope: !115, file: !2, line: 466, type: !29, align: 1)
!125 = !DILocation(line: 466, column: 8, scope: !115)
!126 = !DILocation(line: 466, column: 46, scope: !115)
!127 = !DILocation(line: 466, column: 61, scope: !115)
!128 = !DILocation(line: 466, column: 26, scope: !115)
!129 = !DILocation(line: 467, column: 8, scope: !115)
!130 = !DILocation(line: 467, column: 18, scope: !115)
!131 = !DILocation(line: 467, column: 34, scope: !115)
!132 = !DILocation(line: 468, column: 10, scope: !115)
!133 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 361, type: !134, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!134 = !DISubroutineType(types: !135)
!135 = !{!78, !136, !17}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !138, align: 4)
!138 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!139 = !DILocation(line: 362, column: 1, scope: !133)
!140 = !DILocalVariable(name: "self", arg: 1, scope: !133, file: !2, line: 361, type: !17)
!141 = !DILocation(line: 361, column: 26, scope: !133)
!142 = !DILocation(line: 363, column: 6, scope: !133)
!143 = !DILocation(line: 365, column: 16, scope: !144)
!144 = distinct !DILexicalBlock(scope: !133, file: !2, line: 364, column: 2)
!145 = !DILocation(line: 365, column: 9, scope: !144)
!146 = !DILocation(line: 366, column: 3, scope: !144)
!147 = !DILocation(line: 366, column: 21, scope: !144)
!148 = !DILocation(line: 368, column: 6, scope: !133)
!149 = !DILocation(line: 370, column: 22, scope: !150)
!150 = distinct !DILexicalBlock(scope: !133, file: !2, line: 369, column: 2)
!151 = !DILocation(line: 370, column: 10, scope: !150)
!152 = !DILocation(line: 371, column: 3, scope: !150)
!153 = !DILocation(line: 371, column: 20, scope: !150)
!154 = !DILocation(line: 373, column: 29, scope: !133)
!155 = !DILocation(line: 373, column: 51, scope: !133)
!156 = !DILocation(line: 373, column: 9, scope: !133)
!157 = !DILocalVariable(name: "return_code", scope: !133, file: !2, line: 374, type: !158, align: 4)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !2, file: !2, line: 9, baseType: !159, align: 4)
!159 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!160 = !DILocation(line: 374, column: 14, scope: !133)
!161 = !DILocation(line: 375, column: 33, scope: !133)
!162 = !DILocation(line: 375, column: 49, scope: !133)
!163 = !DILocation(line: 375, column: 14, scope: !133)
!164 = !DILocation(line: 375, column: 70, scope: !133)
!165 = !DILocation(line: 376, column: 2, scope: !133)
!166 = !DILocation(line: 376, column: 18, scope: !133)
!167 = !DILocation(line: 377, column: 9, scope: !133)
!168 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 271, type: !169, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!169 = !DISubroutineType(types: !170)
!170 = !{!78, !171, !173, !177, !138, !177}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !174, identifier: "char[]")
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !173, baseType: !92, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, baseType: !90, size: 64, align: 64, offset: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !178, identifier: "String[]")
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !177, baseType: !171, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, baseType: !90, size: 64, align: 64, offset: 64)
!181 = !DILocalVariable(name: "buffer", arg: 1, scope: !168, file: !2, line: 271, type: !173)
!182 = !DILocation(line: 271, column: 44, scope: !168)
!183 = !DILocalVariable(name: "command_line", arg: 2, scope: !168, file: !2, line: 271, type: !177)
!184 = !DILocation(line: 271, column: 61, scope: !168)
!185 = !DILocalVariable(name: "options", arg: 3, scope: !168, file: !2, line: 271, type: !138)
!186 = !DILocation(line: 271, column: 93, scope: !168)
!187 = !DILocalVariable(name: "environment", arg: 4, scope: !168, file: !2, line: 271, type: !177)
!188 = !DILocation(line: 271, column: 116, scope: !168)
!189 = !DILocalVariable(name: "process", scope: !168, file: !2, line: 273, type: !18, align: 8)
!190 = !DILocation(line: 273, column: 13, scope: !168)
!191 = !DILocation(line: 273, column: 32, scope: !168)
!192 = !DILocation(line: 274, column: 2, scope: !168)
!193 = !DILocalVariable(name: "len", scope: !168, file: !2, line: 275, type: !90, align: 8)
!194 = !DILocation(line: 275, column: 6, scope: !168)
!195 = !DILocation(line: 275, column: 44, scope: !168)
!196 = !DILocation(line: 275, column: 12, scope: !168)
!197 = !DILocation(line: 276, column: 17, scope: !168)
!198 = !DILocation(line: 276, column: 24, scope: !168)
!199 = !DILocation(line: 276, column: 25, scope: !168)
!200 = !DILocation(line: 276, column: 10, scope: !168)
!201 = distinct !DISubprogram(name: "create_named_pipe_helper", linkageName: "std.os.process.create_named_pipe_helper", scope: !2, file: !2, line: 52, type: !202, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !30)
!202 = !DISubroutineType(types: !203)
!203 = !{!78, !16, !204, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !DILocalVariable(name: "rd", arg: 1, scope: !201, file: !2, line: 52, type: !204)
!206 = !DILocation(line: 52, column: 42, scope: !201)
!207 = !DILocalVariable(name: "wr", arg: 2, scope: !201, file: !2, line: 52, type: !204)
!208 = !DILocation(line: 52, column: 53, scope: !201)
!209 = !DILocalVariable(name: "sa_attr", scope: !201, file: !2, line: 54, type: !210, align: 8)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SECURITY_ATTRIBUTES", scope: !2, file: !2, line: 193, size: 192, align: 64, elements: !211, identifier: "std.os.win32.Win32_SECURITY_ATTRIBUTES")
!211 = !{!212, !213, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nLength", scope: !210, file: !2, line: 195, baseType: !158, size: 32, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lpSecurityDescriptor", scope: !210, file: !2, line: 196, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPVOID", scope: !2, file: !2, line: 80, baseType: !16, align: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bInheritHandle", scope: !210, file: !2, line: 197, baseType: !216, size: 32, align: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_BOOL", scope: !2, file: !2, line: 3, baseType: !138, align: 4)
!217 = !DILocation(line: 54, column: 28, scope: !201)
!218 = !DILocation(line: 54, column: 80, scope: !201)
!219 = !DILocalVariable(name: "unique", scope: !201, file: !2, line: 57, type: !3, align: 8)
!220 = !DILocation(line: 57, column: 7, scope: !201)
!221 = !DILocation(line: 57, column: 16, scope: !201)
!222 = !DILocalVariable(name: "current", scope: !223, file: !2, line: 536, type: !225, align: 8)
!223 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !224, file: !224, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !30)
!224 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !227, identifier: "std.core.mem.allocator.TempAllocator")
!227 = !{!228, !234, !247, !248, !249}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !226, file: !2, line: 12, baseType: !229, size: 128, align: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !230, identifier: "Allocator")
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !229, baseType: !16, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !226, file: !2, line: 13, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !237, identifier: "std.core.mem.allocator.TempAllocatorPage")
!237 = !{!238, !239, !240, !241, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !236, file: !2, line: 24, baseType: !235, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !236, file: !2, line: 25, baseType: !16, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !236, file: !2, line: 26, baseType: !90, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !236, file: !2, line: 27, baseType: !90, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !236, file: !2, line: 28, baseType: !90, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !2, line: 29, baseType: !244, align: 8, offset: 320)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, align: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 0, lowerBound: 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !226, file: !2, line: 14, baseType: !90, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !226, file: !2, line: 15, baseType: !90, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !2, line: 16, baseType: !244, align: 8, offset: 320)
!250 = !DILocation(line: 536, column: 17, scope: !223, inlinedAt: !251)
!251 = !DILocation(line: 58, column: 2, scope: !201)
!252 = !DILocation(line: 396, column: 7, scope: !253, inlinedAt: !255)
!253 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !254, file: !254, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!254 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!255 = !DILocation(line: 536, column: 38, scope: !223, inlinedAt: !251)
!256 = !DILocation(line: 398, column: 3, scope: !257, inlinedAt: !255)
!257 = distinct !DILexicalBlock(scope: !253, file: !254, line: 397, column: 2)
!258 = !DILocation(line: 400, column: 9, scope: !253, inlinedAt: !255)
!259 = !DILocalVariable(name: "mark", scope: !223, file: !2, line: 542, type: !90, align: 8)
!260 = !DILocation(line: 542, column: 6, scope: !223, inlinedAt: !251)
!261 = !DILocation(line: 542, column: 13, scope: !223, inlinedAt: !251)
!262 = !DILocalVariable(name: "s", scope: !263, file: !2, line: 60, type: !172, align: 8)
!263 = distinct !DILexicalBlock(scope: !201, file: !2, line: 59, column: 2)
!264 = !DILocation(line: 60, column: 10, scope: !263)
!265 = !DILocation(line: 60, column: 76, scope: !263)
!266 = !DILocation(line: 60, column: 106, scope: !263)
!267 = !DILocation(line: 60, column: 128, scope: !263)
!268 = !DILocation(line: 60, column: 22, scope: !263)
!269 = !DILocalVariable(name: "str", scope: !263, file: !2, line: 61, type: !270, align: 8)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPCSTR", scope: !2, file: !2, line: 70, baseType: !271, align: 8)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ichar*", baseType: !272, size: 64, align: 64, dwarfAddressSpace: 0)
!272 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!273 = !DILocation(line: 61, column: 16, scope: !263)
!274 = !DILocation(line: 61, column: 36, scope: !263)
!275 = !DILocation(line: 62, column: 4, scope: !263)
!276 = !DILocation(line: 66, column: 23, scope: !263)
!277 = !DILocation(line: 62, column: 16, scope: !263)
!278 = !DILocation(line: 67, column: 39, scope: !263)
!279 = !DILocation(line: 67, column: 14, scope: !263)
!280 = !DILocation(line: 545, column: 17, scope: !281, inlinedAt: !251)
!281 = distinct !DILexicalBlock(scope: !223, file: !224, line: 544, column: 2)
!282 = !DILocation(line: 545, column: 3, scope: !281, inlinedAt: !251)
!283 = !DILocation(line: 549, column: 2, scope: !281, inlinedAt: !251)
!284 = !DILocation(line: 68, column: 4, scope: !263)
!285 = !DILocation(line: 70, column: 56, scope: !263)
!286 = !DILocation(line: 68, column: 16, scope: !263)
!287 = !DILocation(line: 71, column: 39, scope: !263)
!288 = !DILocation(line: 71, column: 14, scope: !263)
!289 = !DILocation(line: 545, column: 17, scope: !290, inlinedAt: !251)
!290 = distinct !DILexicalBlock(scope: !223, file: !224, line: 544, column: 2)
!291 = !DILocation(line: 545, column: 3, scope: !290, inlinedAt: !251)
!292 = !DILocation(line: 549, column: 2, scope: !290, inlinedAt: !251)
!293 = !DILocation(line: 545, column: 17, scope: !294, inlinedAt: !251)
!294 = distinct !DILexicalBlock(scope: !223, file: !224, line: 544, column: 2)
!295 = !DILocation(line: 545, column: 3, scope: !294, inlinedAt: !251)
!296 = !DILocation(line: 549, column: 2, scope: !294, inlinedAt: !251)
!297 = distinct !DISubprogram(name: "convert_command_line_win32", linkageName: "std.os.process.convert_command_line_win32", scope: !2, file: !2, line: 75, type: !298, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !30)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !177}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 6, baseType: !301, align: 8)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !302, size: 64, align: 64, dwarfAddressSpace: 0)
!302 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!303 = !DILocalVariable(name: "command_line", arg: 1, scope: !297, file: !2, line: 75, type: !177)
!304 = !DILocation(line: 75, column: 48, scope: !297)
!305 = !DILocalVariable(name: "str", scope: !297, file: !2, line: 77, type: !306, align: 8)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !16, align: 8)
!307 = !DILocation(line: 77, column: 10, scope: !297)
!308 = !DILocation(line: 77, column: 25, scope: !297)
!309 = !DILocalVariable(name: ".temp", scope: !310, file: !2, line: 78, type: !90, align: 8)
!310 = distinct !DILexicalBlock(scope: !297, file: !2, line: 78, column: 2)
!311 = !DILocation(line: 78, column: 18, scope: !310)
!312 = !DILocation(line: 78, column: 11, scope: !310)
!313 = !DILocalVariable(name: "i", scope: !314, file: !2, line: 78, type: !90, align: 8)
!314 = distinct !DILexicalBlock(scope: !310, file: !2, line: 79, column: 2)
!315 = !DILocation(line: 78, column: 11, scope: !314)
!316 = !DILocalVariable(name: "s", scope: !314, file: !2, line: 78, type: !172, align: 8)
!317 = !DILocation(line: 78, column: 14, scope: !314)
!318 = !DILocation(line: 78, column: 18, scope: !314)
!319 = !DILocation(line: 80, column: 7, scope: !320)
!320 = distinct !DILexicalBlock(scope: !314, file: !2, line: 79, column: 2)
!321 = !DILocation(line: 374, column: 21, scope: !322, inlinedAt: !324)
!322 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!323 = !DIFile(filename: "dstring.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!324 = !DILocation(line: 80, column: 15, scope: !320)
!325 = !DILocation(line: 374, column: 4, scope: !322, inlinedAt: !324)
!326 = !DILocalVariable(name: "needs_escape", scope: !320, file: !2, line: 81, type: !29, align: 1)
!327 = !DILocation(line: 81, column: 8, scope: !320)
!328 = !DILocalVariable(name: ".temp", scope: !329, file: !2, line: 82, type: !90, align: 8)
!329 = distinct !DILexicalBlock(scope: !330, file: !2, line: 82, column: 4)
!330 = distinct !DILexicalBlock(scope: !320, file: !2, line: 82, column: 4)
!331 = !DILocation(line: 82, column: 17, scope: !329)
!332 = !DILocalVariable(name: "c", scope: !333, file: !2, line: 82, type: !93, align: 1)
!333 = distinct !DILexicalBlock(scope: !329, file: !2, line: 83, column: 4)
!334 = !DILocation(line: 82, column: 13, scope: !333)
!335 = !DILocation(line: 82, column: 17, scope: !333)
!336 = !DILocation(line: 89, column: 14, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !2, line: 89, column: 7)
!338 = distinct !DILexicalBlock(scope: !339, file: !2, line: 84, column: 5)
!339 = distinct !DILexicalBlock(scope: !333, file: !2, line: 83, column: 4)
!340 = !DILocation(line: 92, column: 11, scope: !330)
!341 = !DILocation(line: 94, column: 8, scope: !320)
!342 = !DILocation(line: 378, column: 22, scope: !343, inlinedAt: !344)
!343 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!344 = !DILocation(line: 96, column: 4, scope: !345)
!345 = distinct !DILexicalBlock(scope: !320, file: !2, line: 95, column: 3)
!346 = !DILocation(line: 378, column: 4, scope: !343, inlinedAt: !344)
!347 = !DILocation(line: 97, column: 4, scope: !345)
!348 = !DILocation(line: 374, column: 21, scope: !349, inlinedAt: !350)
!349 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!350 = !DILocation(line: 99, column: 3, scope: !320)
!351 = !DILocation(line: 374, column: 4, scope: !349, inlinedAt: !350)
!352 = !DILocalVariable(name: ".temp", scope: !353, file: !2, line: 100, type: !90, align: 8)
!353 = distinct !DILexicalBlock(scope: !320, file: !2, line: 100, column: 3)
!354 = !DILocation(line: 100, column: 19, scope: !353)
!355 = !DILocation(line: 100, column: 12, scope: !353)
!356 = !DILocalVariable(name: "j", scope: !357, file: !2, line: 100, type: !90, align: 8)
!357 = distinct !DILexicalBlock(scope: !353, file: !2, line: 101, column: 3)
!358 = !DILocation(line: 100, column: 12, scope: !357)
!359 = !DILocalVariable(name: "c", scope: !357, file: !2, line: 100, type: !93, align: 1)
!360 = !DILocation(line: 100, column: 15, scope: !357)
!361 = !DILocation(line: 100, column: 19, scope: !357)
!362 = !DILocation(line: 105, column: 10, scope: !363)
!363 = distinct !DILexicalBlock(scope: !364, file: !2, line: 105, column: 6)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 102, column: 4)
!365 = distinct !DILexicalBlock(scope: !357, file: !2, line: 101, column: 3)
!366 = !DILocation(line: 105, column: 15, scope: !363)
!367 = !DILocation(line: 105, column: 28, scope: !363)
!368 = !DILocation(line: 105, column: 30, scope: !363)
!369 = !DILocation(line: 374, column: 21, scope: !370, inlinedAt: !371)
!370 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!371 = !DILocation(line: 105, column: 45, scope: !363)
!372 = !DILocation(line: 374, column: 4, scope: !370, inlinedAt: !371)
!373 = !DILocation(line: 374, column: 21, scope: !374, inlinedAt: !375)
!374 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!375 = !DILocation(line: 107, column: 6, scope: !376)
!376 = distinct !DILexicalBlock(scope: !364, file: !2, line: 107, column: 6)
!377 = !DILocation(line: 374, column: 4, scope: !374, inlinedAt: !375)
!378 = !DILocation(line: 374, column: 21, scope: !379, inlinedAt: !380)
!379 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!380 = !DILocation(line: 109, column: 4, scope: !365)
!381 = !DILocation(line: 374, column: 4, scope: !379, inlinedAt: !380)
!382 = !DILocation(line: 374, column: 21, scope: !383, inlinedAt: !384)
!383 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!384 = !DILocation(line: 111, column: 3, scope: !320)
!385 = !DILocation(line: 374, column: 4, scope: !383, inlinedAt: !384)
!386 = !DILocation(line: 374, column: 21, scope: !387, inlinedAt: !388)
!387 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!388 = !DILocation(line: 113, column: 2, scope: !297)
!389 = !DILocation(line: 374, column: 4, scope: !387, inlinedAt: !388)
!390 = !DILocation(line: 114, column: 9, scope: !297)
!391 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 120, type: !392, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !30)
!392 = !DISubroutineType(types: !393)
!393 = !{!78, !17, !177, !138, !177}
!394 = !DILocalVariable(name: "command_line", arg: 1, scope: !391, file: !2, line: 120, type: !177)
!395 = !DILocation(line: 120, column: 32, scope: !391)
!396 = !DILocalVariable(name: "options", arg: 2, scope: !391, file: !2, line: 120, type: !138)
!397 = !DILocation(line: 120, column: 64, scope: !391)
!398 = !DILocalVariable(name: "environment", arg: 3, scope: !391, file: !2, line: 120, type: !177)
!399 = !DILocation(line: 120, column: 87, scope: !391)
!400 = !DILocation(line: 118, column: 12, scope: !401)
!401 = distinct !DILexicalBlock(scope: !391, file: !2, line: 121, column: 1)
!402 = !DILocation(line: 118, column: 28, scope: !401)
!403 = !DILocation(line: 118, column: 11, scope: !401)
!404 = !DILocalVariable(name: "rd", scope: !391, file: !2, line: 122, type: !16, align: 8)
!405 = !DILocation(line: 122, column: 8, scope: !391)
!406 = !DILocalVariable(name: "wr", scope: !391, file: !2, line: 122, type: !16, align: 8)
!407 = !DILocation(line: 122, column: 12, scope: !391)
!408 = !DILocalVariable(name: "flags", scope: !391, file: !2, line: 123, type: !158, align: 4)
!409 = !DILocation(line: 123, column: 14, scope: !391)
!410 = !DILocation(line: 123, column: 29, scope: !391)
!411 = !DILocalVariable(name: "process_info", scope: !391, file: !2, line: 124, type: !412, align: 8)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_PROCESS_INFORMATION", scope: !2, file: !2, line: 259, size: 192, align: 64, elements: !413, identifier: "std.os.win32.Win32_PROCESS_INFORMATION")
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !412, file: !2, line: 261, baseType: !24, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "hThread", scope: !412, file: !2, line: 262, baseType: !24, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dwProcessId", scope: !412, file: !2, line: 263, baseType: !158, size: 32, align: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dwThreadId", scope: !412, file: !2, line: 264, baseType: !158, size: 32, align: 32, offset: 160)
!418 = !DILocation(line: 124, column: 28, scope: !391)
!419 = !DILocalVariable(name: "sa_attr", scope: !391, file: !2, line: 125, type: !210, align: 8)
!420 = !DILocation(line: 125, column: 28, scope: !391)
!421 = !DILocation(line: 125, column: 80, scope: !391)
!422 = !DILocalVariable(name: "start_info", scope: !391, file: !2, line: 126, type: !423, align: 8)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_STARTUPINFOW", scope: !2, file: !2, line: 205, size: 832, align: 64, elements: !424, identifier: "std.os.win32.Win32_STARTUPINFOW")
!424 = !{!425, !426, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !440, !441, !443, !444, !445}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !423, file: !2, line: 207, baseType: !158, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved", scope: !423, file: !2, line: 208, baseType: !427, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPWSTR", scope: !2, file: !2, line: 82, baseType: !301, align: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lpDesktop", scope: !423, file: !2, line: 209, baseType: !427, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lpTitle", scope: !423, file: !2, line: 210, baseType: !427, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dwX", scope: !423, file: !2, line: 211, baseType: !158, size: 32, align: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dwY", scope: !423, file: !2, line: 212, baseType: !158, size: 32, align: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dwXSize", scope: !423, file: !2, line: 213, baseType: !158, size: 32, align: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dwYSize", scope: !423, file: !2, line: 214, baseType: !158, size: 32, align: 32, offset: 352)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dwXCountChars", scope: !423, file: !2, line: 215, baseType: !158, size: 32, align: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dwYCountChars", scope: !423, file: !2, line: 216, baseType: !158, size: 32, align: 32, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dwFillAttribute", scope: !423, file: !2, line: 217, baseType: !158, size: 32, align: 32, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !423, file: !2, line: 218, baseType: !158, size: 32, align: 32, offset: 480)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "wShowWindow", scope: !423, file: !2, line: 219, baseType: !439, size: 16, align: 16, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 169, baseType: !302, align: 2)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cbReserved2", scope: !423, file: !2, line: 220, baseType: !439, size: 16, align: 16, offset: 528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved2", scope: !423, file: !2, line: 221, baseType: !442, size: 64, align: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPBYTE", scope: !2, file: !2, line: 68, baseType: !92, align: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !423, file: !2, line: 222, baseType: !24, size: 64, align: 64, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hStdOutput", scope: !423, file: !2, line: 223, baseType: !24, size: 64, align: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hStdError", scope: !423, file: !2, line: 224, baseType: !24, size: 64, align: 64, offset: 768)
!446 = !DILocation(line: 126, column: 21, scope: !391)
!447 = !DILocation(line: 127, column: 9, scope: !391)
!448 = !DILocation(line: 128, column: 21, scope: !391)
!449 = !DILocation(line: 130, column: 6, scope: !391)
!450 = !DILocation(line: 130, column: 25, scope: !391)
!451 = !DILocation(line: 131, column: 14, scope: !391)
!452 = !DILocation(line: 131, column: 56, scope: !391)
!453 = !DILocation(line: 133, column: 67, scope: !391)
!454 = !DILocation(line: 133, column: 14, scope: !391)
!455 = !DILocation(line: 133, column: 78, scope: !391)
!456 = !DILocalVariable(name: "stdin", scope: !391, file: !2, line: 135, type: !15, align: 8)
!457 = !DILocation(line: 135, column: 8, scope: !391)
!458 = !DILocalVariable(name: "stdout", scope: !391, file: !2, line: 136, type: !15, align: 8)
!459 = !DILocation(line: 136, column: 8, scope: !391)
!460 = !DILocalVariable(name: "stderr", scope: !391, file: !2, line: 137, type: !15, align: 8)
!461 = !DILocation(line: 137, column: 8, scope: !391)
!462 = !DILocalVariable(name: "current", scope: !463, file: !2, line: 536, type: !225, align: 8)
!463 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !224, file: !224, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !30)
!464 = !DILocation(line: 536, column: 17, scope: !463, inlinedAt: !465)
!465 = !DILocation(line: 138, column: 2, scope: !391)
!466 = !DILocation(line: 396, column: 7, scope: !467, inlinedAt: !468)
!467 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !254, file: !254, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!468 = !DILocation(line: 536, column: 38, scope: !463, inlinedAt: !465)
!469 = !DILocation(line: 398, column: 3, scope: !470, inlinedAt: !468)
!470 = distinct !DILexicalBlock(scope: !467, file: !254, line: 397, column: 2)
!471 = !DILocation(line: 400, column: 9, scope: !467, inlinedAt: !468)
!472 = !DILocalVariable(name: "mark", scope: !463, file: !2, line: 542, type: !90, align: 8)
!473 = !DILocation(line: 542, column: 6, scope: !463, inlinedAt: !465)
!474 = !DILocation(line: 542, column: 13, scope: !463, inlinedAt: !465)
!475 = !DILocalVariable(name: "used_environment", scope: !476, file: !2, line: 140, type: !300, align: 8)
!476 = distinct !DILexicalBlock(scope: !391, file: !2, line: 139, column: 2)
!477 = !DILocation(line: 140, column: 11, scope: !476)
!478 = !DILocation(line: 140, column: 30, scope: !476)
!479 = !DILocation(line: 141, column: 8, scope: !476)
!480 = !DILocalVariable(name: "env", scope: !481, file: !2, line: 143, type: !306, align: 8)
!481 = distinct !DILexicalBlock(scope: !476, file: !2, line: 142, column: 3)
!482 = !DILocation(line: 143, column: 12, scope: !481)
!483 = !DILocation(line: 143, column: 27, scope: !481)
!484 = !DILocation(line: 144, column: 9, scope: !481)
!485 = !DILocation(line: 378, column: 22, scope: !486, inlinedAt: !487)
!486 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!487 = !DILocation(line: 146, column: 5, scope: !488)
!488 = distinct !DILexicalBlock(scope: !481, file: !2, line: 145, column: 4)
!489 = !DILocation(line: 378, column: 4, scope: !486, inlinedAt: !487)
!490 = !DILocalVariable(name: ".temp", scope: !491, file: !2, line: 148, type: !90, align: 8)
!491 = distinct !DILexicalBlock(scope: !481, file: !2, line: 148, column: 4)
!492 = !DILocation(line: 148, column: 24, scope: !491)
!493 = !DILocalVariable(name: "s", scope: !494, file: !2, line: 148, type: !172, align: 8)
!494 = distinct !DILexicalBlock(scope: !491, file: !2, line: 149, column: 4)
!495 = !DILocation(line: 148, column: 20, scope: !494)
!496 = !DILocation(line: 148, column: 24, scope: !494)
!497 = !DILocation(line: 378, column: 22, scope: !498, inlinedAt: !499)
!498 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!499 = !DILocation(line: 150, column: 5, scope: !500)
!500 = distinct !DILexicalBlock(scope: !494, file: !2, line: 149, column: 4)
!501 = !DILocation(line: 378, column: 4, scope: !498, inlinedAt: !499)
!502 = !DILocation(line: 378, column: 22, scope: !503, inlinedAt: !504)
!503 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!504 = !DILocation(line: 151, column: 5, scope: !500)
!505 = !DILocation(line: 378, column: 4, scope: !503, inlinedAt: !504)
!506 = !DILocation(line: 378, column: 22, scope: !507, inlinedAt: !508)
!507 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !323, file: !323, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!508 = !DILocation(line: 153, column: 4, scope: !481)
!509 = !DILocation(line: 378, column: 4, scope: !507, inlinedAt: !508)
!510 = !DILocation(line: 154, column: 23, scope: !481)
!511 = !DILocation(line: 545, column: 17, scope: !512, inlinedAt: !465)
!512 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!513 = !DILocation(line: 545, column: 3, scope: !512, inlinedAt: !465)
!514 = !DILocation(line: 549, column: 2, scope: !512, inlinedAt: !465)
!515 = !DILocalVariable(name: "fd", scope: !476, file: !2, line: 156, type: !138, align: 4)
!516 = !DILocation(line: 156, column: 7, scope: !476)
!517 = !DILocation(line: 156, column: 36, scope: !476)
!518 = !DILocation(line: 156, column: 19, scope: !476)
!519 = !DILocation(line: 157, column: 7, scope: !476)
!520 = !DILocation(line: 159, column: 31, scope: !521)
!521 = distinct !DILexicalBlock(scope: !476, file: !2, line: 158, column: 3)
!522 = !DILocation(line: 159, column: 19, scope: !521)
!523 = !DILocation(line: 160, column: 9, scope: !521)
!524 = !DILocation(line: 545, column: 17, scope: !525, inlinedAt: !465)
!525 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!526 = !DILocation(line: 545, column: 3, scope: !525, inlinedAt: !465)
!527 = !DILocation(line: 549, column: 2, scope: !525, inlinedAt: !465)
!528 = !DILocation(line: 162, column: 3, scope: !476)
!529 = !DILocation(line: 162, column: 26, scope: !476)
!530 = !DILocation(line: 163, column: 7, scope: !476)
!531 = !DILocation(line: 165, column: 4, scope: !532)
!532 = distinct !DILexicalBlock(scope: !476, file: !2, line: 164, column: 3)
!533 = !DILocation(line: 545, column: 17, scope: !534, inlinedAt: !465)
!534 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!535 = !DILocation(line: 545, column: 3, scope: !534, inlinedAt: !465)
!536 = !DILocation(line: 549, column: 2, scope: !534, inlinedAt: !465)
!537 = !DILocation(line: 169, column: 16, scope: !538)
!538 = distinct !DILexicalBlock(scope: !476, file: !2, line: 168, column: 3)
!539 = !DILocation(line: 545, column: 17, scope: !540, inlinedAt: !465)
!540 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!541 = !DILocation(line: 545, column: 3, scope: !540, inlinedAt: !465)
!542 = !DILocation(line: 549, column: 2, scope: !540, inlinedAt: !465)
!543 = !DILocation(line: 171, column: 68, scope: !476)
!544 = !DILocation(line: 171, column: 15, scope: !476)
!545 = !DILocation(line: 545, column: 17, scope: !546, inlinedAt: !465)
!546 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!547 = !DILocation(line: 545, column: 3, scope: !546, inlinedAt: !465)
!548 = !DILocation(line: 549, column: 2, scope: !546, inlinedAt: !465)
!549 = !DILocation(line: 172, column: 32, scope: !476)
!550 = !DILocation(line: 172, column: 15, scope: !476)
!551 = !DILocation(line: 173, column: 7, scope: !476)
!552 = !DILocation(line: 175, column: 32, scope: !553)
!553 = distinct !DILexicalBlock(scope: !476, file: !2, line: 174, column: 3)
!554 = !DILocation(line: 175, column: 20, scope: !553)
!555 = !DILocation(line: 176, column: 9, scope: !553)
!556 = !DILocation(line: 545, column: 17, scope: !557, inlinedAt: !465)
!557 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!558 = !DILocation(line: 545, column: 3, scope: !557, inlinedAt: !465)
!559 = !DILocation(line: 549, column: 2, scope: !557, inlinedAt: !465)
!560 = !DILocation(line: 179, column: 3, scope: !476)
!561 = !DILocation(line: 179, column: 27, scope: !476)
!562 = !DILocation(line: 182, column: 8, scope: !563)
!563 = distinct !DILexicalBlock(scope: !476, file: !2, line: 182, column: 4)
!564 = !DILocation(line: 184, column: 14, scope: !565)
!565 = distinct !DILexicalBlock(scope: !563, file: !2, line: 183, column: 4)
!566 = !DILocation(line: 185, column: 5, scope: !565)
!567 = !DILocation(line: 185, column: 28, scope: !565)
!568 = !DILocation(line: 186, column: 11, scope: !565)
!569 = !DILocation(line: 188, column: 8, scope: !563)
!570 = !DILocation(line: 190, column: 5, scope: !571)
!571 = distinct !DILexicalBlock(scope: !563, file: !2, line: 189, column: 4)
!572 = !DILocation(line: 194, column: 17, scope: !573)
!573 = distinct !DILexicalBlock(scope: !563, file: !2, line: 193, column: 4)
!574 = !DILocation(line: 194, column: 59, scope: !573)
!575 = !DILocation(line: 196, column: 69, scope: !563)
!576 = !DILocation(line: 196, column: 16, scope: !563)
!577 = !DILocation(line: 196, column: 80, scope: !563)
!578 = !DILocation(line: 198, column: 33, scope: !563)
!579 = !DILocation(line: 198, column: 16, scope: !563)
!580 = !DILocation(line: 199, column: 8, scope: !563)
!581 = !DILocation(line: 201, column: 33, scope: !582)
!582 = distinct !DILexicalBlock(scope: !563, file: !2, line: 200, column: 4)
!583 = !DILocation(line: 201, column: 21, scope: !582)
!584 = !DILocation(line: 202, column: 10, scope: !582)
!585 = !DILocation(line: 202, column: 25, scope: !582)
!586 = !DILocation(line: 204, column: 4, scope: !563)
!587 = !DILocation(line: 204, column: 27, scope: !563)
!588 = !DILocation(line: 545, column: 17, scope: !589, inlinedAt: !465)
!589 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!590 = !DILocation(line: 545, column: 3, scope: !589, inlinedAt: !465)
!591 = !DILocation(line: 549, column: 2, scope: !589, inlinedAt: !465)
!592 = !DILocalVariable(name: "event_output", scope: !476, file: !2, line: 207, type: !16, align: 8)
!593 = !DILocation(line: 207, column: 9, scope: !476)
!594 = !DILocalVariable(name: "event_error", scope: !476, file: !2, line: 208, type: !16, align: 8)
!595 = !DILocation(line: 208, column: 9, scope: !476)
!596 = !DILocation(line: 209, column: 7, scope: !476)
!597 = !DILocation(line: 211, column: 26, scope: !598)
!598 = distinct !DILexicalBlock(scope: !476, file: !2, line: 210, column: 3)
!599 = !DILocation(line: 212, column: 25, scope: !598)
!600 = !DILocation(line: 216, column: 4, scope: !476)
!601 = !DILocation(line: 221, column: 4, scope: !476)
!602 = !DILocation(line: 224, column: 5, scope: !476)
!603 = !DILocation(line: 214, column: 15, scope: !476)
!604 = !DILocation(line: 545, column: 17, scope: !605, inlinedAt: !465)
!605 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!606 = !DILocation(line: 545, column: 3, scope: !605, inlinedAt: !465)
!607 = !DILocation(line: 549, column: 2, scope: !605, inlinedAt: !465)
!608 = !DILocation(line: 545, column: 17, scope: !609, inlinedAt: !465)
!609 = distinct !DILexicalBlock(scope: !463, file: !224, line: 544, column: 2)
!610 = !DILocation(line: 545, column: 3, scope: !609, inlinedAt: !465)
!611 = !DILocation(line: 227, column: 21, scope: !391)
!612 = !DILocation(line: 227, column: 9, scope: !391)
!613 = !DILocation(line: 228, column: 6, scope: !391)
!614 = !DILocation(line: 230, column: 22, scope: !615)
!615 = distinct !DILexicalBlock(scope: !391, file: !2, line: 229, column: 2)
!616 = !DILocation(line: 230, column: 10, scope: !615)
!617 = !DILocation(line: 231, column: 7, scope: !615)
!618 = !DILocation(line: 231, column: 32, scope: !615)
!619 = !DILocation(line: 231, column: 73, scope: !615)
!620 = !DILocation(line: 231, column: 61, scope: !615)
!621 = !DILocation(line: 235, column: 15, scope: !391)
!622 = !DILocation(line: 236, column: 16, scope: !391)
!623 = !DILocation(line: 237, column: 17, scope: !391)
!624 = !DILocation(line: 238, column: 18, scope: !391)
!625 = !DILocation(line: 239, column: 18, scope: !391)
!626 = !DILocation(line: 240, column: 15, scope: !391)
!627 = distinct !DISubprogram(name: "read_from_file_win32", linkageName: "std.os.process.read_from_file_win32", scope: !2, file: !2, line: 411, type: !628, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !30)
!628 = !DISubroutineType(types: !629)
!629 = !{!78, !89, !16, !16, !92, !91}
!630 = !DILocalVariable(name: "file", arg: 1, scope: !627, file: !2, line: 411, type: !15)
!631 = !DILocation(line: 411, column: 36, scope: !627)
!632 = !DILocalVariable(name: "event_handle", arg: 2, scope: !627, file: !2, line: 411, type: !24)
!633 = !DILocation(line: 411, column: 55, scope: !627)
!634 = !DILocalVariable(name: "buffer", arg: 3, scope: !627, file: !2, line: 411, type: !92)
!635 = !DILocation(line: 411, column: 75, scope: !627)
!636 = !DILocalVariable(name: "size", arg: 4, scope: !627, file: !2, line: 411, type: !90)
!637 = !DILocation(line: 411, column: 87, scope: !627)
!638 = !DILocation(line: 409, column: 11, scope: !639)
!639 = distinct !DILexicalBlock(scope: !627, file: !2, line: 412, column: 1)
!640 = !DILocalVariable(name: "fd", scope: !627, file: !2, line: 413, type: !137, align: 4)
!641 = !DILocation(line: 413, column: 7, scope: !627)
!642 = !DILocation(line: 413, column: 25, scope: !627)
!643 = !DILocation(line: 413, column: 18, scope: !627)
!644 = !DILocalVariable(name: "bytes_read", scope: !627, file: !2, line: 414, type: !158, align: 4)
!645 = !DILocation(line: 414, column: 14, scope: !627)
!646 = !DILocation(line: 414, column: 27, scope: !627)
!647 = !DILocalVariable(name: "overlapped", scope: !627, file: !2, line: 415, type: !648, align: 8)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_OVERLAPPED", scope: !2, file: !2, line: 227, size: 256, align: 64, elements: !649, identifier: "std.os.win32.Win32_OVERLAPPED")
!649 = !{!650, !652, !653, !663}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !648, file: !2, line: 229, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONG_PTR", scope: !2, file: !2, line: 163, baseType: !91, align: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "internalHigh", scope: !648, file: !2, line: 230, baseType: !651, size: 64, align: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !648, file: !2, line: 231, baseType: !654, size: 64, align: 64, offset: 128)
!654 = !DICompositeType(tag: DW_TAG_union_type, scope: !648, file: !2, line: 231, size: 64, align: 64, elements: !655)
!655 = !{!656, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !654, file: !2, line: 232, baseType: !657, size: 64, align: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !654, file: !2, line: 232, size: 64, align: 64, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !657, file: !2, line: 233, baseType: !158, size: 32, align: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "offsetHigh", scope: !657, file: !2, line: 234, baseType: !158, size: 32, align: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !654, file: !2, line: 236, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_PVOID", scope: !2, file: !2, line: 139, baseType: !16, align: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "hEvent", scope: !648, file: !2, line: 238, baseType: !24, size: 64, align: 64, offset: 192)
!664 = !DILocation(line: 415, column: 19, scope: !627)
!665 = !DILocation(line: 415, column: 44, scope: !627)
!666 = !DILocalVariable(name: "handle", scope: !627, file: !2, line: 416, type: !24, align: 8)
!667 = !DILocation(line: 416, column: 15, scope: !627)
!668 = !DILocation(line: 416, column: 60, scope: !627)
!669 = !DILocation(line: 416, column: 25, scope: !627)
!670 = !DILocation(line: 417, column: 31, scope: !627)
!671 = !DILocation(line: 417, column: 40, scope: !627)
!672 = !DILocation(line: 417, column: 72, scope: !627)
!673 = !DILocation(line: 417, column: 14, scope: !627)
!674 = !DILocation(line: 420, column: 14, scope: !675)
!675 = distinct !DILexicalBlock(scope: !627, file: !2, line: 418, column: 2)
!676 = !DILocation(line: 422, column: 70, scope: !677)
!677 = distinct !DILexicalBlock(scope: !675, file: !2, line: 421, column: 3)
!678 = !DILocation(line: 422, column: 16, scope: !677)
!679 = !DILocation(line: 424, column: 20, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !2, line: 424, column: 5)
!681 = distinct !DILexicalBlock(scope: !677, file: !2, line: 423, column: 4)
!682 = !DILocation(line: 428, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !680, file: !2, line: 428, column: 7)
!684 = !DILocation(line: 430, column: 14, scope: !685)
!685 = distinct !DILexicalBlock(scope: !680, file: !2, line: 430, column: 7)
!686 = !DILocation(line: 435, column: 9, scope: !627)
