; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%File = type { ptr }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

$std.compression.qoi.write = comdat any

$std.compression.qoi.read = comdat any

$std.compression.qoi.encode = comdat any

$std.compression.qoi.decode = comdat any

$.dyn_search = comdat any

$"$ct.std.compression.qoi.QOIDesc" = comdat any

$"std.compression.qoi.QOIError$INVALID_PARAMETERS" = comdat any

$"std.compression.qoi.QOIError$FILE_OPEN_FAILED" = comdat any

$"std.compression.qoi.QOIError$FILE_WRITE_FAILED" = comdat any

$"std.compression.qoi.QOIError$INVALID_DATA" = comdat any

$"std.compression.qoi.QOIError$TOO_MANY_PIXELS" = comdat any

$"$ct.std.compression.qoi.QOIError" = comdat any

$"$ct.char" = comdat any

$"$ct.std.compression.qoi.QOIColorspace" = comdat any

$"std.compression.qoi.QOIColorspace$id" = comdat any

$"$ct.std.compression.qoi.QOIChannels" = comdat any

$"std.compression.qoi.QOIChannels$id" = comdat any

$"$ct.std.compression.qoi.Header" = comdat any

$"$ct.std.compression.qoi.Pixel" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "C:/Dev/C3/c3-windows/lib/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 393, type: !6, isLocal: true, isDefinition: true, align: 1)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 394, type: !6, isLocal: true, isDefinition: true, align: 1)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 396, type: !6, isLocal: true, isDefinition: true, align: 1)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 397, type: !6, isLocal: true, isDefinition: true, align: 1)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 398, type: !6, isLocal: true, isDefinition: true, align: 1)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 399, type: !6, isLocal: true, isDefinition: true, align: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 412, type: !19, isLocal: true, isDefinition: true, align: 1)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"CodeView", i32 1}
!24 = !{i32 1, !"uwtable", i32 2}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !42, splitDebugInlining: false)
!26 = !{!27, !34}
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !28, file: !2, line: 22, baseType: !6, size: 8, align: 8, elements: !38)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 33, size: 96, align: 32, elements: !29, identifier: "std.compression.qoi.QOIDesc")
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !28, file: !2, line: 35, baseType: !3, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !28, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !28, file: !2, line: 37, baseType: !27, size: 8, align: 8, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !28, file: !2, line: 38, baseType: !34, size: 8, align: 8, offset: 72)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !28, file: !2, line: 10, baseType: !6, size: 8, align: 8, elements: !35)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "SRGB", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "LINEAR", value: 1, isUnsigned: true)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "AUTO", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RGB", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RGBA", value: 2, isUnsigned: true)
!42 = !{!0, !4, !7, !9, !11, !13, !15, !17}
!43 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 74, type: !44, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !58)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !48, !51, !52, !57}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !47)
!47 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !50)
!50 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !53, identifier: "char[]")
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !52, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, baseType: !49, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !{}
!59 = !DILocalVariable(name: "filename", arg: 1, scope: !43, file: !2, line: 74, type: !51)
!60 = !DILocation(line: 74, column: 22, scope: !43)
!61 = !DILocalVariable(name: "input", arg: 2, scope: !43, file: !2, line: 74, type: !52)
!62 = !DILocation(line: 74, column: 39, scope: !43)
!63 = !DILocation(line: 75, column: 1, scope: !43)
!64 = !DILocalVariable(name: "desc", arg: 3, scope: !43, file: !2, line: 74, type: !57)
!65 = !DILocation(line: 74, column: 55, scope: !43)
!66 = !DILocalVariable(name: "current", scope: !67, file: !2, line: 536, type: !69, align: 8)
!67 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !68, file: !68, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!68 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !71, identifier: "std.core.mem.allocator.TempAllocator")
!71 = !{!72, !79, !92, !93, !94}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !70, file: !2, line: 12, baseType: !73, size: 128, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !74, identifier: "Allocator")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !70, file: !2, line: 13, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !82, identifier: "std.core.mem.allocator.TempAllocatorPage")
!82 = !{!83, !84, !85, !86, !87, !88}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !81, file: !2, line: 24, baseType: !80, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !81, file: !2, line: 25, baseType: !76, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !81, file: !2, line: 26, baseType: !49, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !2, line: 27, baseType: !49, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !81, file: !2, line: 28, baseType: !49, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !81, file: !2, line: 29, baseType: !89, align: 8, offset: 320)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 0, lowerBound: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !70, file: !2, line: 14, baseType: !49, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !70, file: !2, line: 15, baseType: !49, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !2, line: 16, baseType: !89, align: 8, offset: 320)
!95 = !DILocation(line: 536, column: 17, scope: !67, inlinedAt: !96)
!96 = !DILocation(line: 76, column: 2, scope: !43)
!97 = !DILocation(line: 396, column: 7, scope: !98, inlinedAt: !100)
!98 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !99, file: !99, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!99 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!100 = !DILocation(line: 536, column: 38, scope: !67, inlinedAt: !96)
!101 = !DILocation(line: 398, column: 3, scope: !102, inlinedAt: !100)
!102 = distinct !DILexicalBlock(scope: !98, file: !99, line: 397, column: 2)
!103 = !DILocation(line: 400, column: 9, scope: !98, inlinedAt: !100)
!104 = !DILocalVariable(name: "mark", scope: !67, file: !2, line: 542, type: !49, align: 8)
!105 = !DILocation(line: 542, column: 6, scope: !67, inlinedAt: !96)
!106 = !DILocation(line: 542, column: 13, scope: !67, inlinedAt: !96)
!107 = !DILocalVariable(name: "output", scope: !108, file: !2, line: 78, type: !52, align: 8)
!108 = distinct !DILexicalBlock(scope: !43, file: !2, line: 76, column: 10)
!109 = !DILocation(line: 78, column: 10, scope: !108)
!110 = !DILocation(line: 78, column: 19, scope: !108)
!111 = !DILocation(line: 545, column: 17, scope: !112, inlinedAt: !96)
!112 = distinct !DILexicalBlock(scope: !67, file: !68, line: 544, column: 2)
!113 = !DILocation(line: 545, column: 3, scope: !112, inlinedAt: !96)
!114 = !DILocation(line: 549, column: 2, scope: !112, inlinedAt: !96)
!115 = !DILocalVariable(name: "f", scope: !108, file: !2, line: 81, type: !116, align: 8)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !117, identifier: "std.io.File")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !116, file: !2, line: 6, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 360, baseType: !76, align: 8)
!120 = !DILocation(line: 81, column: 9, scope: !108)
!121 = !DILocation(line: 81, column: 19, scope: !108)
!122 = !DILocation(line: 82, column: 13, scope: !108)
!123 = !DILocation(line: 545, column: 17, scope: !124, inlinedAt: !96)
!124 = distinct !DILexicalBlock(scope: !67, file: !68, line: 544, column: 2)
!125 = !DILocation(line: 545, column: 3, scope: !124, inlinedAt: !96)
!126 = !DILocation(line: 549, column: 2, scope: !124, inlinedAt: !96)
!127 = !DILocalVariable(name: "written", scope: !108, file: !2, line: 85, type: !50, align: 8)
!128 = !DILocation(line: 85, column: 8, scope: !108)
!129 = !DILocation(line: 85, column: 18, scope: !108)
!130 = !DILocation(line: 86, column: 13, scope: !108)
!131 = !DILocation(line: 545, column: 17, scope: !132, inlinedAt: !96)
!132 = distinct !DILexicalBlock(scope: !67, file: !68, line: 544, column: 2)
!133 = !DILocation(line: 545, column: 3, scope: !132, inlinedAt: !96)
!134 = !DILocation(line: 549, column: 2, scope: !132, inlinedAt: !96)
!135 = !DILocation(line: 87, column: 13, scope: !108)
!136 = !DILocation(line: 545, column: 17, scope: !137, inlinedAt: !96)
!137 = distinct !DILexicalBlock(scope: !67, file: !68, line: 544, column: 2)
!138 = !DILocation(line: 545, column: 3, scope: !137, inlinedAt: !96)
!139 = !DILocation(line: 549, column: 2, scope: !137, inlinedAt: !96)
!140 = !DILocation(line: 89, column: 10, scope: !108)
!141 = !DILocation(line: 545, column: 17, scope: !142, inlinedAt: !96)
!142 = distinct !DILexicalBlock(scope: !67, file: !68, line: 544, column: 2)
!143 = !DILocation(line: 545, column: 3, scope: !142, inlinedAt: !96)
!144 = !DILocation(line: 549, column: 2, scope: !142, inlinedAt: !96)
!145 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 115, type: !146, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !58)
!146 = !DISubroutineType(types: !147)
!147 = !{!46, !148, !51, !57, !27, !73}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DILocalVariable(name: "filename", arg: 1, scope: !145, file: !2, line: 115, type: !51)
!150 = !DILocation(line: 115, column: 24, scope: !145)
!151 = !DILocation(line: 116, column: 1, scope: !145)
!152 = !DILocalVariable(name: "desc", arg: 2, scope: !145, file: !2, line: 115, type: !57)
!153 = !DILocation(line: 115, column: 43, scope: !145)
!154 = !DILocalVariable(name: "channels", arg: 3, scope: !145, file: !2, line: 115, type: !27)
!155 = !DILocation(line: 115, column: 61, scope: !145)
!156 = !DILocalVariable(name: "allocator", arg: 4, scope: !145, file: !2, line: 115, type: !73)
!157 = !DILocation(line: 115, column: 88, scope: !145)
!158 = !DILocalVariable(name: "data", scope: !145, file: !2, line: 118, type: !52, align: 8)
!159 = !DILocation(line: 118, column: 10, scope: !145)
!160 = !DILocation(line: 118, column: 23, scope: !145)
!161 = !DILocation(line: 119, column: 12, scope: !145)
!162 = !DILocation(line: 119, column: 25, scope: !145)
!163 = !DILocation(line: 123, column: 9, scope: !145)
!164 = !DILocation(line: 120, column: 18, scope: !165)
!165 = distinct !DILexicalBlock(scope: !145, file: !2, line: 120, column: 13)
!166 = !DILocation(line: 120, column: 13, scope: !165)
!167 = !DILocation(line: 120, column: 18, scope: !168)
!168 = distinct !DILexicalBlock(scope: !145, file: !2, line: 120, column: 13)
!169 = !DILocation(line: 120, column: 13, scope: !168)
!170 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 144, type: !171, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !58)
!171 = !DISubroutineType(types: !172)
!172 = !{!46, !148, !52, !57, !73}
!173 = !DILocation(line: 145, column: 1, scope: !170)
!174 = !DILocalVariable(name: "input", arg: 1, scope: !170, file: !2, line: 144, type: !52)
!175 = !DILocation(line: 144, column: 26, scope: !170)
!176 = !DILocalVariable(name: "desc", arg: 2, scope: !170, file: !2, line: 144, type: !57)
!177 = !DILocation(line: 144, column: 42, scope: !170)
!178 = !DILocalVariable(name: "allocator", arg: 3, scope: !170, file: !2, line: 144, type: !73)
!179 = !DILocation(line: 144, column: 58, scope: !170)
!180 = !DILocation(line: 147, column: 6, scope: !170)
!181 = !DILocation(line: 147, column: 25, scope: !170)
!182 = !DILocation(line: 147, column: 50, scope: !170)
!183 = !DILocation(line: 148, column: 6, scope: !170)
!184 = !DILocation(line: 148, column: 36, scope: !170)
!185 = !DILocalVariable(name: "pixels", scope: !170, file: !2, line: 149, type: !3, align: 4)
!186 = !DILocation(line: 149, column: 7, scope: !170)
!187 = !DILocation(line: 149, column: 16, scope: !170)
!188 = !DILocation(line: 149, column: 29, scope: !170)
!189 = !DILocation(line: 150, column: 6, scope: !170)
!190 = !DILocation(line: 150, column: 34, scope: !170)
!191 = !DILocalVariable(name: "image_size", scope: !170, file: !2, line: 153, type: !3, align: 4)
!192 = !DILocation(line: 153, column: 7, scope: !170)
!193 = !DILocation(line: 153, column: 20, scope: !170)
!194 = !DILocation(line: 153, column: 29, scope: !170)
!195 = !DILocation(line: 154, column: 6, scope: !170)
!196 = !DILocation(line: 154, column: 20, scope: !170)
!197 = !DILocation(line: 154, column: 38, scope: !170)
!198 = !DILocalVariable(name: "max_size", scope: !170, file: !2, line: 158, type: !3, align: 4)
!199 = !DILocation(line: 158, column: 7, scope: !170)
!200 = !DILocation(line: 158, column: 34, scope: !170)
!201 = !DILocation(line: 158, column: 18, scope: !170)
!202 = !DILocation(line: 158, column: 43, scope: !170)
!203 = !DILocalVariable(name: "output", scope: !170, file: !2, line: 159, type: !52, align: 8)
!204 = !DILocation(line: 159, column: 9, scope: !170)
!205 = !DILocation(line: 159, column: 58, scope: !170)
!206 = !DILocation(line: 286, column: 55, scope: !207, inlinedAt: !208)
!207 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !99, file: !99, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!208 = !DILocation(line: 269, column: 9, scope: !209, inlinedAt: !210)
!209 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !99, file: !99, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!210 = !DILocation(line: 159, column: 29, scope: !170)
!211 = !DILocation(line: 286, column: 40, scope: !207, inlinedAt: !208)
!212 = !DILocation(line: 62, column: 7, scope: !213, inlinedAt: !214)
!213 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !99, file: !99, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!214 = !DILocation(line: 286, column: 11, scope: !207, inlinedAt: !208)
!215 = !DILocation(line: 62, column: 20, scope: !213, inlinedAt: !214)
!216 = !DILocation(line: 28, column: 71, scope: !217, inlinedAt: !218)
!217 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !99, file: !99, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!218 = !DILocation(line: 68, column: 10, scope: !213, inlinedAt: !214)
!219 = !DILocation(line: 286, column: 67, scope: !207, inlinedAt: !208)
!220 = !DILocation(line: 163, column: 12, scope: !170)
!221 = !DILocation(line: 11, column: 36, scope: !222, inlinedAt: !224)
!222 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!223 = !DIFile(filename: "bits.c3", directory: "C:/Dev/C3/c3-windows/lib/std")
!224 = !DILocation(line: 164, column: 15, scope: !170)
!225 = !DILocation(line: 165, column: 21, scope: !170)
!226 = !DILocation(line: 11, column: 36, scope: !227, inlinedAt: !228)
!227 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!228 = !DILocation(line: 165, column: 15, scope: !170)
!229 = !DILocation(line: 166, column: 22, scope: !170)
!230 = !DILocation(line: 11, column: 36, scope: !231, inlinedAt: !232)
!231 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!232 = !DILocation(line: 166, column: 16, scope: !170)
!233 = !DILocation(line: 167, column: 15, scope: !170)
!234 = !DILocation(line: 168, column: 17, scope: !170)
!235 = !DILocalVariable(name: "pos", scope: !170, file: !2, line: 171, type: !3, align: 4)
!236 = !DILocation(line: 171, column: 7, scope: !170)
!237 = !DILocation(line: 171, column: 13, scope: !170)
!238 = !DILocalVariable(name: "loc", scope: !170, file: !2, line: 172, type: !3, align: 4)
!239 = !DILocation(line: 172, column: 7, scope: !170)
!240 = !DILocalVariable(name: "loc_end", scope: !170, file: !2, line: 173, type: !3, align: 4)
!241 = !DILocation(line: 173, column: 7, scope: !170)
!242 = !DILocation(line: 173, column: 17, scope: !170)
!243 = !DILocation(line: 173, column: 30, scope: !170)
!244 = !DILocalVariable(name: "run_length", scope: !170, file: !2, line: 174, type: !6, align: 1)
!245 = !DILocation(line: 174, column: 7, scope: !170)
!246 = !DILocation(line: 174, column: 20, scope: !170)
!247 = !DILocalVariable(name: "palette", scope: !170, file: !2, line: 176, type: !248, align: 16)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2048, align: 32, elements: !253)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 423, baseType: !250, align: 4)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, flags: DIFlagVector, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4, lowerBound: 0)
!253 = !{!254}
!254 = !DISubrange(count: 64, lowerBound: 0)
!255 = !DILocation(line: 176, column: 12, scope: !170)
!256 = !DILocalVariable(name: "prev", scope: !170, file: !2, line: 177, type: !249, align: 4)
!257 = !DILocation(line: 177, column: 8, scope: !170)
!258 = !DILocation(line: 177, column: 26, scope: !170)
!259 = !DILocalVariable(name: "p", scope: !170, file: !2, line: 178, type: !249, align: 4)
!260 = !DILocation(line: 178, column: 8, scope: !170)
!261 = !DILocation(line: 178, column: 23, scope: !170)
!262 = !DILocalVariable(name: "diff", scope: !170, file: !2, line: 180, type: !263, align: 4)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 32, align: 8, flags: DIFlagVector, elements: !265)
!264 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!265 = !{!266}
!266 = !DISubrange(count: 3, lowerBound: 0)
!267 = !DILocation(line: 180, column: 13, scope: !170)
!268 = !DILocalVariable(name: "luma", scope: !170, file: !2, line: 181, type: !263, align: 4)
!269 = !DILocation(line: 181, column: 13, scope: !170)
!270 = !DILocation(line: 184, column: 13, scope: !271)
!271 = distinct !DILexicalBlock(scope: !170, file: !2, line: 184, column: 2)
!272 = !DILocation(line: 184, column: 16, scope: !271)
!273 = !DILocation(line: 184, column: 22, scope: !271)
!274 = !DILocation(line: 187, column: 10, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !2, line: 185, column: 2)
!276 = !DILocation(line: 190, column: 11, scope: !275)
!277 = !DILocation(line: 190, column: 17, scope: !275)
!278 = !DILocation(line: 190, column: 3, scope: !275)
!279 = !DILocation(line: 191, column: 7, scope: !275)
!280 = !DILocation(line: 191, column: 30, scope: !275)
!281 = !DILocation(line: 191, column: 36, scope: !275)
!282 = !DILocation(line: 191, column: 42, scope: !275)
!283 = !DILocation(line: 194, column: 7, scope: !275)
!284 = !DILocation(line: 194, column: 15, scope: !275)
!285 = !DILocation(line: 195, column: 4, scope: !286)
!286 = distinct !DILexicalBlock(scope: !275, file: !2, line: 194, column: 18)
!287 = !DILocation(line: 196, column: 8, scope: !286)
!288 = !DILocation(line: 196, column: 28, scope: !286)
!289 = !DILocation(line: 196, column: 35, scope: !286)
!290 = !DILocalVariable(name: "chunk", scope: !291, file: !2, line: 473, type: !292, align: 8)
!291 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!293 = !DILocation(line: 473, column: 9, scope: !291, inlinedAt: !294)
!294 = !DILocation(line: 197, column: 6, scope: !295)
!295 = distinct !DILexicalBlock(scope: !286, file: !2, line: 196, column: 44)
!296 = !DILocation(line: 473, column: 25, scope: !291, inlinedAt: !294)
!297 = !DILocation(line: 473, column: 31, scope: !291, inlinedAt: !294)
!298 = !DILocation(line: 474, column: 3, scope: !291, inlinedAt: !294)
!299 = !DILocation(line: 474, column: 2, scope: !291, inlinedAt: !294)
!300 = !DILocation(line: 475, column: 9, scope: !291, inlinedAt: !294)
!301 = !DILocation(line: 197, column: 48, scope: !295)
!302 = !DILocation(line: 198, column: 18, scope: !295)
!303 = !DILocation(line: 202, column: 8, scope: !304)
!304 = distinct !DILexicalBlock(scope: !275, file: !2, line: 200, column: 10)
!305 = !DILocalVariable(name: "chunk", scope: !306, file: !2, line: 473, type: !292, align: 8)
!306 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!307 = !DILocation(line: 473, column: 9, scope: !306, inlinedAt: !308)
!308 = !DILocation(line: 203, column: 6, scope: !309)
!309 = distinct !DILexicalBlock(scope: !304, file: !2, line: 202, column: 24)
!310 = !DILocation(line: 473, column: 25, scope: !306, inlinedAt: !308)
!311 = !DILocation(line: 473, column: 31, scope: !306, inlinedAt: !308)
!312 = !DILocation(line: 474, column: 3, scope: !306, inlinedAt: !308)
!313 = !DILocation(line: 474, column: 2, scope: !306, inlinedAt: !308)
!314 = !DILocation(line: 475, column: 9, scope: !306, inlinedAt: !308)
!315 = !DILocation(line: 203, column: 48, scope: !309)
!316 = !DILocation(line: 204, column: 18, scope: !309)
!317 = !DILocation(line: 425, column: 10, scope: !318, inlinedAt: !319)
!318 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!319 = !DILocation(line: 209, column: 19, scope: !320)
!320 = distinct !DILexicalBlock(scope: !304, file: !2, line: 207, column: 4)
!321 = !DILocation(line: 425, column: 20, scope: !318, inlinedAt: !319)
!322 = !DILocation(line: 425, column: 30, scope: !318, inlinedAt: !319)
!323 = !DILocation(line: 425, column: 40, scope: !318, inlinedAt: !319)
!324 = !DILocation(line: 209, column: 32, scope: !320)
!325 = !DILocation(line: 209, column: 11, scope: !320)
!326 = !DILocalVariable(name: "chunk", scope: !327, file: !2, line: 473, type: !328, align: 8)
!327 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DILocation(line: 473, column: 9, scope: !327, inlinedAt: !330)
!330 = !DILocation(line: 210, column: 7, scope: !331)
!331 = distinct !DILexicalBlock(scope: !320, file: !2, line: 210, column: 6)
!332 = !DILocation(line: 473, column: 25, scope: !327, inlinedAt: !330)
!333 = !DILocation(line: 473, column: 31, scope: !327, inlinedAt: !330)
!334 = !DILocation(line: 474, column: 3, scope: !327, inlinedAt: !330)
!335 = !DILocation(line: 474, column: 2, scope: !327, inlinedAt: !330)
!336 = !DILocation(line: 475, column: 9, scope: !327, inlinedAt: !330)
!337 = !DILocation(line: 425, column: 10, scope: !338, inlinedAt: !339)
!338 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!339 = !DILocation(line: 212, column: 7, scope: !331)
!340 = !DILocation(line: 425, column: 20, scope: !338, inlinedAt: !339)
!341 = !DILocation(line: 425, column: 30, scope: !338, inlinedAt: !339)
!342 = !DILocation(line: 425, column: 40, scope: !338, inlinedAt: !339)
!343 = !DILocation(line: 216, column: 11, scope: !320)
!344 = !DILocation(line: 216, column: 19, scope: !320)
!345 = !DILocation(line: 216, column: 24, scope: !320)
!346 = !DILocation(line: 216, column: 34, scope: !320)
!347 = !DILocation(line: 218, column: 13, scope: !348)
!348 = distinct !DILexicalBlock(scope: !320, file: !2, line: 218, column: 6)
!349 = !DILocation(line: 218, column: 21, scope: !348)
!350 = !DILocation(line: 220, column: 7, scope: !348)
!351 = !DILocation(line: 220, column: 22, scope: !348)
!352 = !DILocation(line: 221, column: 7, scope: !348)
!353 = !DILocation(line: 221, column: 22, scope: !348)
!354 = !DILocation(line: 222, column: 7, scope: !348)
!355 = !DILocation(line: 222, column: 22, scope: !348)
!356 = !DILocalVariable(name: "chunk", scope: !357, file: !2, line: 473, type: !358, align: 8)
!357 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DILocation(line: 473, column: 9, scope: !357, inlinedAt: !360)
!360 = !DILocation(line: 224, column: 8, scope: !361)
!361 = distinct !DILexicalBlock(scope: !348, file: !2, line: 223, column: 8)
!362 = !DILocation(line: 473, column: 25, scope: !357, inlinedAt: !360)
!363 = !DILocation(line: 473, column: 31, scope: !357, inlinedAt: !360)
!364 = !DILocation(line: 474, column: 3, scope: !357, inlinedAt: !360)
!365 = !DILocation(line: 474, column: 2, scope: !357, inlinedAt: !360)
!366 = !DILocation(line: 475, column: 9, scope: !357, inlinedAt: !360)
!367 = !DILocation(line: 226, column: 14, scope: !361)
!368 = !DILocation(line: 226, column: 9, scope: !361)
!369 = !DILocation(line: 227, column: 14, scope: !361)
!370 = !DILocation(line: 227, column: 9, scope: !361)
!371 = !DILocation(line: 228, column: 14, scope: !361)
!372 = !DILocation(line: 228, column: 9, scope: !361)
!373 = !DILocation(line: 425, column: 10, scope: !374, inlinedAt: !375)
!374 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!375 = !DILocation(line: 230, column: 15, scope: !361)
!376 = !DILocation(line: 425, column: 20, scope: !374, inlinedAt: !375)
!377 = !DILocation(line: 425, column: 30, scope: !374, inlinedAt: !375)
!378 = !DILocation(line: 425, column: 40, scope: !374, inlinedAt: !375)
!379 = !DILocation(line: 230, column: 27, scope: !361)
!380 = !DILocation(line: 233, column: 16, scope: !381)
!381 = distinct !DILexicalBlock(scope: !348, file: !2, line: 231, column: 13)
!382 = !DILocation(line: 233, column: 25, scope: !381)
!383 = !DILocation(line: 233, column: 33, scope: !381)
!384 = !DILocation(line: 233, column: 41, scope: !381)
!385 = !DILocation(line: 233, column: 50, scope: !381)
!386 = !DILocation(line: 235, column: 8, scope: !381)
!387 = !DILocation(line: 235, column: 24, scope: !381)
!388 = !DILocation(line: 236, column: 8, scope: !381)
!389 = !DILocation(line: 236, column: 25, scope: !381)
!390 = !DILocation(line: 237, column: 8, scope: !381)
!391 = !DILocation(line: 237, column: 24, scope: !381)
!392 = !DILocalVariable(name: "chunk", scope: !393, file: !2, line: 473, type: !394, align: 8)
!393 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!396 = !DILocation(line: 473, column: 9, scope: !393, inlinedAt: !397)
!397 = !DILocation(line: 239, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !381, file: !2, line: 238, column: 9)
!399 = !DILocation(line: 473, column: 25, scope: !393, inlinedAt: !397)
!400 = !DILocation(line: 473, column: 31, scope: !393, inlinedAt: !397)
!401 = !DILocation(line: 474, column: 3, scope: !393, inlinedAt: !397)
!402 = !DILocation(line: 474, column: 2, scope: !393, inlinedAt: !397)
!403 = !DILocation(line: 475, column: 9, scope: !393, inlinedAt: !397)
!404 = !DILocation(line: 241, column: 15, scope: !398)
!405 = !DILocation(line: 241, column: 10, scope: !398)
!406 = !DILocation(line: 242, column: 15, scope: !398)
!407 = !DILocation(line: 242, column: 10, scope: !398)
!408 = !DILocation(line: 243, column: 15, scope: !398)
!409 = !DILocation(line: 243, column: 10, scope: !398)
!410 = !DILocation(line: 425, column: 10, scope: !411, inlinedAt: !412)
!411 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!412 = !DILocation(line: 245, column: 16, scope: !398)
!413 = !DILocation(line: 425, column: 20, scope: !411, inlinedAt: !412)
!414 = !DILocation(line: 425, column: 30, scope: !411, inlinedAt: !412)
!415 = !DILocation(line: 425, column: 40, scope: !411, inlinedAt: !412)
!416 = !DILocation(line: 245, column: 28, scope: !398)
!417 = !DILocation(line: 246, column: 16, scope: !418)
!418 = distinct !DILexicalBlock(scope: !381, file: !2, line: 246, column: 14)
!419 = !DILocation(line: 251, column: 10, scope: !420)
!420 = distinct !DILexicalBlock(scope: !320, file: !2, line: 251, column: 6)
!421 = !DILocation(line: 251, column: 20, scope: !420)
!422 = !DILocalVariable(name: "chunk", scope: !423, file: !2, line: 473, type: !424, align: 8)
!423 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !425, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 435, size: 40, align: 8, elements: !426, identifier: "std.compression.qoi.OpRGBA")
!426 = !{!427, !428, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !425, file: !2, line: 437, baseType: !6, size: 8, align: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !425, file: !2, line: 438, baseType: !6, size: 8, align: 8, offset: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !425, file: !2, line: 439, baseType: !6, size: 8, align: 8, offset: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !425, file: !2, line: 440, baseType: !6, size: 8, align: 8, offset: 24)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !425, file: !2, line: 441, baseType: !6, size: 8, align: 8, offset: 32)
!432 = !DILocation(line: 473, column: 9, scope: !423, inlinedAt: !433)
!433 = !DILocation(line: 252, column: 8, scope: !434)
!434 = distinct !DILexicalBlock(scope: !420, file: !2, line: 251, column: 25)
!435 = !DILocation(line: 473, column: 25, scope: !423, inlinedAt: !433)
!436 = !DILocation(line: 473, column: 31, scope: !423, inlinedAt: !433)
!437 = !DILocation(line: 474, column: 3, scope: !423, inlinedAt: !433)
!438 = !DILocation(line: 474, column: 2, scope: !423, inlinedAt: !433)
!439 = !DILocation(line: 475, column: 9, scope: !423, inlinedAt: !433)
!440 = !DILocation(line: 252, column: 43, scope: !434)
!441 = !DILocation(line: 252, column: 52, scope: !434)
!442 = !DILocation(line: 252, column: 57, scope: !434)
!443 = !DILocation(line: 252, column: 62, scope: !434)
!444 = !DILocation(line: 252, column: 67, scope: !434)
!445 = !DILocalVariable(name: "chunk", scope: !446, file: !2, line: 473, type: !447, align: 8)
!446 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !448, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 428, size: 32, align: 8, elements: !449, identifier: "std.compression.qoi.OpRGB")
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !448, file: !2, line: 430, baseType: !6, size: 8, align: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !448, file: !2, line: 431, baseType: !6, size: 8, align: 8, offset: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !448, file: !2, line: 432, baseType: !6, size: 8, align: 8, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !448, file: !2, line: 433, baseType: !6, size: 8, align: 8, offset: 24)
!454 = !DILocation(line: 473, column: 9, scope: !446, inlinedAt: !455)
!455 = !DILocation(line: 254, column: 8, scope: !456)
!456 = distinct !DILexicalBlock(scope: !420, file: !2, line: 253, column: 13)
!457 = !DILocation(line: 473, column: 25, scope: !446, inlinedAt: !455)
!458 = !DILocation(line: 473, column: 31, scope: !446, inlinedAt: !455)
!459 = !DILocation(line: 474, column: 3, scope: !446, inlinedAt: !455)
!460 = !DILocation(line: 474, column: 2, scope: !446, inlinedAt: !455)
!461 = !DILocation(line: 475, column: 9, scope: !446, inlinedAt: !455)
!462 = !DILocation(line: 254, column: 42, scope: !456)
!463 = !DILocation(line: 254, column: 50, scope: !456)
!464 = !DILocation(line: 254, column: 55, scope: !456)
!465 = !DILocation(line: 254, column: 60, scope: !456)
!466 = !DILocation(line: 425, column: 10, scope: !467, inlinedAt: !468)
!467 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!468 = !DILocation(line: 256, column: 14, scope: !420)
!469 = !DILocation(line: 425, column: 20, scope: !467, inlinedAt: !468)
!470 = !DILocation(line: 425, column: 30, scope: !467, inlinedAt: !468)
!471 = !DILocation(line: 425, column: 40, scope: !467, inlinedAt: !468)
!472 = !DILocation(line: 256, column: 26, scope: !420)
!473 = !DILocation(line: 184, column: 34, scope: !271)
!474 = !DILocation(line: 184, column: 41, scope: !271)
!475 = !DILocation(line: 262, column: 34, scope: !170)
!476 = !DILocation(line: 262, column: 2, scope: !170)
!477 = !DILocation(line: 262, column: 9, scope: !170)
!478 = !DILocation(line: 263, column: 2, scope: !170)
!479 = !DILocation(line: 265, column: 9, scope: !170)
!480 = !DILocation(line: 265, column: 16, scope: !170)
!481 = !DILocation(line: 265, column: 17, scope: !170)
!482 = !DILocation(line: 163, column: 4, scope: !170)
!483 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 290, type: !484, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !58)
!484 = !DISubroutineType(types: !485)
!485 = !{!46, !148, !52, !57, !27, !73}
!486 = !DILocation(line: 291, column: 1, scope: !483)
!487 = !DILocalVariable(name: "data", arg: 1, scope: !483, file: !2, line: 290, type: !52)
!488 = !DILocation(line: 290, column: 26, scope: !483)
!489 = !DILocalVariable(name: "desc", arg: 2, scope: !483, file: !2, line: 290, type: !57)
!490 = !DILocation(line: 290, column: 41, scope: !483)
!491 = !DILocalVariable(name: "channels", arg: 3, scope: !483, file: !2, line: 290, type: !27)
!492 = !DILocation(line: 290, column: 59, scope: !483)
!493 = !DILocalVariable(name: "allocator", arg: 4, scope: !483, file: !2, line: 290, type: !73)
!494 = !DILocation(line: 290, column: 86, scope: !483)
!495 = !DILocation(line: 293, column: 6, scope: !483)
!496 = !DILocation(line: 293, column: 59, scope: !483)
!497 = !DILocalVariable(name: "header", scope: !483, file: !2, line: 296, type: !498, align: 8)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !499, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 401, size: 112, align: 8, elements: !500, identifier: "std.compression.qoi.Header")
!500 = !{!501, !502, !503, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !499, file: !2, line: 403, baseType: !3, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !499, file: !2, line: 404, baseType: !3, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !499, file: !2, line: 405, baseType: !3, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !499, file: !2, line: 408, baseType: !6, size: 8, align: 8, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !499, file: !2, line: 409, baseType: !6, size: 8, align: 8, offset: 104)
!506 = !DILocation(line: 296, column: 10, scope: !483)
!507 = !DILocation(line: 296, column: 28, scope: !483)
!508 = !DILocation(line: 299, column: 12, scope: !483)
!509 = !DILocation(line: 11, column: 36, scope: !510, inlinedAt: !511)
!510 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!511 = !DILocation(line: 299, column: 6, scope: !483)
!512 = !DILocation(line: 299, column: 47, scope: !483)
!513 = !DILocation(line: 302, column: 2, scope: !483)
!514 = !DILocation(line: 302, column: 21, scope: !483)
!515 = !DILocation(line: 11, column: 36, scope: !516, inlinedAt: !517)
!516 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!517 = !DILocation(line: 302, column: 15, scope: !483)
!518 = !DILocation(line: 303, column: 2, scope: !483)
!519 = !DILocation(line: 303, column: 22, scope: !483)
!520 = !DILocation(line: 11, column: 36, scope: !521, inlinedAt: !522)
!521 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!522 = !DILocation(line: 303, column: 16, scope: !483)
!523 = !DILocation(line: 304, column: 2, scope: !483)
!524 = !DILocation(line: 304, column: 41, scope: !483)
!525 = !DILocalVariable(name: ".temp", scope: !526, file: !2, line: 417, type: !528, align: 1)
!526 = distinct !DILexicalBlock(scope: !527, file: !2, line: 417, column: 2)
!527 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, align: 8, elements: !265)
!529 = !DILocation(line: 417, column: 19, scope: !526, inlinedAt: !530)
!530 = !DILocation(line: 304, column: 18, scope: !483)
!531 = !DILocalVariable(name: ".temp", scope: !526, file: !2, line: 417, type: !49, align: 8)
!532 = !DILocalVariable(name: "value", scope: !533, file: !2, line: 417, type: !27, align: 1)
!533 = distinct !DILexicalBlock(scope: !526, file: !2, line: 417, column: 33)
!534 = !DILocation(line: 417, column: 11, scope: !533, inlinedAt: !530)
!535 = !DILocation(line: 417, column: 19, scope: !533, inlinedAt: !530)
!536 = !DILocation(line: 418, column: 7, scope: !537, inlinedAt: !530)
!537 = distinct !DILexicalBlock(scope: !533, file: !2, line: 417, column: 33)
!538 = !DILocation(line: 418, column: 19, scope: !537, inlinedAt: !530)
!539 = !DILocation(line: 418, column: 31, scope: !537, inlinedAt: !530)
!540 = !DILocation(line: 420, column: 9, scope: !527, inlinedAt: !530)
!541 = !DILocation(line: 305, column: 2, scope: !483)
!542 = !DILocation(line: 305, column: 45, scope: !483)
!543 = !DILocalVariable(name: ".temp", scope: !544, file: !2, line: 417, type: !546, align: 1)
!544 = distinct !DILexicalBlock(scope: !545, file: !2, line: 417, column: 2)
!545 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !58)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 16, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 2, lowerBound: 0)
!549 = !DILocation(line: 417, column: 19, scope: !544, inlinedAt: !550)
!550 = !DILocation(line: 305, column: 20, scope: !483)
!551 = !DILocalVariable(name: ".temp", scope: !544, file: !2, line: 417, type: !49, align: 8)
!552 = !DILocalVariable(name: "value", scope: !553, file: !2, line: 417, type: !34, align: 1)
!553 = distinct !DILexicalBlock(scope: !544, file: !2, line: 417, column: 33)
