; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$std.hash.md5.Md5.init = comdat any

$std.hash.md5.Md5.update = comdat any

$std.hash.md5.Md5.final = comdat any

$std.hash.md5.hash = comdat any

$"$ct.std.hash.md5.Md5" = comdat any

$std.hash.md5.BLOCK_BYTES = comdat any

$std.hash.md5.HASH_BYTES = comdat any

$"$ct.ulong" = comdat any

$"$ct.long" = comdat any

$"$ct.uint" = comdat any

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, comdat, align 8
@std.hash.md5.BLOCK_BYTES = weak local_unnamed_addr constant i32 64, comdat, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak local_unnamed_addr constant i32 16, comdat, align 4, !dbg !4
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"md5.c3\00", align 1
@.func = internal constant [5 x i8] c"init\00", align 1
@std.core.builtin.panic = external global ptr, align 8
@.panic_msg.2 = internal constant [46 x i8] c"Dereference of null pointer, 'self' was null.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "md5.c3", directory: "C:/Dev/C3/c3-windows/lib/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 4, !"PIC Level", i32 2}
!7 = !{i32 1, !"CodeView", i32 1}
!8 = !{i32 1, !"uwtable", i32 2}
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !10, splitDebugInlining: false)
!10 = !{!0, !4}
!11 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !12, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !33)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Md5*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !16, identifier: "std.hash.md5.Md5")
!16 = !{!17, !19, !20, !21, !22, !23, !24, !29}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !15, file: !2, line: 10, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !15, file: !2, line: 10, baseType: !18, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !15, file: !2, line: 11, baseType: !18, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !15, file: !2, line: 11, baseType: !18, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !15, file: !2, line: 11, baseType: !18, size: 32, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !15, file: !2, line: 11, baseType: !18, size: 32, align: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !15, file: !2, line: 12, baseType: !25, size: 512, align: 8, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 8, elements: !27)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{!28}
!28 = !DISubrange(count: 64, lowerBound: 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !15, file: !2, line: 13, baseType: !30, size: 512, align: 32, offset: 704)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, align: 32, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 16, lowerBound: 0)
!33 = !{}
!34 = !DILocation(line: 29, column: 1, scope: !11)
!35 = !DILocalVariable(name: "self", arg: 1, scope: !11, file: !2, line: 28, type: !14)
!36 = !DILocation(line: 28, column: 18, scope: !11)
!37 = !DILocation(line: 30, column: 2, scope: !11)
!38 = !DILocation(line: 30, column: 11, scope: !11)
!39 = !DILocation(line: 31, column: 2, scope: !11)
!40 = !DILocation(line: 31, column: 11, scope: !11)
!41 = !DILocation(line: 32, column: 2, scope: !11)
!42 = !DILocation(line: 32, column: 11, scope: !11)
!43 = !DILocation(line: 33, column: 2, scope: !11)
!44 = !DILocation(line: 33, column: 11, scope: !11)
!45 = !DILocation(line: 35, column: 2, scope: !11)
!46 = !DILocation(line: 35, column: 12, scope: !11)
!47 = !DILocation(line: 36, column: 2, scope: !11)
!48 = !DILocation(line: 36, column: 12, scope: !11)
!49 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !50, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !33)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !14, !52}
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !53, identifier: "char[]")
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !52, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !58)
!58 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!59 = !DILocation(line: 41, column: 1, scope: !49)
!60 = !DILocalVariable(name: "ctx", arg: 1, scope: !49, file: !2, line: 40, type: !14)
!61 = !DILocation(line: 40, column: 20, scope: !49)
!62 = !DILocalVariable(name: "data", arg: 2, scope: !49, file: !2, line: 40, type: !52)
!63 = !DILocation(line: 40, column: 33, scope: !49)
!64 = !DILocalVariable(name: "saved_lo", scope: !49, file: !2, line: 42, type: !18, align: 4)
!65 = !DILocation(line: 42, column: 7, scope: !49)
!66 = !DILocation(line: 42, column: 18, scope: !49)
!67 = !DILocation(line: 43, column: 7, scope: !49)
!68 = !DILocation(line: 43, column: 17, scope: !49)
!69 = !DILocation(line: 43, column: 28, scope: !49)
!70 = !DILocation(line: 43, column: 54, scope: !49)
!71 = !DILocation(line: 43, column: 64, scope: !49)
!72 = !DILocation(line: 44, column: 2, scope: !49)
!73 = !DILocation(line: 44, column: 12, scope: !49)
!74 = !DILocalVariable(name: "used", scope: !49, file: !2, line: 46, type: !57, align: 8)
!75 = !DILocation(line: 46, column: 6, scope: !49)
!76 = !DILocation(line: 46, column: 14, scope: !49)
!77 = !DILocation(line: 48, column: 6, scope: !49)
!78 = !DILocalVariable(name: "available", scope: !79, file: !2, line: 50, type: !57, align: 8)
!79 = distinct !DILexicalBlock(scope: !49, file: !2, line: 49, column: 2)
!80 = !DILocation(line: 50, column: 7, scope: !79)
!81 = !DILocation(line: 50, column: 24, scope: !79)
!82 = !DILocation(line: 50, column: 19, scope: !79)
!83 = !DILocation(line: 52, column: 7, scope: !79)
!84 = !DILocation(line: 52, column: 18, scope: !79)
!85 = !DILocation(line: 54, column: 32, scope: !86)
!86 = distinct !DILexicalBlock(scope: !79, file: !2, line: 53, column: 3)
!87 = !DILocation(line: 54, column: 37, scope: !86)
!88 = !DILocation(line: 54, column: 4, scope: !86)
!89 = !DILocation(line: 54, column: 15, scope: !86)
!90 = !DILocation(line: 54, column: 20, scope: !86)
!91 = !DILocation(line: 55, column: 10, scope: !86)
!92 = !DILocation(line: 57, column: 32, scope: !79)
!93 = !DILocation(line: 57, column: 37, scope: !79)
!94 = !DILocation(line: 57, column: 38, scope: !79)
!95 = !DILocation(line: 57, column: 3, scope: !79)
!96 = !DILocation(line: 57, column: 14, scope: !79)
!97 = !DILocation(line: 57, column: 19, scope: !79)
!98 = !DILocation(line: 58, column: 10, scope: !79)
!99 = !DILocation(line: 58, column: 15, scope: !79)
!100 = !DILocation(line: 59, column: 14, scope: !79)
!101 = !DILocation(line: 59, column: 26, scope: !79)
!102 = !DILocation(line: 59, column: 3, scope: !79)
!103 = !DILocation(line: 62, column: 6, scope: !49)
!104 = !DILocation(line: 64, column: 26, scope: !105)
!105 = distinct !DILexicalBlock(scope: !49, file: !2, line: 63, column: 2)
!106 = !DILocation(line: 64, column: 10, scope: !105)
!107 = !DILocation(line: 64, column: 50, scope: !105)
!108 = !DILocation(line: 66, column: 26, scope: !49)
!109 = !DILocation(line: 66, column: 31, scope: !49)
!110 = !DILocation(line: 66, column: 2, scope: !49)
!111 = !DILocation(line: 66, column: 14, scope: !49)
!112 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !113, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !33)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !14}
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, align: 8, elements: !31)
!116 = !DILocation(line: 70, column: 1, scope: !112)
!117 = !DILocalVariable(name: "ctx", arg: 1, scope: !112, file: !2, line: 69, type: !14)
!118 = !DILocation(line: 69, column: 31, scope: !112)
!119 = !DILocalVariable(name: "used", scope: !112, file: !2, line: 71, type: !57, align: 8)
!120 = !DILocation(line: 71, column: 6, scope: !112)
