; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.temp_parse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.temp_parse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"std.encoding.json.JsonParsingError$EOF" = comdat any

$"std.encoding.json.JsonParsingError$UNEXPECTED_CHARACTER" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_ESCAPE_SEQUENCE" = comdat any

$"std.encoding.json.JsonParsingError$DUPLICATE_MEMBERS" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_NUMBER" = comdat any

$"$ct.std.encoding.json.JsonParsingError" = comdat any

$"$ct.std.encoding.json.JsonContext" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType" = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "json.c3", directory: "C:/Dev/C3/c3-windows/lib/std/encoding")
!5 = !{!6}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !7, file: !4, line: 47, baseType: !31, size: 32, align: 32, elements: !32)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !4, file: !4, line: 64, size: 576, align: 64, elements: !8, identifier: "std.encoding.json.JsonContext")
!8 = !{!9, !11, !18, !23, !24, !26, !28, !30}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !7, file: !4, line: 66, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !7, file: !4, line: 67, baseType: !12, size: 128, align: 64, offset: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !13, identifier: "InStream")
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !12, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !7, file: !4, line: 68, baseType: !19, size: 128, align: 64, offset: 192)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !20, identifier: "Allocator")
!20 = !{!21, !22}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !19, baseType: !15, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, baseType: !17, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !7, file: !4, line: 69, baseType: !6, size: 32, align: 32, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !7, file: !4, line: 70, baseType: !25, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !4, file: !4, line: 4, baseType: !15, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !7, file: !4, line: 71, baseType: !27, size: 64, align: 64, offset: 448)
!27 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !7, file: !4, line: 72, baseType: !29, size: 8, align: 8, offset: 512)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, scope: !7, file: !4, line: 73, baseType: !29, size: 8, align: 8, offset: 520)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!33 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!34 = !DIEnumerator(name: "LBRACE", value: 1)
!35 = !DIEnumerator(name: "LBRACKET", value: 2)
!36 = !DIEnumerator(name: "COMMA", value: 3)
!37 = !DIEnumerator(name: "COLON", value: 4)
!38 = !DIEnumerator(name: "RBRACE", value: 5)
!39 = !DIEnumerator(name: "RBRACKET", value: 6)
!40 = !DIEnumerator(name: "STRING", value: 7)
!41 = !DIEnumerator(name: "NUMBER", value: 8)
!42 = !DIEnumerator(name: "TRUE", value: 9)
!43 = !DIEnumerator(name: "FALSE", value: 10)
!44 = !DIEnumerator(name: "NULL", value: 11)
!45 = !DIEnumerator(name: "EOF", value: 12)
!46 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !4, file: !4, line: 18, type: !47, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !109)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !66, !19}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !50)
!50 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !4, file: !4, line: 11, size: 640, align: 128, elements: !54, identifier: "std.collections.object.Object")
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !4, line: 13, baseType: !17, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !53, file: !4, line: 14, baseType: !19, size: 128, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !4, line: 15, baseType: !58, size: 384, align: 128, offset: 256)
!58 = !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !4, line: 15, size: 384, align: 128, elements: !59)
!59 = !{!60, !62, !63, !65, !74, !75, !85}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !58, file: !4, line: 17, baseType: !61, size: 128, align: 128)
!61 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !58, file: !4, line: 18, baseType: !27, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !58, file: !4, line: 19, baseType: !64, size: 8, align: 8)
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !58, file: !4, line: 20, baseType: !66, size: 128, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !68, identifier: "char[]")
!68 = !{!69, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !67, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !73)
!73 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !58, file: !4, line: 21, baseType: !15, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !58, file: !4, line: 22, baseType: !76, size: 320, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !4, file: !4, line: 466, baseType: !77, align: 8)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !4, file: !4, line: 14, size: 320, align: 64, elements: !78, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!78 = !{!79, !80, !81, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !77, file: !4, line: 16, baseType: !72, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !77, file: !4, line: 17, baseType: !72, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !77, file: !4, line: 18, baseType: !19, size: 128, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !77, file: !4, line: 19, baseType: !83, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !84, size: 64, align: 64, dwarfAddressSpace: 0)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !4, file: !4, line: 466, baseType: !52, align: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !58, file: !4, line: 23, baseType: !86, size: 384, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !4, file: !4, line: 465, baseType: !87, align: 8)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !4, file: !4, line: 7, size: 384, align: 64, elements: !88, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!88 = !{!89, !104, !105, !106, !107}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !87, file: !4, line: 9, baseType: !90, size: 128, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !91, identifier: "Entry*[]")
!91 = !{!92, !103}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !90, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !4, file: !4, line: 499, size: 320, align: 64, elements: !96, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!96 = !{!97, !98, !100, !102}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !95, file: !4, line: 501, baseType: !10, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !95, file: !4, line: 502, baseType: !99, size: 128, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !4, file: !4, line: 465, baseType: !66, align: 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !4, line: 503, baseType: !101, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !4, file: !4, line: 465, baseType: !52, align: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !4, line: 504, baseType: !94, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, baseType: !72, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !87, file: !4, line: 10, baseType: !19, size: 128, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !87, file: !4, line: 11, baseType: !10, size: 32, align: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !87, file: !4, line: 12, baseType: !10, size: 32, align: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !87, file: !4, line: 13, baseType: !108, size: 32, align: 32, offset: 320)
!108 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!109 = !{}
!110 = !DILocalVariable(name: "s", arg: 1, scope: !46, file: !4, line: 18, type: !66)
!111 = !DILocation(line: 18, column: 33, scope: !46)
!112 = !DILocalVariable(name: "allocator", arg: 2, scope: !46, file: !4, line: 18, type: !19)
!113 = !DILocation(line: 18, column: 46, scope: !46)
!114 = !DILocation(line: 20, column: 15, scope: !46)
!115 = !DILocation(line: 20, column: 9, scope: !46)
!116 = distinct !DISubprogram(name: "temp_parse_string", linkageName: "std.encoding.json.temp_parse_string", scope: !4, file: !4, line: 23, type: !117, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !109)
!117 = !DISubroutineType(types: !118)
!118 = !{!49, !51, !66}
!119 = !DILocalVariable(name: "s", arg: 1, scope: !116, file: !4, line: 23, type: !66)
!120 = !DILocation(line: 23, column: 38, scope: !116)
!121 = !DILocation(line: 25, column: 15, scope: !116)
!122 = !DILocation(line: 396, column: 7, scope: !123, inlinedAt: !125)
!123 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !124, file: !124, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!124 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!125 = !DILocation(line: 25, column: 48, scope: !116)
!126 = !DILocation(line: 398, column: 3, scope: !127, inlinedAt: !125)
!127 = distinct !DILexicalBlock(scope: !123, file: !124, line: 397, column: 2)
!128 = !DILocation(line: 400, column: 9, scope: !123, inlinedAt: !125)
!129 = !DILocation(line: 25, column: 9, scope: !116)
!130 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !4, file: !4, line: 28, type: !131, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !109)
!131 = !DISubroutineType(types: !132)
!132 = !{!49, !51, !12, !19}
!133 = !DILocalVariable(name: "s", arg: 1, scope: !130, file: !4, line: 28, type: !12)
!134 = !DILocation(line: 28, column: 28, scope: !130)
!135 = !DILocalVariable(name: "allocator", arg: 2, scope: !130, file: !4, line: 28, type: !19)
!136 = !DILocation(line: 28, column: 41, scope: !130)
!137 = !DILocalVariable(name: "buffer", scope: !138, file: !4, line: 484, type: !140, align: 16)
!138 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !139, file: !139, line: 482, scopeLine: 482, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !109)
!139 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 4096, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 512, lowerBound: 0)
!143 = !DILocation(line: 484, column: 14, scope: !138, inlinedAt: !144)
!144 = !DILocation(line: 30, column: 2, scope: !130)
!145 = !DILocalVariable(name: "allocator", scope: !138, file: !4, line: 485, type: !146, align: 8)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !4, file: !4, line: 3, size: 384, align: 64, elements: !147, identifier: "std.core.mem.allocator.OnStackAllocator")
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !146, file: !4, line: 5, baseType: !19, size: 128, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !4, line: 6, baseType: !67, size: 128, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !146, file: !4, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !146, file: !4, line: 8, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !4, file: !4, line: 12, size: 192, align: 64, elements: !154, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !153, file: !4, line: 14, baseType: !64, size: 8, align: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !4, line: 15, baseType: !152, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !4, line: 16, baseType: !15, size: 64, align: 64, offset: 128)
!158 = !DILocation(line: 485, column: 19, scope: !138, inlinedAt: !144)
!159 = !DILocation(line: 486, column: 18, scope: !138, inlinedAt: !144)
!160 = !DILocation(line: 486, column: 2, scope: !138, inlinedAt: !144)
!161 = !DILocalVariable(name: "mem", scope: !130, file: !4, line: 30, type: !19, align: 8)
!162 = !DILocation(line: 30, column: 28, scope: !130)
!163 = !DILocation(line: 488, column: 9, scope: !164, inlinedAt: !144)
!164 = distinct !DILexicalBlock(scope: !138, file: !139, line: 488, column: 2)
!165 = !DILocalVariable(name: "context", scope: !166, file: !4, line: 32, type: !7, align: 8)
!166 = distinct !DILexicalBlock(scope: !130, file: !4, line: 31, column: 2)
!167 = !DILocation(line: 32, column: 15, scope: !166)
!168 = !DILocation(line: 32, column: 51, scope: !166)
!169 = !DILocation(line: 32, column: 89, scope: !166)
!170 = !DILocation(line: 32, column: 105, scope: !166)
!171 = !DILocalVariable(name: "current", scope: !172, file: !4, line: 536, type: !173, align: 8)
!172 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !139, file: !139, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !109)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !4, file: !4, line: 10, size: 320, align: 64, elements: !175, identifier: "std.core.mem.allocator.TempAllocator")
!175 = !{!176, !177, !190, !191, !192}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !174, file: !4, line: 12, baseType: !19, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !174, file: !4, line: 13, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !4, file: !4, line: 22, size: 320, align: 64, elements: !180, identifier: "std.core.mem.allocator.TempAllocatorPage")
!180 = !{!181, !182, !183, !184, !185, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !179, file: !4, line: 24, baseType: !178, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !179, file: !4, line: 25, baseType: !15, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !179, file: !4, line: 26, baseType: !72, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !179, file: !4, line: 27, baseType: !72, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !179, file: !4, line: 28, baseType: !72, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !4, line: 29, baseType: !187, align: 8, offset: 320)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 0, lowerBound: 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !174, file: !4, line: 14, baseType: !72, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !174, file: !4, line: 15, baseType: !72, size: 64, align: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !4, line: 16, baseType: !187, align: 8, offset: 320)
!193 = !DILocation(line: 536, column: 17, scope: !172, inlinedAt: !194)
!194 = !DILocation(line: 33, column: 3, scope: !166)
!195 = !DILocation(line: 396, column: 7, scope: !196, inlinedAt: !197)
!196 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !124, file: !124, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!197 = !DILocation(line: 536, column: 38, scope: !172, inlinedAt: !194)
!198 = !DILocation(line: 398, column: 3, scope: !199, inlinedAt: !197)
!199 = distinct !DILexicalBlock(scope: !196, file: !124, line: 397, column: 2)
!200 = !DILocation(line: 400, column: 9, scope: !196, inlinedAt: !197)
!201 = !DILocalVariable(name: "original", scope: !172, file: !4, line: 539, type: !173, align: 8)
!202 = !DILocation(line: 539, column: 18, scope: !172, inlinedAt: !194)
!203 = !DILocation(line: 539, column: 29, scope: !172, inlinedAt: !194)
!204 = !DILocation(line: 540, column: 7, scope: !172, inlinedAt: !194)
!205 = !DILocation(line: 540, column: 19, scope: !172, inlinedAt: !194)
!206 = !DILocation(line: 540, column: 59, scope: !172, inlinedAt: !194)
!207 = !DILocalVariable(name: "mark", scope: !172, file: !4, line: 542, type: !72, align: 8)
!208 = !DILocation(line: 542, column: 6, scope: !172, inlinedAt: !194)
!209 = !DILocation(line: 542, column: 13, scope: !172, inlinedAt: !194)
!210 = !DILocation(line: 35, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !166, file: !4, line: 34, column: 3)
!212 = !DILocation(line: 545, column: 17, scope: !213, inlinedAt: !194)
!213 = distinct !DILexicalBlock(scope: !172, file: !139, line: 544, column: 2)
!214 = !DILocation(line: 545, column: 3, scope: !213, inlinedAt: !194)
!215 = !DILocation(line: 547, column: 39, scope: !213, inlinedAt: !194)
!216 = !DILocation(line: 487, column: 8, scope: !217, inlinedAt: !144)
!217 = distinct !DILexicalBlock(scope: !138, file: !139, line: 487, column: 8)
!218 = !DILocation(line: 545, column: 17, scope: !219, inlinedAt: !194)
!219 = distinct !DILexicalBlock(scope: !172, file: !139, line: 544, column: 2)
!220 = !DILocation(line: 545, column: 3, scope: !219, inlinedAt: !194)
!221 = !DILocation(line: 547, column: 39, scope: !219, inlinedAt: !194)
!222 = !DILocation(line: 487, column: 8, scope: !223, inlinedAt: !144)
!223 = distinct !DILexicalBlock(scope: !138, file: !139, line: 487, column: 8)
!224 = distinct !DISubprogram(name: "temp_parse", linkageName: "std.encoding.json.temp_parse", scope: !4, file: !4, line: 40, type: !225, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !109)
!225 = !DISubroutineType(types: !226)
!226 = !{!49, !51, !12}
!227 = !DILocalVariable(name: "s", arg: 1, scope: !224, file: !4, line: 40, type: !12)
!228 = !DILocation(line: 40, column: 33, scope: !224)
!229 = !DILocation(line: 396, column: 7, scope: !230, inlinedAt: !231)
!230 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !124, file: !124, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!231 = !DILocation(line: 42, column: 29, scope: !224)
!232 = !DILocation(line: 398, column: 3, scope: !233, inlinedAt: !231)
!233 = distinct !DILexicalBlock(scope: !230, file: !124, line: 397, column: 2)
!234 = !DILocation(line: 400, column: 9, scope: !230, inlinedAt: !231)
!235 = !DILocation(line: 42, column: 9, scope: !224)
!236 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !4, file: !4, line: 81, type: !237, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !109)
!237 = !DISubroutineType(types: !238)
!238 = !{!49, !51, !239, !6}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
