; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }

$std.os.env.get_var = comdat any

$std.os.env.get_var_temp = comdat any

$std.os.env.set_var = comdat any

$std.os.env.get_home_dir = comdat any

$std.os.env.get_config_dir = comdat any

$std.os.env.new_get_config_dir = comdat any

$std.os.env.clear_var = comdat any

$std.os.env.executable_path = comdat any

$std.os.env.new_executable_path = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.anyfault" = comdat any

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = external global ptr, align 8
@std.core.mem.allocator.thread_temp_allocator = external thread_local global ptr, align 8
@.panic_msg.1 = internal constant [49 x i8] c"Dereference of null pointer, 'current' was null.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BUFSIZE", linkageName: "get_var.BUFSIZE", scope: !2, file: !2, line: 22, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "C:/Dev/C3/c3-windows/lib/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !4)
!4 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!5 = !{i32 4, !"PIC Level", i32 2}
!6 = !{i32 1, !"CodeView", i32 1}
!7 = !{i32 1, !"uwtable", i32 2}
!8 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, globals: !26, splitDebugInlining: false)
!9 = !{!10}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !11, file: !2, line: 26, baseType: !22, size: 32, align: 32, elements: !23)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !12, identifier: "std.io.path.PathImp")
!12 = !{!13, !21}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !11, file: !2, line: 22, baseType: !14, size: 128, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !3, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !11, file: !2, line: 23, baseType: !10, size: 32, align: 32, offset: 128)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !{!24, !25}
!24 = !DIEnumerator(name: "WIN32", value: 0)
!25 = !DIEnumerator(name: "POSIX", value: 1)
!26 = !{!0}
!27 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !28, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !39)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !32, !14, !33}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !31)
!31 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !34, identifier: "Allocator")
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !33, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!39 = !{}
!40 = !DILocalVariable(name: "name", arg: 1, scope: !27, file: !2, line: 12, type: !14)
!41 = !DILocation(line: 12, column: 27, scope: !27)
!42 = !DILocalVariable(name: "allocator", arg: 2, scope: !27, file: !2, line: 12, type: !33)
!43 = !DILocation(line: 12, column: 43, scope: !27)
!44 = !DILocation(line: 9, column: 11, scope: !45)
!45 = distinct !DILexicalBlock(scope: !27, file: !2, line: 13, column: 1)
!46 = !DILocalVariable(name: "current", scope: !47, file: !2, line: 536, type: !49, align: 8)
!47 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !48, file: !48, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !8, retainedNodes: !39)
!48 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !51, identifier: "std.core.mem.allocator.TempAllocator")
!51 = !{!52, !53, !66, !67, !68}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !50, file: !2, line: 12, baseType: !33, size: 128, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !50, file: !2, line: 13, baseType: !54, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !56, identifier: "std.core.mem.allocator.TempAllocatorPage")
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !55, file: !2, line: 24, baseType: !54, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !55, file: !2, line: 25, baseType: !36, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !55, file: !2, line: 26, baseType: !3, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !2, line: 27, baseType: !3, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !55, file: !2, line: 28, baseType: !3, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !2, line: 29, baseType: !63, align: 8, offset: 320)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 0, lowerBound: 0)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !50, file: !2, line: 14, baseType: !3, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !50, file: !2, line: 15, baseType: !3, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !2, line: 16, baseType: !63, align: 8, offset: 320)
!69 = !DILocation(line: 536, column: 17, scope: !47, inlinedAt: !70)
!70 = !DILocation(line: 14, column: 2, scope: !27)
!71 = !DILocation(line: 396, column: 7, scope: !72, inlinedAt: !74)
!72 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !73, file: !73, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !8)
!73 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!74 = !DILocation(line: 536, column: 38, scope: !47, inlinedAt: !70)
!75 = !DILocation(line: 398, column: 3, scope: !76, inlinedAt: !74)
!76 = distinct !DILexicalBlock(scope: !72, file: !73, line: 397, column: 2)
!77 = !DILocation(line: 400, column: 9, scope: !72, inlinedAt: !74)
!78 = !DILocalVariable(name: "original", scope: !47, file: !2, line: 539, type: !49, align: 8)
!79 = !DILocation(line: 539, column: 18, scope: !47, inlinedAt: !70)
!80 = !DILocation(line: 539, column: 29, scope: !47, inlinedAt: !70)
!81 = !DILocation(line: 540, column: 7, scope: !47, inlinedAt: !70)
!82 = !DILocation(line: 540, column: 19, scope: !47, inlinedAt: !70)
!83 = !DILocation(line: 540, column: 59, scope: !47, inlinedAt: !70)
!84 = !DILocalVariable(name: "mark", scope: !47, file: !2, line: 542, type: !3, align: 8)
!85 = !DILocation(line: 542, column: 6, scope: !47, inlinedAt: !70)
!86 = !DILocation(line: 542, column: 13, scope: !47, inlinedAt: !70)
!87 = !DILocalVariable(name: "buff", scope: !88, file: !2, line: 23, type: !89, align: 8)
!88 = distinct !DILexicalBlock(scope: !27, file: !2, line: 15, column: 2)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 6, baseType: !90, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!92 = !DILocation(line: 23, column: 11, scope: !88)
!93 = !DILocation(line: 23, column: 19, scope: !88)
!94 = !DILocalVariable(name: "wstr", scope: !88, file: !2, line: 24, type: !89, align: 8)
!95 = !DILocation(line: 24, column: 11, scope: !88)
!96 = !DILocation(line: 24, column: 18, scope: !88)
!97 = !DILocation(line: 545, column: 17, scope: !98, inlinedAt: !70)
!98 = distinct !DILexicalBlock(scope: !47, file: !48, line: 544, column: 2)
!99 = !DILocation(line: 545, column: 3, scope: !98, inlinedAt: !70)
!100 = !DILocation(line: 547, column: 39, scope: !98, inlinedAt: !70)
!101 = !DILocation(line: 549, column: 2, scope: !98, inlinedAt: !70)
!102 = !DILocalVariable(name: "len", scope: !88, file: !2, line: 25, type: !3, align: 8)
!103 = !DILocation(line: 25, column: 7, scope: !88)
!104 = !DILocation(line: 25, column: 56, scope: !88)
!105 = !DILocation(line: 25, column: 20, scope: !88)
!106 = !DILocation(line: 26, column: 7, scope: !88)
!107 = !DILocation(line: 545, column: 17, scope: !108, inlinedAt: !70)
!108 = distinct !DILexicalBlock(scope: !47, file: !48, line: 544, column: 2)
!109 = !DILocation(line: 545, column: 3, scope: !108, inlinedAt: !70)
!110 = !DILocation(line: 547, column: 39, scope: !108, inlinedAt: !70)
!111 = !DILocation(line: 549, column: 2, scope: !108, inlinedAt: !70)
!112 = !DILocation(line: 27, column: 7, scope: !88)
!113 = !DILocation(line: 29, column: 28, scope: !114)
!114 = distinct !DILexicalBlock(scope: !88, file: !2, line: 28, column: 3)
!115 = !DILocation(line: 29, column: 12, scope: !114)
!116 = !DILocation(line: 30, column: 48, scope: !114)
!117 = !DILocation(line: 30, column: 11, scope: !114)
!118 = !DILocation(line: 32, column: 18, scope: !88)
!119 = !DILocation(line: 545, column: 17, scope: !120, inlinedAt: !70)
!120 = distinct !DILexicalBlock(scope: !47, file: !48, line: 544, column: 2)
!121 = !DILocation(line: 545, column: 3, scope: !120, inlinedAt: !70)
!122 = !DILocation(line: 547, column: 39, scope: !120, inlinedAt: !70)
