; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }

$std.os.backtrace.Backtrace.has_file = comdat any

$std.os.backtrace.Backtrace.is_unknown = comdat any

$std.os.backtrace.Backtrace.to_format = comdat any

$std.os.backtrace.Backtrace.free = comdat any

$std.os.backtrace.Backtrace.init = comdat any

$std.os.backtrace.capture_current = comdat any

$.dyn_search = comdat any

$"std.os.backtrace.BacktraceFault$SEGMENT_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$EXECUTABLE_PATH_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$IMAGE_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$NO_BACKTRACE_SYMBOLS" = comdat any

$"std.os.backtrace.BacktraceFault$RESOLUTION_FAILED" = comdat any

$"$ct.std.os.backtrace.BacktraceFault" = comdat any

$"$ct.std.os.backtrace.Backtrace" = comdat any

$"$ct.void" = comdat any

$std.os.backtrace.BACKTRACE_UNKNOWN = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "C:/Dev/C3/c3-windows/lib/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 17, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 18, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 19, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 20, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 21, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 22, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 23, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 4, !"PIC Level", i32 2}
!31 = !{i32 1, !"CodeView", i32 1}
!32 = !{i32 1, !"uwtable", i32 2}
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !34, splitDebugInlining: false)
!34 = !{!0}
!35 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 27, type: !36, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!36 = !DISubroutineType(types: !37)
!37 = !{!29, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !{}
!40 = !DILocation(line: 28, column: 1, scope: !35)
!41 = !DILocalVariable(name: "self", arg: 1, scope: !35, file: !2, line: 27, type: !38)
!42 = !DILocation(line: 27, column: 28, scope: !35)
!43 = !DILocation(line: 29, column: 9, scope: !35)
!44 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 32, type: !36, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!45 = !DILocation(line: 33, column: 1, scope: !44)
!46 = !DILocalVariable(name: "self", arg: 1, scope: !44, file: !2, line: 32, type: !38)
!47 = !DILocation(line: 32, column: 30, scope: !44)
!48 = !DILocation(line: 34, column: 10, scope: !44)
!49 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 37, type: !50, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !54, !38, !55}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !53)
!53 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 31, size: 384, align: 64, elements: !57, identifier: "std.io.Formatter")
!57 = !{!58, !59, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !2, line: 33, baseType: !25, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !56, file: !2, line: 34, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !61, align: 8)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DISubroutineType(types: !63)
!63 = !{!52, !25, !25, !14}
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !2, line: 35, baseType: !65, size: 256, align: 64, offset: 128)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !56, file: !2, line: 35, size: 256, align: 64, elements: !66)
!66 = !{!67, !68, !69, !70, !71}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !2, line: 37, baseType: !20, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !65, file: !2, line: 38, baseType: !20, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !65, file: !2, line: 39, baseType: !20, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !65, file: !2, line: 40, baseType: !16, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !65, file: !2, line: 41, baseType: !52, size: 64, align: 64, offset: 192)
!72 = !DILocation(line: 38, column: 1, scope: !49)
!73 = !DILocalVariable(name: "self", arg: 1, scope: !49, file: !2, line: 37, type: !38)
!74 = !DILocation(line: 37, column: 29, scope: !49)
!75 = !DILocalVariable(name: "formatter", arg: 2, scope: !49, file: !2, line: 37, type: !55)
!76 = !DILocation(line: 37, column: 47, scope: !49)
!77 = !DILocalVariable(name: "inline_suffix", scope: !49, file: !2, line: 39, type: !9, align: 8)
!78 = !DILocation(line: 39, column: 9, scope: !49)
!79 = !DILocation(line: 39, column: 25, scope: !49)
!80 = !DILocation(line: 39, column: 56, scope: !49)
!81 = !DILocation(line: 40, column: 6, scope: !49)
!82 = !DILocation(line: 42, column: 51, scope: !83)
!83 = distinct !DILexicalBlock(scope: !49, file: !2, line: 41, column: 2)
!84 = !DILocation(line: 42, column: 66, scope: !83)
!85 = !DILocation(line: 42, column: 84, scope: !83)
!86 = !DILocation(line: 42, column: 95, scope: !83)
!87 = !DILocation(line: 42, column: 106, scope: !83)
!88 = !DILocation(line: 42, column: 10, scope: !83)
!89 = !DILocation(line: 44, column: 6, scope: !49)
!90 = !DILocation(line: 46, column: 49, scope: !91)
!91 = distinct !DILexicalBlock(scope: !49, file: !2, line: 45, column: 2)
!92 = !DILocation(line: 46, column: 10, scope: !91)
!93 = !DILocation(line: 48, column: 63, scope: !49)
!94 = !DILocation(line: 48, column: 78, scope: !49)
!95 = !DILocation(line: 48, column: 96, scope: !49)
!96 = !DILocation(line: 48, column: 9, scope: !49)
!97 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 50, type: !98, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !38}
!100 = !DILocation(line: 51, column: 1, scope: !97)
!101 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !2, line: 50, type: !38)
!102 = !DILocation(line: 50, column: 24, scope: !97)
!103 = !DILocation(line: 52, column: 7, scope: !97)
!104 = !DILocation(line: 52, column: 29, scope: !97)
!105 = !DILocation(line: 53, column: 18, scope: !97)
!106 = !DILocation(line: 53, column: 34, scope: !97)
!107 = !DILocation(line: 101, column: 7, scope: !108, inlinedAt: !110)
!108 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !109, file: !109, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!109 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!110 = !DILocation(line: 53, column: 13, scope: !97)
!111 = !DILocation(line: 101, column: 18, scope: !108, inlinedAt: !110)
!112 = !DILocation(line: 105, column: 25, scope: !108, inlinedAt: !110)
!113 = !DILocation(line: 105, column: 2, scope: !108, inlinedAt: !110)
!114 = !DILocation(line: 54, column: 18, scope: !97)
!115 = !DILocation(line: 54, column: 34, scope: !97)
!116 = !DILocation(line: 101, column: 7, scope: !117, inlinedAt: !118)
!117 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !109, file: !109, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!118 = !DILocation(line: 54, column: 13, scope: !97)
!119 = !DILocation(line: 101, column: 18, scope: !117, inlinedAt: !118)
!120 = !DILocation(line: 105, column: 25, scope: !117, inlinedAt: !118)
!121 = !DILocation(line: 105, column: 2, scope: !117, inlinedAt: !118)
!122 = !DILocation(line: 55, column: 18, scope: !97)
!123 = !DILocation(line: 55, column: 34, scope: !97)
!124 = !DILocation(line: 101, column: 7, scope: !125, inlinedAt: !126)
!125 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !109, file: !109, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!126 = !DILocation(line: 55, column: 13, scope: !97)
!127 = !DILocation(line: 101, column: 18, scope: !125, inlinedAt: !126)
!128 = !DILocation(line: 105, column: 25, scope: !125, inlinedAt: !126)
!129 = !DILocation(line: 105, column: 2, scope: !125, inlinedAt: !126)
!130 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 58, type: !131, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!131 = !DISubroutineType(types: !132)
!132 = !{!38, !38, !7, !9, !9, !9, !20, !22}
!133 = !DILocation(line: 59, column: 1, scope: !130)
!134 = !DILocalVariable(name: "self", arg: 1, scope: !130, file: !2, line: 58, type: !38)
!135 = !DILocation(line: 58, column: 30, scope: !130)
!136 = !DILocalVariable(name: "offset", arg: 2, scope: !130, file: !2, line: 58, type: !6)
!137 = !DILocation(line: 58, column: 42, scope: !130)
!138 = !DILocalVariable(name: "function", arg: 3, scope: !130, file: !2, line: 58, type: !9)
!139 = !DILocation(line: 58, column: 57, scope: !130)
!140 = !DILocalVariable(name: "object_file", arg: 4, scope: !130, file: !2, line: 58, type: !9)
!141 = !DILocation(line: 58, column: 74, scope: !130)
!142 = !DILocalVariable(name: "file", arg: 5, scope: !130, file: !2, line: 58, type: !9)
!143 = !DILocation(line: 58, column: 94, scope: !130)
!144 = !DILocalVariable(name: "line", arg: 6, scope: !130, file: !2, line: 58, type: !20)
!145 = !DILocation(line: 58, column: 110, scope: !130)
!146 = !DILocalVariable(name: "allocator", arg: 7, scope: !130, file: !2, line: 58, type: !22)
!147 = !DILocation(line: 58, column: 130, scope: !130)
!148 = !DILocation(line: 60, column: 7, scope: !130)
!149 = !DILocation(line: 62, column: 3, scope: !150)
!150 = distinct !DILexicalBlock(scope: !130, file: !2, line: 61, column: 2)
!151 = !DILocation(line: 62, column: 17, scope: !150)
!152 = !DILocation(line: 63, column: 3, scope: !150)
!153 = !DILocation(line: 63, column: 19, scope: !150)
!154 = !DILocation(line: 64, column: 3, scope: !150)
!155 = !DILocation(line: 64, column: 22, scope: !150)
!156 = !DILocation(line: 65, column: 3, scope: !150)
!157 = !DILocation(line: 65, column: 15, scope: !150)
!158 = !DILocation(line: 66, column: 3, scope: !150)
!159 = !DILocation(line: 66, column: 15, scope: !150)
!160 = !DILocation(line: 67, column: 3, scope: !150)
!161 = !DILocation(line: 67, column: 20, scope: !150)
!162 = !DILocation(line: 68, column: 10, scope: !150)
!163 = !DILocation(line: 70, column: 2, scope: !130)
!164 = !DILocation(line: 70, column: 16, scope: !130)
!165 = !DILocation(line: 71, column: 2, scope: !130)
!166 = !DILocation(line: 71, column: 18, scope: !130)
!167 = !DILocation(line: 72, column: 2, scope: !130)
!168 = !DILocation(line: 72, column: 21, scope: !130)
!169 = !DILocation(line: 73, column: 2, scope: !130)
!170 = !DILocation(line: 73, column: 14, scope: !130)
!171 = !DILocation(line: 74, column: 2, scope: !130)
!172 = !DILocation(line: 74, column: 19, scope: !130)
!173 = !DILocation(line: 75, column: 2, scope: !130)
!174 = !DILocation(line: 75, column: 14, scope: !130)
!175 = !DILocation(line: 76, column: 9, scope: !130)
!176 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 79, type: !177, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !39)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !179}
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !180, identifier: "void*[]")
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !179, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, baseType: !16, size: 64, align: 64, offset: 64)
!184 = !DILocalVariable(name: "buffer", arg: 1, scope: !176, file: !2, line: 79, type: !179)
!185 = !DILocation(line: 79, column: 36, scope: !176)
!186 = !DILocation(line: 81, column: 7, scope: !176)
!187 = !DILocation(line: 81, column: 26, scope: !176)
!188 = !DILocalVariable(name: "len", scope: !176, file: !2, line: 87, type: !189, align: 2)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 169, baseType: !190, align: 2)
!190 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!191 = !DILocation(line: 87, column: 15, scope: !176)
!192 = !DILocation(line: 87, column: 56, scope: !176)
!193 = !DILocation(line: 87, column: 80, scope: !176)
!194 = !DILocation(line: 87, column: 28, scope: !176)
!195 = !DILocation(line: 88, column: 11, scope: !176)
!196 = !DILocation(line: 88, column: 18, scope: !176)
!197 = !DILocation(line: 88, column: 19, scope: !176)
