; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"fn void!()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%TestContext = type { [32 x i64] }

$std.core.runtime.benchmark_collection_create = comdat any

$std.core.runtime.set_benchmark_warmup_iterations = comdat any

$std.core.runtime.set_benchmark_max_iterations = comdat any

$std.core.runtime.run_benchmarks = comdat any

$std.core.runtime.default_benchmark_runner = comdat any

$std.core.runtime.test_collection_create = comdat any

$std.core.runtime.cmp_test_unit = comdat any

$std.core.runtime.test_panic = comdat any

$std.core.runtime.run_tests = comdat any

$std.core.runtime.default_test_runner = comdat any

$.dyn_search = comdat any

$"$ct.std.core.runtime.AnyRaw" = comdat any

$"$ct.std.core.runtime.SliceRaw" = comdat any

$"$ct.std.core.runtime.BenchmarkUnit" = comdat any

$"$ct.std.core.runtime.TestUnit" = comdat any

$"$ct.std.core.runtime.TestContext" = comdat any

$std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 45, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "runtime.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 46, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 48, type: !8, isLocal: true, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 49, type: !8, isLocal: true, isDefinition: true, align: 4)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !2, file: !2, line: 182, type: !13, isLocal: true, isDefinition: true, align: 8)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !2, file: !2, line: 163, size: 2048, align: 64, elements: !15, identifier: "std.core.runtime.TestContext")
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !14, file: !2, line: 165, baseType: !17, size: 2048, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !2, file: !2, line: 36, baseType: !18, align: 8)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, align: 64, elements: !20)
!19 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!20 = !{!21}
!21 = !DISubrange(count: 32, lowerBound: 0)
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"CodeView", i32 1}
!24 = !{i32 1, !"uwtable", i32 2}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !26, splitDebugInlining: false)
!26 = !{!0, !4, !6, !9, !11}
!27 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 33, type: !28, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !32, !54}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !31)
!31 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !33, identifier: "BenchmarkUnit[]")
!33 = !{!34, !53}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !32, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 27, size: 192, align: 64, elements: !37, identifier: "std.core.runtime.BenchmarkUnit")
!37 = !{!38, !47}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !2, line: 29, baseType: !39, size: 128, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !41, identifier: "char[]")
!41 = !{!42, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !40, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !19)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !36, file: !2, line: 30, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 25, baseType: !49, align: 8)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DISubroutineType(types: !51)
!51 = !{!30, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, baseType: !46, size: 64, align: 64, offset: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !55, identifier: "Allocator")
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !54, baseType: !52, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!59 = !{}
!60 = !DILocation(line: 35, column: 22, scope: !27)
!61 = !DILocalVariable(name: "allocator", arg: 1, scope: !27, file: !2, line: 33, type: !54)
!62 = !DILocation(line: 33, column: 58, scope: !27)
!63 = !DILocalVariable(name: "fns", scope: !27, file: !2, line: 35, type: !64, align: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !65, identifier: "BenchmarkFn[]")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, baseType: !46, size: 64, align: 64, offset: 64)
!69 = !DILocation(line: 35, column: 16, scope: !27)
!70 = !DILocalVariable(name: "names", scope: !27, file: !2, line: 36, type: !71, align: 8)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !72, identifier: "String[]")
!72 = !{!73, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !71, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, baseType: !46, size: 64, align: 64, offset: 64)
!76 = !DILocation(line: 36, column: 11, scope: !27)
!77 = !DILocation(line: 36, column: 19, scope: !27)
!78 = !DILocalVariable(name: "benchmarks", scope: !27, file: !2, line: 37, type: !32, align: 8)
!79 = !DILocation(line: 37, column: 18, scope: !27)
!80 = !DILocation(line: 37, column: 80, scope: !27)
!81 = !DILocation(line: 286, column: 55, scope: !82, inlinedAt: !84)
!82 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !83, file: !83, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!83 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!84 = !DILocation(line: 269, column: 9, scope: !85, inlinedAt: !86)
!85 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !83, file: !83, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!86 = !DILocation(line: 37, column: 42, scope: !27)
!87 = !DILocation(line: 286, column: 40, scope: !82, inlinedAt: !84)
!88 = !DILocation(line: 62, column: 7, scope: !89, inlinedAt: !90)
!89 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !83, file: !83, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!90 = !DILocation(line: 286, column: 11, scope: !82, inlinedAt: !84)
!91 = !DILocation(line: 62, column: 20, scope: !89, inlinedAt: !90)
!92 = !DILocation(line: 28, column: 71, scope: !93, inlinedAt: !94)
!93 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !83, file: !83, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!94 = !DILocation(line: 68, column: 10, scope: !89, inlinedAt: !90)
!95 = !DILocation(line: 286, column: 67, scope: !82, inlinedAt: !84)
!96 = !DILocalVariable(name: ".temp", scope: !97, file: !2, line: 38, type: !46, align: 8)
!97 = distinct !DILexicalBlock(scope: !27, file: !2, line: 38, column: 2)
!98 = !DILocation(line: 38, column: 26, scope: !97)
!99 = !DILocation(line: 38, column: 11, scope: !97)
!100 = !DILocalVariable(name: "i", scope: !101, file: !2, line: 38, type: !46, align: 8)
!101 = distinct !DILexicalBlock(scope: !97, file: !2, line: 39, column: 2)
!102 = !DILocation(line: 38, column: 11, scope: !101)
!103 = !DILocalVariable(name: "benchmark", scope: !101, file: !2, line: 38, type: !49, align: 8)
!104 = !DILocation(line: 38, column: 14, scope: !101)
!105 = !DILocation(line: 38, column: 26, scope: !101)
!106 = !DILocation(line: 40, column: 3, scope: !107)
!107 = distinct !DILexicalBlock(scope: !101, file: !2, line: 39, column: 2)
!108 = !DILocation(line: 40, column: 14, scope: !107)
!109 = !DILocation(line: 40, column: 21, scope: !107)
!110 = !DILocation(line: 40, column: 27, scope: !107)
!111 = !DILocation(line: 40, column: 31, scope: !107)
!112 = !DILocation(line: 40, column: 35, scope: !107)
!113 = !DILocation(line: 42, column: 9, scope: !27)
!114 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 51, type: !115, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !8}
!117 = !DILocalVariable(name: "value", arg: 1, scope: !114, file: !2, line: 51, type: !8)
!118 = !DILocation(line: 51, column: 46, scope: !114)
!119 = !DILocation(line: 53, column: 35, scope: !114)
!120 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 56, type: !115, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!121 = !DILocalVariable(name: "value", arg: 1, scope: !120, file: !2, line: 56, type: !8)
!122 = !DILocation(line: 56, column: 43, scope: !120)
!123 = !DILocation(line: 58, column: 12, scope: !120)
!124 = !DILocation(line: 59, column: 32, scope: !120)
!125 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 62, type: !126, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !32}
!128 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!129 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !125, file: !2, line: 62, type: !32)
!130 = !DILocation(line: 62, column: 40, scope: !125)
!131 = !DILocalVariable(name: "benchmarks_passed", scope: !125, file: !2, line: 64, type: !3, align: 4)
!132 = !DILocation(line: 64, column: 6, scope: !125)
!133 = !DILocation(line: 64, column: 26, scope: !125)
!134 = !DILocalVariable(name: "benchmark_count", scope: !125, file: !2, line: 65, type: !3, align: 4)
!135 = !DILocation(line: 65, column: 6, scope: !125)
!136 = !DILocation(line: 65, column: 24, scope: !125)
!137 = !DILocalVariable(name: "max_name", scope: !125, file: !2, line: 66, type: !46, align: 8)
!138 = !DILocation(line: 66, column: 6, scope: !125)
!139 = !DILocalVariable(name: ".temp", scope: !140, file: !2, line: 68, type: !46, align: 8)
!140 = distinct !DILexicalBlock(scope: !125, file: !2, line: 68, column: 2)
!141 = !DILocation(line: 68, column: 19, scope: !140)
!142 = !DILocalVariable(name: "unit", scope: !143, file: !2, line: 68, type: !35, align: 8)
!143 = distinct !DILexicalBlock(scope: !140, file: !2, line: 69, column: 2)
!144 = !DILocation(line: 68, column: 12, scope: !143)
!145 = !DILocation(line: 68, column: 19, scope: !143)
!146 = !DILocation(line: 70, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !2, line: 69, column: 2)
!148 = !DILocation(line: 70, column: 18, scope: !147)
!149 = !DILocation(line: 70, column: 44, scope: !147)
!150 = !DILocalVariable(name: "len", scope: !125, file: !2, line: 73, type: !46, align: 8)
!151 = !DILocation(line: 73, column: 6, scope: !125)
!152 = !DILocation(line: 73, column: 12, scope: !125)
!153 = !DILocalVariable(name: "name", scope: !125, file: !2, line: 75, type: !154, align: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !52, align: 8)
!155 = !DILocation(line: 75, column: 10, scope: !125)
!156 = !DILocation(line: 75, column: 26, scope: !125)
!157 = !DILocation(line: 76, column: 26, scope: !125)
!158 = !DILocation(line: 76, column: 2, scope: !125)
!159 = !DILocation(line: 378, column: 22, scope: !160, inlinedAt: !162)
!160 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !161, file: !161, line: 368, scopeLine: 368, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!161 = !DIFile(filename: "dstring.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!162 = !DILocation(line: 77, column: 2, scope: !125)
!163 = !DILocation(line: 378, column: 4, scope: !160, inlinedAt: !162)
!164 = !DILocation(line: 78, column: 26, scope: !125)
!165 = !DILocation(line: 78, column: 32, scope: !125)
!166 = !DILocation(line: 78, column: 2, scope: !125)
!167 = !DILocation(line: 194, column: 20, scope: !168, inlinedAt: !170)
!168 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !169, file: !169, line: 192, scopeLine: 192, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!169 = !DIFile(filename: "io.c3", directory: "C:/Dev/C3/c3-windows/lib/std/io")
!170 = !DILocation(line: 80, column: 6, scope: !125)
!171 = !DILocalVariable(name: "len", scope: !172, file: !2, line: 168, type: !46, align: 8)
!172 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !169, file: !169, line: 166, scopeLine: 166, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !59)
!173 = !DILocation(line: 168, column: 6, scope: !172, inlinedAt: !174)
!174 = !DILocation(line: 194, column: 3, scope: !168, inlinedAt: !170)
!175 = !DILocation(line: 120, column: 35, scope: !176, inlinedAt: !177)
!176 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !169, file: !169, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!177 = !DILocation(line: 168, column: 12, scope: !172, inlinedAt: !174)
!178 = !DILocation(line: 120, column: 25, scope: !176, inlinedAt: !177)
!179 = !DILocation(line: 169, column: 17, scope: !172, inlinedAt: !174)
!180 = !DILocation(line: 169, column: 2, scope: !172, inlinedAt: !174)
!181 = !DILocation(line: 174, column: 4, scope: !172, inlinedAt: !174)
!182 = !DILocation(line: 176, column: 9, scope: !172, inlinedAt: !174)
!183 = !DILocation(line: 82, column: 2, scope: !125)
!184 = !DILocalVariable(name: "sys_clock_started", scope: !125, file: !2, line: 84, type: !31, align: 8)
!185 = !DILocation(line: 84, column: 7, scope: !125)
!186 = !DILocalVariable(name: "sys_clock_finished", scope: !125, file: !2, line: 85, type: !31, align: 8)
!187 = !DILocation(line: 85, column: 7, scope: !125)
!188 = !DILocalVariable(name: "sys_clocks", scope: !125, file: !2, line: 86, type: !31, align: 8)
!189 = !DILocation(line: 86, column: 7, scope: !125)
!190 = !DILocalVariable(name: "clock", scope: !125, file: !2, line: 87, type: !191, align: 8)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !19, align: 8)
!192 = !DILocation(line: 87, column: 8, scope: !125)
!193 = !DILocalVariable(name: "err", scope: !125, file: !2, line: 88, type: !30, align: 8)
!194 = !DILocation(line: 88, column: 11, scope: !125)
!195 = !DILocalVariable(name: ".temp", scope: !196, file: !2, line: 90, type: !46, align: 8)
!196 = distinct !DILexicalBlock(scope: !125, file: !2, line: 90, column: 2)
!197 = !DILocation(line: 90, column: 17, scope: !196)
!198 = !DILocalVariable(name: "unit", scope: !199, file: !2, line: 90, type: !36, align: 8)
!199 = distinct !DILexicalBlock(scope: !196, file: !2, line: 91, column: 2)
!200 = !DILocation(line: 90, column: 10, scope: !199)
!201 = !DILocation(line: 90, column: 17, scope: !199)
!202 = !DILocation(line: 93, column: 36, scope: !203)
!203 = distinct !DILexicalBlock(scope: !199, file: !2, line: 91, column: 2)
!204 = !DILocation(line: 93, column: 3, scope: !203)
!205 = !DILocation(line: 94, column: 27, scope: !203)
!206 = !DILocation(line: 94, column: 38, scope: !203)
!207 = !DILocation(line: 94, column: 3, scope: !203)
!208 = !DILocation(line: 95, column: 21, scope: !203)
!209 = !DILocation(line: 95, column: 7, scope: !203)
!210 = !DILocalVariable(name: "i", scope: !211, file: !2, line: 97, type: !8, align: 4)
!211 = distinct !DILexicalBlock(scope: !203, file: !2, line: 97, column: 3)
!212 = !DILocation(line: 97, column: 13, scope: !211)
!213 = !DILocation(line: 97, column: 17, scope: !211)
!214 = !DILocation(line: 97, column: 20, scope: !211)
!215 = !DILocation(line: 97, column: 24, scope: !211)
!216 = !DILocalVariable(name: "f", scope: !217, file: !2, line: 330, type: !30, align: 8)
!217 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !218, file: !218, line: 328, scopeLine: 328, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !59)
!218 = !DIFile(filename: "builtin.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!219 = !DILocation(line: 330, column: 12, scope: !217, inlinedAt: !220)
!220 = !DILocation(line: 99, column: 10, scope: !221)
!221 = distinct !DILexicalBlock(scope: !211, file: !2, line: 98, column: 3)
!222 = !DILocation(line: 99, column: 17, scope: !217, inlinedAt: !220)
!223 = !DILocation(line: 330, column: 16, scope: !217, inlinedAt: !220)
!224 = !DILocation(line: 330, column: 30, scope: !217, inlinedAt: !220)
!225 = !DILocation(line: 331, column: 9, scope: !217, inlinedAt: !220)
!226 = !DILocation(line: 192, column: 25, scope: !227, inlinedAt: !229)
!227 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !228, file: !228, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!228 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!229 = !DILocation(line: 100, column: 4, scope: !221)
!230 = !DILocation(line: 97, column: 53, scope: !211)
!231 = !DILocation(line: 103, column: 29, scope: !203)
!232 = !DILocation(line: 104, column: 23, scope: !203)
!233 = !DILocalVariable(name: "i", scope: !234, file: !2, line: 106, type: !8, align: 4)
!234 = distinct !DILexicalBlock(scope: !203, file: !2, line: 106, column: 3)
!235 = !DILocation(line: 106, column: 13, scope: !234)
!236 = !DILocation(line: 106, column: 17, scope: !234)
!237 = !DILocation(line: 106, column: 20, scope: !234)
!238 = !DILocation(line: 106, column: 24, scope: !234)
!239 = !DILocalVariable(name: "f", scope: !240, file: !2, line: 330, type: !30, align: 8)
!240 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !218, file: !218, line: 328, scopeLine: 328, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !59)
!241 = !DILocation(line: 330, column: 12, scope: !240, inlinedAt: !242)
!242 = !DILocation(line: 108, column: 10, scope: !243)
!243 = distinct !DILexicalBlock(scope: !234, file: !2, line: 107, column: 3)
!244 = !DILocation(line: 108, column: 17, scope: !240, inlinedAt: !242)
!245 = !DILocation(line: 330, column: 16, scope: !240, inlinedAt: !242)
!246 = !DILocation(line: 330, column: 30, scope: !240, inlinedAt: !242)
!247 = !DILocation(line: 331, column: 9, scope: !240, inlinedAt: !242)
!248 = !DILocation(line: 192, column: 25, scope: !249, inlinedAt: !250)
!249 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !228, file: !228, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!250 = !DILocation(line: 109, column: 4, scope: !243)
!251 = !DILocation(line: 106, column: 50, scope: !234)
!252 = !DILocation(line: 112, column: 24, scope: !203)
!253 = !DILocalVariable(name: "nano_seconds", scope: !203, file: !2, line: 113, type: !254, align: 8)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !31, align: 8)
!255 = !DILocation(line: 113, column: 16, scope: !203)
!256 = !DILocation(line: 113, column: 31, scope: !203)
!257 = !DILocation(line: 114, column: 16, scope: !203)
!258 = !DILocation(line: 114, column: 37, scope: !203)
!259 = !DILocation(line: 116, column: 7, scope: !203)
!260 = !DILocation(line: 118, column: 46, scope: !261)
!261 = distinct !DILexicalBlock(scope: !203, file: !2, line: 117, column: 3)
!262 = !DILocation(line: 118, column: 8, scope: !261)
!263 = !DILocation(line: 92, column: 9, scope: !264)
!264 = distinct !DILexicalBlock(scope: !203, file: !2, line: 92, column: 9)
!265 = !DILocation(line: 122, column: 51, scope: !203)
!266 = !DILocation(line: 122, column: 72, scope: !203)
!267 = !DILocation(line: 122, column: 99, scope: !203)
!268 = !DILocation(line: 122, column: 118, scope: !203)
!269 = !DILocation(line: 122, column: 7, scope: !203)
!270 = !DILocation(line: 123, column: 3, scope: !203)
!271 = !DILocation(line: 92, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !203, file: !2, line: 92, column: 9)
!273 = !DILocation(line: 126, column: 41, scope: !125)
!274 = !DILocation(line: 126, column: 58, scope: !125)
!275 = !DILocation(line: 126, column: 86, scope: !125)
!276 = !DILocation(line: 126, column: 6, scope: !125)
!277 = !DILocation(line: 128, column: 3, scope: !125)
!278 = !DILocation(line: 128, column: 23, scope: !125)
!279 = !DILocation(line: 128, column: 52, scope: !125)
!280 = !DILocation(line: 129, column: 3, scope: !125)
!281 = !DILocation(line: 130, column: 3, scope: !125)
!282 = !DILocation(line: 130, column: 21, scope: !125)
!283 = !DILocation(line: 127, column: 6, scope: !125)
!284 = !DILocation(line: 132, column: 9, scope: !125)
!285 = !DILocation(line: 132, column: 28, scope: !125)
!286 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 135, type: !287, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25)
!287 = !DISubroutineType(types: !288)
!288 = !{!128}
!289 = !DILocalVariable(name: "current", scope: !290, file: !2, line: 536, type: !291, align: 8)
!290 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !228, file: !228, line: 534, scopeLine: 534, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, retainedNodes: !59)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !292, size: 64, align: 64, dwarfAddressSpace: 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !293, identifier: "std.core.mem.allocator.TempAllocator")
!293 = !{!294, !295, !308, !309, !310}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !292, file: !2, line: 12, baseType: !54, size: 128, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !292, file: !2, line: 13, baseType: !296, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !298, identifier: "std.core.mem.allocator.TempAllocatorPage")
!298 = !{!299, !300, !301, !302, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !297, file: !2, line: 24, baseType: !296, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !297, file: !2, line: 25, baseType: !52, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !297, file: !2, line: 26, baseType: !46, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !297, file: !2, line: 27, baseType: !46, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !297, file: !2, line: 28, baseType: !46, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !2, line: 29, baseType: !305, align: 8, offset: 320)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, align: 8, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 0, lowerBound: 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !292, file: !2, line: 14, baseType: !46, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !292, file: !2, line: 15, baseType: !46, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !2, line: 16, baseType: !305, align: 8, offset: 320)
!311 = !DILocation(line: 536, column: 17, scope: !290, inlinedAt: !312)
!312 = !DILocation(line: 137, column: 2, scope: !286)
!313 = !DILocation(line: 396, column: 7, scope: !314, inlinedAt: !315)
!314 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !83, file: !83, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!315 = !DILocation(line: 536, column: 38, scope: !290, inlinedAt: !312)
!316 = !DILocation(line: 398, column: 3, scope: !317, inlinedAt: !315)
!317 = distinct !DILexicalBlock(scope: !314, file: !83, line: 397, column: 2)
!318 = !DILocation(line: 400, column: 9, scope: !314, inlinedAt: !315)
!319 = !DILocalVariable(name: "mark", scope: !290, file: !2, line: 542, type: !46, align: 8)
!320 = !DILocation(line: 542, column: 6, scope: !290, inlinedAt: !312)
!321 = !DILocation(line: 542, column: 13, scope: !290, inlinedAt: !312)
!322 = !DILocation(line: 396, column: 7, scope: !323, inlinedAt: !324)
!323 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !83, file: !83, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!324 = !DILocation(line: 139, column: 64, scope: !325)
!325 = distinct !DILexicalBlock(scope: !286, file: !2, line: 138, column: 2)
!326 = !DILocation(line: 398, column: 3, scope: !327, inlinedAt: !324)
!327 = distinct !DILexicalBlock(scope: !323, file: !83, line: 397, column: 2)
!328 = !DILocation(line: 400, column: 9, scope: !323, inlinedAt: !324)
!329 = !DILocation(line: 139, column: 25, scope: !325)
!330 = !DILocation(line: 139, column: 10, scope: !325)
!331 = !DILocation(line: 545, column: 17, scope: !332, inlinedAt: !312)
!332 = distinct !DILexicalBlock(scope: !290, file: !228, line: 544, column: 2)
!333 = !DILocation(line: 545, column: 3, scope: !332, inlinedAt: !312)
!334 = !DILocation(line: 549, column: 2, scope: !332, inlinedAt: !312)
!335 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !2, file: !2, line: 151, type: !336, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!336 = !DISubroutineType(types: !337)
!337 = !{!30, !338, !54}
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !339, identifier: "TestUnit[]")
!339 = !{!340, !348}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !338, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !2, file: !2, line: 145, size: 192, align: 64, elements: !343, identifier: "std.core.runtime.TestUnit")
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !2, line: 147, baseType: !39, size: 128, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !342, file: !2, line: 148, baseType: !346, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !2, file: !2, line: 143, baseType: !347, align: 8)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !338, baseType: !46, size: 64, align: 64, offset: 64)
!349 = !DILocation(line: 153, column: 17, scope: !335)
!350 = !DILocalVariable(name: "allocator", arg: 1, scope: !335, file: !2, line: 151, type: !54)
!351 = !DILocation(line: 151, column: 48, scope: !335)
!352 = !DILocalVariable(name: "fns", scope: !335, file: !2, line: 153, type: !353, align: 8)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !354, identifier: "TestFn[]")
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !353, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !346, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !353, baseType: !46, size: 64, align: 64, offset: 64)
!358 = !DILocation(line: 153, column: 11, scope: !335)
!359 = !DILocalVariable(name: "names", scope: !335, file: !2, line: 154, type: !71, align: 8)
!360 = !DILocation(line: 154, column: 11, scope: !335)
!361 = !DILocation(line: 154, column: 19, scope: !335)
!362 = !DILocalVariable(name: "tests", scope: !335, file: !2, line: 155, type: !338, align: 8)
!363 = !DILocation(line: 155, column: 13, scope: !335)
!364 = !DILocation(line: 155, column: 65, scope: !335)
!365 = !DILocation(line: 286, column: 55, scope: !366, inlinedAt: !367)
!366 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !83, file: !83, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!367 = !DILocation(line: 269, column: 9, scope: !368, inlinedAt: !369)
!368 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !83, file: !83, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!369 = !DILocation(line: 155, column: 32, scope: !335)
!370 = !DILocation(line: 286, column: 40, scope: !366, inlinedAt: !367)
!371 = !DILocation(line: 62, column: 7, scope: !372, inlinedAt: !373)
!372 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !83, file: !83, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!373 = !DILocation(line: 286, column: 11, scope: !366, inlinedAt: !367)
!374 = !DILocation(line: 62, column: 20, scope: !372, inlinedAt: !373)
!375 = !DILocation(line: 28, column: 71, scope: !376, inlinedAt: !377)
!376 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !83, file: !83, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!377 = !DILocation(line: 68, column: 10, scope: !372, inlinedAt: !373)
!378 = !DILocation(line: 286, column: 67, scope: !366, inlinedAt: !367)
!379 = !DILocalVariable(name: ".temp", scope: !380, file: !2, line: 156, type: !46, align: 8)
!380 = distinct !DILexicalBlock(scope: !335, file: !2, line: 156, column: 2)
!381 = !DILocation(line: 156, column: 21, scope: !380)
!382 = !DILocation(line: 156, column: 11, scope: !380)
!383 = !DILocalVariable(name: "i", scope: !384, file: !2, line: 156, type: !46, align: 8)
!384 = distinct !DILexicalBlock(scope: !380, file: !2, line: 157, column: 2)
!385 = !DILocation(line: 156, column: 11, scope: !384)
!386 = !DILocalVariable(name: "test", scope: !384, file: !2, line: 156, type: !347, align: 8)
!387 = !DILocation(line: 156, column: 14, scope: !384)
!388 = !DILocation(line: 156, column: 21, scope: !384)
!389 = !DILocation(line: 158, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !384, file: !2, line: 157, column: 2)
!391 = !DILocation(line: 158, column: 9, scope: !390)
!392 = !DILocation(line: 158, column: 16, scope: !390)
!393 = !DILocation(line: 158, column: 22, scope: !390)
!394 = !DILocation(line: 158, column: 26, scope: !390)
!395 = !DILocation(line: 158, column: 30, scope: !390)
!396 = !DILocation(line: 160, column: 9, scope: !335)
!397 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !2, file: !2, line: 169, type: !398, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !59)
!398 = !DISubroutineType(types: !399)
!399 = !{!3, !342, !342}
!400 = !DILocalVariable(name: "a", arg: 1, scope: !397, file: !2, line: 169, type: !342)
!401 = !DILocation(line: 169, column: 31, scope: !397)
!402 = !DILocalVariable(name: "b", arg: 2, scope: !397, file: !2, line: 169, type: !342)
!403 = !DILocation(line: 169, column: 43, scope: !397)
!404 = !DILocalVariable(name: "an", scope: !397, file: !2, line: 171, type: !46, align: 8)
!405 = !DILocation(line: 171, column: 6, scope: !397)
!406 = !DILocation(line: 171, column: 11, scope: !397)
