; ModuleID = 'std::math::uuid'
source_filename = "std::math::uuid"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.math.uuid.Uuid.to_format = comdat any

$std.math.uuid.Uuid.to_string = comdat any

$std.math.uuid.generate = comdat any

$std.math.uuid.generate_from_random = comdat any

$.dyn_search = comdat any

$"$ct.std.math.uuid.Uuid" = comdat any

$"$ct.a16$char" = comdat any

$"$ct.char" = comdat any

$"$ct.std.math.random.Sfc64Random" = comdat any

$"$ct.a4$ulong" = comdat any

$"$ct.ulong" = comdat any

$"$sel.next_bytes" = comdat any

$"$sel.to_format" = comdat any

$"$sel.to_string" = comdat any

@"$ct.std.math.uuid.Uuid" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.a16$char" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.a16$char" = linkonce global %.introspect { i8 15, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 16, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@std.math.random.default_random_initialized = external thread_local global i8, align 1

!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!4 = !DIFile(filename: "uuid.c3", directory: "C:/Dev/C3/c3-windows/lib/std/math")
!5 = distinct !DISubprogram(name: "to_format", linkageName: "std.math.uuid.Uuid.to_format", scope: !4, file: !4, line: 28, type: !6, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !38)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !10, !13, !19}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !9)
!9 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !12)
!12 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Uuid*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uuid", scope: !4, file: !4, line: 5, baseType: !15, align: 1)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, align: 8, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!18}
!18 = !DISubrange(count: 16, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !4, file: !4, line: 31, size: 384, align: 64, elements: !21, identifier: "std.io.Formatter")
!21 = !{!22, !24, !29}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !4, line: 33, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !20, file: !4, line: 34, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !4, file: !4, line: 23, baseType: !26, align: 8)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DISubroutineType(types: !28)
!28 = !{!8, !23, !23, !16}
!29 = !DIDerivedType(tag: DW_TAG_member, scope: !20, file: !4, line: 35, baseType: !30, size: 256, align: 64, offset: 128)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !20, file: !4, line: 35, size: 256, align: 64, elements: !31)
!31 = !{!32, !34, !35, !36, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !4, line: 37, baseType: !33, size: 32, align: 32)
!33 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !30, file: !4, line: 38, baseType: !33, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !30, file: !4, line: 39, baseType: !33, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !30, file: !4, line: 40, baseType: !11, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !30, file: !4, line: 41, baseType: !8, size: 64, align: 64, offset: 192)
!38 = !{}
!39 = !DILocation(line: 29, column: 1, scope: !5)
!40 = !DILocalVariable(name: "self", arg: 1, scope: !5, file: !4, line: 28, type: !13)
!41 = !DILocation(line: 28, column: 24, scope: !5)
!42 = !DILocalVariable(name: "formatter", arg: 2, scope: !5, file: !4, line: 28, type: !19)
!43 = !DILocation(line: 28, column: 42, scope: !5)
!44 = !DILocation(line: 31, column: 5, scope: !5)
!45 = !DILocation(line: 31, column: 11, scope: !5)
!46 = !DILocation(line: 31, column: 17, scope: !5)
!47 = !DILocation(line: 31, column: 23, scope: !5)
!48 = !DILocation(line: 31, column: 29, scope: !5)
!49 = !DILocation(line: 31, column: 35, scope: !5)
!50 = !DILocation(line: 31, column: 41, scope: !5)
!51 = !DILocation(line: 31, column: 47, scope: !5)
!52 = !DILocation(line: 32, column: 5, scope: !5)
!53 = !DILocation(line: 32, column: 11, scope: !5)
!54 = !DILocation(line: 32, column: 17, scope: !5)
!55 = !DILocation(line: 32, column: 23, scope: !5)
!56 = !DILocation(line: 33, column: 5, scope: !5)
!57 = !DILocation(line: 33, column: 11, scope: !5)
!58 = !DILocation(line: 33, column: 17, scope: !5)
!59 = !DILocation(line: 33, column: 23, scope: !5)
!60 = !DILocation(line: 34, column: 5, scope: !5)
!61 = !DILocation(line: 34, column: 11, scope: !5)
!62 = !DILocation(line: 34, column: 17, scope: !5)
!63 = !DILocation(line: 34, column: 23, scope: !5)
!64 = !DILocation(line: 35, column: 5, scope: !5)
!65 = !DILocation(line: 35, column: 11, scope: !5)
!66 = !DILocation(line: 35, column: 18, scope: !5)
!67 = !DILocation(line: 35, column: 24, scope: !5)
!68 = !DILocation(line: 35, column: 31, scope: !5)
!69 = !DILocation(line: 35, column: 37, scope: !5)
!70 = !DILocation(line: 35, column: 44, scope: !5)
!71 = !DILocation(line: 35, column: 50, scope: !5)
!72 = !DILocation(line: 35, column: 57, scope: !5)
!73 = !DILocation(line: 35, column: 63, scope: !5)
!74 = !DILocation(line: 35, column: 70, scope: !5)
!75 = !DILocation(line: 35, column: 76, scope: !5)
!76 = !DILocation(line: 30, column: 9, scope: !5)
!77 = distinct !DISubprogram(name: "to_string", linkageName: "std.math.uuid.Uuid.to_string", scope: !4, file: !4, line: 38, type: !78, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !38)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !13, !86}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !82, identifier: "char[]")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !81, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !81, baseType: !11, size: 64, align: 64, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !87, identifier: "Allocator")
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !86, baseType: !23, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!91 = !DILocation(line: 39, column: 1, scope: !77)
!92 = !DILocalVariable(name: "self", arg: 1, scope: !77, file: !4, line: 38, type: !13)
!93 = !DILocation(line: 38, column: 26, scope: !77)
!94 = !DILocalVariable(name: "allocator", arg: 2, scope: !77, file: !4, line: 38, type: !86)
!95 = !DILocation(line: 38, column: 43, scope: !77)
!96 = !DILocation(line: 40, column: 35, scope: !77)
!97 = !DILocation(line: 40, column: 17, scope: !77)
!98 = distinct !DISubprogram(name: "generate", linkageName: "std.math.uuid.generate", scope: !4, file: !4, line: 10, type: !99, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3)
!99 = !DISubroutineType(types: !100)
!100 = !{!14}
!101 = !DILocation(line: 179, column: 7, scope: !102, inlinedAt: !104)
!102 = distinct !DISubprogram(name: "init_default_random", linkageName: "init_default_random", scope: !103, file: !103, line: 177, scopeLine: 177, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!103 = !DIFile(filename: "math_random.c3", directory: "C:/Dev/C3/c3-windows/lib/std/math")
!104 = !DILocation(line: 12, column: 10, scope: !98)
!105 = !DILocation(line: 136, column: 33, scope: !106, inlinedAt: !107)
!106 = distinct !DISubprogram(name: "is_random", linkageName: "is_random", scope: !103, file: !103, line: 136, scopeLine: 136, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!107 = !DILocation(line: 24, column: 11, scope: !108, inlinedAt: !110)
!108 = distinct !DILexicalBlock(scope: !109, file: !103, line: 27, column: 1)
!109 = distinct !DISubprogram(name: "seed_entropy", linkageName: "seed_entropy", scope: !103, file: !103, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!110 = !DILocation(line: 181, column: 3, scope: !111, inlinedAt: !104)
!111 = distinct !DILexicalBlock(scope: !102, file: !103, line: 180, column: 2)
!112 = !DILocation(line: 28, column: 20, scope: !109, inlinedAt: !110)
!113 = !DILocation(line: 28, column: 2, scope: !109, inlinedAt: !110)
!114 = !DILocation(line: 182, column: 32, scope: !111, inlinedAt: !104)
!115 = !DILocation(line: 13, column: 9, scope: !98)
!116 = distinct !DISubprogram(name: "generate_from_random", linkageName: "std.math.uuid.generate_from_random", scope: !4, file: !4, line: 19, type: !117, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !38)
!117 = !DISubroutineType(types: !118)
!118 = !{!14, !119}
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Random", size: 128, align: 64, elements: !120, identifier: "Random")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !119, baseType: !23, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, baseType: !90, size: 64, align: 64, offset: 64)
!123 = !DILocation(line: 21, column: 7, scope: !116)
!124 = !DILocalVariable(name: "random", arg: 1, scope: !116, file: !4, line: 19, type: !119)
!125 = !DILocation(line: 19, column: 37, scope: !116)
!126 = !DILocalVariable(name: "uuid", scope: !116, file: !4, line: 21, type: !14, align: 16)
!127 = !DILocation(line: 22, column: 22, scope: !116)
!128 = !DILocation(line: 22, column: 2, scope: !116)
!129 = !DILocation(line: 23, column: 7, scope: !116)
!130 = !DILocation(line: 23, column: 18, scope: !116)
!131 = !DILocation(line: 23, column: 13, scope: !116)
!132 = !DILocation(line: 24, column: 7, scope: !116)
!133 = !DILocation(line: 24, column: 18, scope: !116)
!134 = !DILocation(line: 24, column: 13, scope: !116)
!135 = !DILocation(line: 25, column: 9, scope: !116)
