; ModuleID = 'std::collections::anylist'
source_filename = "std::collections::anylist"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.collections.anylist.AnyList.new_init = comdat any

$std.collections.anylist.AnyList.init = comdat any

$std.collections.anylist.AnyList.temp_init = comdat any

$std.collections.anylist.AnyList.to_format = comdat any

$std.collections.anylist.AnyList.to_new_string = comdat any

$std.collections.anylist.AnyList.to_string = comdat any

$std.collections.anylist.AnyList.to_tstring = comdat any

$std.collections.anylist.AnyList.free_element = comdat any

$std.collections.anylist.AnyList.copy_pop = comdat any

$std.collections.anylist.AnyList.new_pop = comdat any

$std.collections.anylist.AnyList.temp_pop = comdat any

$std.collections.anylist.AnyList.tcopy_pop = comdat any

$std.collections.anylist.AnyList.pop_retained = comdat any

$std.collections.anylist.AnyList.clear = comdat any

$std.collections.anylist.AnyList.pop_first_retained = comdat any

$std.collections.anylist.AnyList.new_pop_first = comdat any

$std.collections.anylist.AnyList.copy_pop_first = comdat any

$std.collections.anylist.AnyList.tcopy_pop_first = comdat any


!0 = !{i32 4, !"PIC Level", i32 2}
!1 = !{i32 1, !"CodeView", i32 1}
!2 = !{i32 1, !"uwtable", i32 2}
!3 = distinct !DICompileUnit(language: DW_LANG_C11, file: !4, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!4 = !DIFile(filename: "anylist.c3", directory: "C:/Dev/C3/c3-windows/lib/std/collections")
!5 = distinct !DISubprogram(name: "new_init", linkageName: "std.collections.anylist.AnyList.new_init", scope: !4, file: !4, line: 24, type: !6, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8, !13, !16}
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AnyList*", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnyList", scope: !4, file: !4, line: 10, size: 320, align: 64, elements: !10, identifier: "std.collections.anylist.AnyList")
!10 = !{!11, !14, !15, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !9, file: !4, line: 12, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !13)
!13 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !9, file: !4, line: 13, baseType: !12, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !9, file: !4, line: 14, baseType: !16, size: 128, align: 64, offset: 128)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !17, identifier: "Allocator")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !9, file: !4, line: 15, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !25, identifier: "any")
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !19, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, baseType: !21, size: 64, align: 64, offset: 64)
!28 = !{}
!29 = !DILocation(line: 25, column: 1, scope: !5)
!30 = !DILocalVariable(name: "self", arg: 1, scope: !5, file: !4, line: 24, type: !8)
!31 = !DILocation(line: 24, column: 30, scope: !5)
!32 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !5, file: !4, line: 24, type: !12)
!33 = !DILocation(line: 24, column: 41, scope: !5)
!34 = !DILocalVariable(name: "allocator", arg: 3, scope: !5, file: !4, line: 24, type: !16)
!35 = !DILocation(line: 24, column: 74, scope: !5)
!36 = !DILocation(line: 26, column: 19, scope: !5)
!37 = !DILocation(line: 392, column: 27, scope: !38, inlinedAt: !40)
!38 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !39, file: !39, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!39 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!40 = !DILocation(line: 26, column: 43, scope: !5)
!41 = !DILocation(line: 26, column: 51, scope: !5)
!42 = !DILocation(line: 26, column: 9, scope: !5)
!43 = distinct !DISubprogram(name: "init", linkageName: "std.collections.anylist.AnyList.init", scope: !4, file: !4, line: 33, type: !44, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!44 = !DISubroutineType(types: !45)
!45 = !{!8, !8, !16, !13}
!46 = !DILocation(line: 34, column: 1, scope: !43)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !43, file: !4, line: 33, type: !8)
!48 = !DILocation(line: 33, column: 26, scope: !43)
!49 = !DILocalVariable(name: "allocator", arg: 2, scope: !43, file: !4, line: 33, type: !16)
!50 = !DILocation(line: 33, column: 43, scope: !43)
!51 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !43, file: !4, line: 33, type: !12)
!52 = !DILocation(line: 33, column: 58, scope: !43)
!53 = !DILocation(line: 35, column: 2, scope: !43)
!54 = !DILocation(line: 35, column: 19, scope: !43)
!55 = !DILocation(line: 36, column: 2, scope: !43)
!56 = !DILocation(line: 36, column: 14, scope: !43)
!57 = !DILocation(line: 37, column: 6, scope: !43)
!58 = !DILocalVariable(name: "y", scope: !59, file: !4, line: 1004, type: !12, align: 8)
!59 = distinct !DISubprogram(name: "next_power_of_2", linkageName: "next_power_of_2", scope: !60, file: !60, line: 1002, scopeLine: 1002, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !28)
!60 = !DIFile(filename: "math.c3", directory: "C:/Dev/C3/c3-windows/lib/std/math")
!61 = !DILocation(line: 1004, column: 13, scope: !59, inlinedAt: !62)
!62 = !DILocation(line: 39, column: 28, scope: !63)
!63 = distinct !DILexicalBlock(scope: !43, file: !4, line: 38, column: 2)
!64 = !DILocation(line: 1004, column: 17, scope: !59, inlinedAt: !62)
!65 = !DILocation(line: 1005, column: 2, scope: !59, inlinedAt: !62)
!66 = !DILocation(line: 1005, column: 9, scope: !67, inlinedAt: !62)
!67 = distinct !DILexicalBlock(scope: !59, file: !60, line: 1005, column: 2)
!68 = !DILocation(line: 1005, column: 13, scope: !67, inlinedAt: !62)
!69 = !DILocation(line: 1005, column: 16, scope: !67, inlinedAt: !62)
!70 = !DILocation(line: 1005, column: 21, scope: !67, inlinedAt: !62)
!71 = !DILocation(line: 1006, column: 9, scope: !59, inlinedAt: !62)
!72 = !DILocation(line: 40, column: 3, scope: !63)
!73 = !DILocation(line: 286, column: 55, scope: !74, inlinedAt: !75)
!74 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !39, file: !39, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!75 = !DILocation(line: 269, column: 9, scope: !76, inlinedAt: !77)
!76 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !39, file: !39, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!77 = !DILocation(line: 40, column: 29, scope: !63)
!78 = !DILocation(line: 286, column: 40, scope: !74, inlinedAt: !75)
!79 = !DILocation(line: 62, column: 7, scope: !80, inlinedAt: !81)
!80 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !39, file: !39, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!81 = !DILocation(line: 286, column: 11, scope: !74, inlinedAt: !75)
!82 = !DILocation(line: 62, column: 20, scope: !80, inlinedAt: !81)
!83 = !DILocation(line: 28, column: 71, scope: !84, inlinedAt: !85)
!84 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !39, file: !39, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!85 = !DILocation(line: 68, column: 10, scope: !80, inlinedAt: !81)
!86 = !DILocation(line: 286, column: 67, scope: !74, inlinedAt: !75)
!87 = !DILocation(line: 44, column: 3, scope: !88)
!88 = distinct !DILexicalBlock(scope: !43, file: !4, line: 43, column: 2)
!89 = !DILocation(line: 44, column: 18, scope: !88)
!90 = !DILocation(line: 46, column: 2, scope: !43)
!91 = !DILocation(line: 46, column: 18, scope: !43)
!92 = !DILocation(line: 47, column: 9, scope: !43)
!93 = distinct !DISubprogram(name: "temp_init", linkageName: "std.collections.anylist.AnyList.temp_init", scope: !4, file: !4, line: 55, type: !94, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!94 = !DISubroutineType(types: !95)
!95 = !{!8, !8, !13}
!96 = !DILocation(line: 56, column: 1, scope: !93)
!97 = !DILocalVariable(name: "self", arg: 1, scope: !93, file: !4, line: 55, type: !8)
!98 = !DILocation(line: 55, column: 31, scope: !93)
!99 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !93, file: !4, line: 55, type: !12)
!100 = !DILocation(line: 55, column: 42, scope: !93)
!101 = !DILocation(line: 396, column: 7, scope: !102, inlinedAt: !103)
!102 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !39, file: !39, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!103 = !DILocation(line: 57, column: 30, scope: !93)
!104 = !DILocation(line: 398, column: 3, scope: !105, inlinedAt: !103)
!105 = distinct !DILexicalBlock(scope: !102, file: !39, line: 397, column: 2)
!106 = !DILocation(line: 400, column: 9, scope: !102, inlinedAt: !103)
!107 = !DILocation(line: 57, column: 38, scope: !93)
!108 = !DILocation(line: 57, column: 9, scope: !93)
!109 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.anylist.AnyList.to_format", scope: !4, file: !4, line: 60, type: !110, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !114, !8, !115}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !113)
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !116, size: 64, align: 64, dwarfAddressSpace: 0)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !4, file: !4, line: 31, size: 384, align: 64, elements: !117, identifier: "std.io.Formatter")
!117 = !{!118, !119, !125}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !4, line: 33, baseType: !19, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !116, file: !4, line: 34, baseType: !120, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !4, file: !4, line: 23, baseType: !121, align: 8)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!122 = !DISubroutineType(types: !123)
!123 = !{!112, !19, !19, !124}
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !4, line: 35, baseType: !126, size: 256, align: 64, offset: 128)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !116, file: !4, line: 35, size: 256, align: 64, elements: !127)
!127 = !{!128, !130, !131, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !4, line: 37, baseType: !129, size: 32, align: 32)
!129 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !126, file: !4, line: 38, baseType: !129, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !126, file: !4, line: 39, baseType: !129, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !126, file: !4, line: 40, baseType: !12, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !126, file: !4, line: 41, baseType: !112, size: 64, align: 64, offset: 192)
!134 = !DILocation(line: 61, column: 1, scope: !109)
!135 = !DILocalVariable(name: "self", arg: 1, scope: !109, file: !4, line: 60, type: !8)
!136 = !DILocation(line: 60, column: 27, scope: !109)
!137 = !DILocalVariable(name: "formatter", arg: 2, scope: !109, file: !4, line: 60, type: !115)
!138 = !DILocation(line: 60, column: 45, scope: !109)
!139 = !DILocation(line: 62, column: 10, scope: !140)
!140 = distinct !DILexicalBlock(scope: !109, file: !4, line: 62, column: 2)
!141 = !DILocation(line: 65, column: 11, scope: !142)
!142 = distinct !DILexicalBlock(scope: !140, file: !4, line: 65, column: 4)
!143 = !DILocation(line: 67, column: 36, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !4, line: 67, column: 4)
!145 = !DILocation(line: 67, column: 49, scope: !144)
!146 = !DILocation(line: 67, column: 11, scope: !144)
!147 = !DILocalVariable(name: "n", scope: !148, file: !4, line: 69, type: !12, align: 8)
!148 = distinct !DILexicalBlock(scope: !140, file: !4, line: 69, column: 4)
!149 = !DILocation(line: 69, column: 8, scope: !148)
!150 = !DILocation(line: 69, column: 12, scope: !148)
!151 = !DILocalVariable(name: ".temp", scope: !152, file: !4, line: 70, type: !153, align: 8)
!152 = distinct !DILexicalBlock(scope: !148, file: !4, line: 70, column: 4)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any[]*", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !155, identifier: "any[]")
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !154, baseType: !23, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, baseType: !12, size: 64, align: 64, offset: 64)
!158 = !DILocation(line: 70, column: 26, scope: !152)
!159 = !DILocation(line: 70, column: 40, scope: !152)
!160 = !DILocalVariable(name: ".temp", scope: !152, file: !4, line: 70, type: !12, align: 8)
!161 = !DILocation(line: 70, column: 13, scope: !152)
!162 = !DILocalVariable(name: "i", scope: !163, file: !4, line: 70, type: !12, align: 8)
!163 = distinct !DILexicalBlock(scope: !152, file: !4, line: 71, column: 4)
!164 = !DILocation(line: 70, column: 13, scope: !163)
!165 = !DILocalVariable(name: "element", scope: !163, file: !4, line: 70, type: !24, align: 8)
!166 = !DILocation(line: 70, column: 16, scope: !163)
!167 = !DILocation(line: 70, column: 26, scope: !163)
!168 = !DILocation(line: 72, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !163, file: !4, line: 71, column: 4)
!170 = !DILocation(line: 72, column: 17, scope: !169)
!171 = !DILocation(line: 73, column: 5, scope: !169)
!172 = !DILocation(line: 73, column: 33, scope: !169)
!173 = !DILocation(line: 73, column: 10, scope: !169)
!174 = !DILocation(line: 75, column: 4, scope: !148)
!175 = !DILocation(line: 75, column: 9, scope: !148)
!176 = !DILocation(line: 76, column: 11, scope: !148)
!177 = distinct !DISubprogram(name: "to_new_string", linkageName: "std.collections.anylist.AnyList.to_new_string", scope: !4, file: !4, line: 80, type: !178, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !8, !16}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !182, identifier: "char[]")
!182 = !{!183, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !181, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !181, baseType: !12, size: 64, align: 64, offset: 64)
!186 = !DILocation(line: 81, column: 1, scope: !177)
!187 = !DILocalVariable(name: "self", arg: 1, scope: !177, file: !4, line: 80, type: !8)
!188 = !DILocation(line: 80, column: 33, scope: !177)
!189 = !DILocalVariable(name: "allocator", arg: 2, scope: !177, file: !4, line: 80, type: !16)
!190 = !DILocation(line: 80, column: 50, scope: !177)
!191 = !DILocation(line: 82, column: 31, scope: !177)
!192 = !DILocation(line: 82, column: 48, scope: !177)
!193 = !DILocation(line: 392, column: 27, scope: !194, inlinedAt: !195)
!194 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !39, file: !39, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!195 = !DILocation(line: 82, column: 72, scope: !177)
!196 = !DILocation(line: 82, column: 17, scope: !177)
!197 = distinct !DISubprogram(name: "to_string", linkageName: "std.collections.anylist.AnyList.to_string", scope: !4, file: !4, line: 86, type: !178, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!198 = !DILocation(line: 87, column: 1, scope: !197)
!199 = !DILocalVariable(name: "self", arg: 1, scope: !197, file: !4, line: 86, type: !8)
!200 = !DILocation(line: 86, column: 29, scope: !197)
!201 = !DILocalVariable(name: "allocator", arg: 2, scope: !197, file: !4, line: 86, type: !16)
!202 = !DILocation(line: 86, column: 46, scope: !197)
!203 = !DILocation(line: 88, column: 31, scope: !197)
!204 = !DILocation(line: 88, column: 17, scope: !197)
!205 = distinct !DISubprogram(name: "to_tstring", linkageName: "std.collections.anylist.AnyList.to_tstring", scope: !4, file: !4, line: 91, type: !206, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!206 = !DISubroutineType(types: !207)
!207 = !{!180, !8}
!208 = !DILocation(line: 91, column: 40, scope: !205)
!209 = !DILocalVariable(name: "self", arg: 1, scope: !205, file: !4, line: 91, type: !8)
!210 = !DILocation(line: 91, column: 30, scope: !205)
!211 = !DILocation(line: 91, column: 63, scope: !205)
!212 = !DILocation(line: 91, column: 48, scope: !205)
!213 = distinct !DISubprogram(name: "append_internal", linkageName: "std.collections.anylist.AnyList.append_internal", scope: !4, file: !4, line: 102, type: !214, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !28)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !8, !24}
!216 = !DILocation(line: 103, column: 1, scope: !213)
!217 = !DILocalVariable(name: "self", arg: 1, scope: !213, file: !4, line: 102, type: !8)
!218 = !DILocation(line: 102, column: 33, scope: !213)
!219 = !DILocalVariable(name: "element", arg: 2, scope: !213, file: !4, line: 102, type: !24)
!220 = !DILocation(line: 102, column: 44, scope: !213)
!221 = !DILocation(line: 494, column: 52, scope: !222, inlinedAt: !223)
!222 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !4, file: !4, line: 494, scopeLine: 494, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!223 = !DILocation(line: 104, column: 2, scope: !213)
!224 = !DILocation(line: 105, column: 2, scope: !213)
!225 = !DILocation(line: 105, column: 15, scope: !213)
!226 = !DILocation(line: 105, column: 30, scope: !213)
!227 = distinct !DISubprogram(name: "free_element", linkageName: "std.collections.anylist.AnyList.free_element", scope: !4, file: !4, line: 111, type: !214, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!228 = !DILocation(line: 112, column: 1, scope: !227)
!229 = !DILocalVariable(name: "self", arg: 1, scope: !227, file: !4, line: 111, type: !8)
!230 = !DILocation(line: 111, column: 30, scope: !227)
!231 = !DILocalVariable(name: "element", arg: 2, scope: !227, file: !4, line: 111, type: !24)
!232 = !DILocation(line: 111, column: 41, scope: !227)
