; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"char[]" = type { ptr, i64 }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion = type { <4 x float> }
%Quaternion.5 = type { <4 x double> }

$"std.math.vector.float[<2>].towards" = comdat any

$"std.math.vector.float[<3>].towards" = comdat any

$"std.math.vector.float[<4>].towards" = comdat any

$"std.math.vector.double[<2>].towards" = comdat any

$"std.math.vector.double[<3>].towards" = comdat any

$"std.math.vector.double[<4>].towards" = comdat any

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any

$"std.math.vector.double[<3>].transform" = comdat any


!563 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!564 = !DILocation(line: 671, column: 82, scope: !563, inlinedAt: !558)
!565 = !DILocalVariable(name: "d11", scope: !534, file: !4, line: 230, type: !155, align: 8)
!566 = !DILocation(line: 230, column: 6, scope: !534, inlinedAt: !536)
!567 = !DILocation(line: 686, column: 64, scope: !568, inlinedAt: !569)
!568 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!569 = !DILocation(line: 230, column: 12, scope: !534, inlinedAt: !536)
!570 = !DILocation(line: 686, column: 68, scope: !568, inlinedAt: !569)
!571 = !DILocation(line: 671, column: 85, scope: !572, inlinedAt: !567)
!572 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!573 = !DILocation(line: 671, column: 82, scope: !572, inlinedAt: !567)
!574 = !DILocalVariable(name: "d20", scope: !534, file: !4, line: 231, type: !155, align: 8)
!575 = !DILocation(line: 231, column: 6, scope: !534, inlinedAt: !536)
!576 = !DILocation(line: 686, column: 64, scope: !577, inlinedAt: !578)
!577 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!578 = !DILocation(line: 231, column: 12, scope: !534, inlinedAt: !536)
!579 = !DILocation(line: 686, column: 68, scope: !577, inlinedAt: !578)
!580 = !DILocation(line: 671, column: 85, scope: !581, inlinedAt: !576)
!581 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!582 = !DILocation(line: 671, column: 82, scope: !581, inlinedAt: !576)
!583 = !DILocalVariable(name: "d21", scope: !534, file: !4, line: 232, type: !155, align: 8)
!584 = !DILocation(line: 232, column: 6, scope: !534, inlinedAt: !536)
!585 = !DILocation(line: 686, column: 64, scope: !586, inlinedAt: !587)
!586 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!587 = !DILocation(line: 232, column: 12, scope: !534, inlinedAt: !536)
!588 = !DILocation(line: 686, column: 68, scope: !586, inlinedAt: !587)
!589 = !DILocation(line: 671, column: 85, scope: !590, inlinedAt: !585)
!590 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!591 = !DILocation(line: 671, column: 82, scope: !590, inlinedAt: !585)
!592 = !DILocalVariable(name: "denom", scope: !534, file: !4, line: 233, type: !155, align: 8)
!593 = !DILocation(line: 233, column: 6, scope: !534, inlinedAt: !536)
!594 = !DILocation(line: 233, column: 14, scope: !534, inlinedAt: !536)
!595 = !DILocation(line: 233, column: 20, scope: !534, inlinedAt: !536)
!596 = !DILocation(line: 233, column: 26, scope: !534, inlinedAt: !536)
!597 = !DILocation(line: 233, column: 32, scope: !534, inlinedAt: !536)
!598 = !DILocalVariable(name: "y", scope: !534, file: !4, line: 234, type: !155, align: 8)
!599 = !DILocation(line: 234, column: 6, scope: !534, inlinedAt: !536)
!600 = !DILocation(line: 234, column: 11, scope: !534, inlinedAt: !536)
!601 = !DILocation(line: 234, column: 17, scope: !534, inlinedAt: !536)
!602 = !DILocation(line: 234, column: 23, scope: !534, inlinedAt: !536)
!603 = !DILocation(line: 234, column: 29, scope: !534, inlinedAt: !536)
!604 = !DILocation(line: 234, column: 36, scope: !534, inlinedAt: !536)
!605 = !DILocalVariable(name: "z", scope: !534, file: !4, line: 235, type: !155, align: 8)
!606 = !DILocation(line: 235, column: 6, scope: !534, inlinedAt: !536)
!607 = !DILocation(line: 235, column: 11, scope: !534, inlinedAt: !536)
!608 = !DILocation(line: 235, column: 17, scope: !534, inlinedAt: !536)
!609 = !DILocation(line: 235, column: 23, scope: !534, inlinedAt: !536)
!610 = !DILocation(line: 235, column: 29, scope: !534, inlinedAt: !536)
!611 = !DILocation(line: 235, column: 36, scope: !534, inlinedAt: !536)
!612 = !DILocation(line: 236, column: 26, scope: !534, inlinedAt: !536)
!613 = !DILocation(line: 236, column: 22, scope: !534, inlinedAt: !536)
!614 = !DILocation(line: 236, column: 30, scope: !534, inlinedAt: !536)
!615 = !DILocation(line: 236, column: 9, scope: !534, inlinedAt: !536)
!616 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !4, file: !4, line: 57, type: !617, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!617 = !DISubroutineType(types: !618)
!618 = !{!59, !60, !619}
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !4, file: !4, line: 31, size: 512, align: 32, elements: !620, identifier: "std_math_matrix$float$.Matrix4x4")
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, scope: !619, file: !4, line: 33, baseType: !622, size: 512, align: 32)
!622 = !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !4, line: 33, size: 512, align: 32, elements: !623)
!623 = !{!624, !644}
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !622, file: !4, line: 35, baseType: !625, size: 512, align: 32)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !622, file: !4, line: 35, size: 512, align: 32, elements: !626)
!626 = !{!627, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !625, file: !4, line: 37, baseType: !628, size: 32, align: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !4, file: !4, line: 103, baseType: !10, align: 4)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !625, file: !4, line: 37, baseType: !628, size: 32, align: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !625, file: !4, line: 37, baseType: !628, size: 32, align: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !625, file: !4, line: 37, baseType: !628, size: 32, align: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !625, file: !4, line: 38, baseType: !628, size: 32, align: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !625, file: !4, line: 38, baseType: !628, size: 32, align: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !625, file: !4, line: 38, baseType: !628, size: 32, align: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !625, file: !4, line: 38, baseType: !628, size: 32, align: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !625, file: !4, line: 39, baseType: !628, size: 32, align: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !625, file: !4, line: 39, baseType: !628, size: 32, align: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !625, file: !4, line: 39, baseType: !628, size: 32, align: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !625, file: !4, line: 39, baseType: !628, size: 32, align: 32, offset: 352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !625, file: !4, line: 40, baseType: !628, size: 32, align: 32, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !625, file: !4, line: 40, baseType: !628, size: 32, align: 32, offset: 416)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !625, file: !4, line: 40, baseType: !628, size: 32, align: 32, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !625, file: !4, line: 40, baseType: !628, size: 32, align: 32, offset: 480)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !622, file: !4, line: 42, baseType: !645, size: 512, align: 32)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 32, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 16, lowerBound: 0)
!648 = !DILocalVariable(name: "self", arg: 1, scope: !616, file: !4, line: 57, type: !59)
!649 = !DILocation(line: 57, column: 26, scope: !616)
!650 = !DILocalVariable(name: "mat", arg: 2, scope: !616, file: !4, line: 57, type: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !4, file: !4, line: 107, baseType: !619, align: 4)
!652 = !DILocation(line: 57, column: 41, scope: !616)
!653 = !DILocation(line: 149, column: 3, scope: !654, inlinedAt: !655)
!654 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !4, file: !4, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!655 = !DILocation(line: 57, column: 49, scope: !616)
!656 = !DILocation(line: 149, column: 13, scope: !654, inlinedAt: !655)
!657 = !DILocation(line: 149, column: 15, scope: !654, inlinedAt: !655)
!658 = !DILocation(line: 149, column: 20, scope: !654, inlinedAt: !655)
!659 = !DILocation(line: 149, column: 30, scope: !654, inlinedAt: !655)
!660 = !DILocation(line: 149, column: 32, scope: !654, inlinedAt: !655)
!661 = !DILocation(line: 149, column: 37, scope: !654, inlinedAt: !655)
!662 = !DILocation(line: 149, column: 47, scope: !654, inlinedAt: !655)
!663 = !DILocation(line: 149, column: 49, scope: !654, inlinedAt: !655)
!664 = !DILocation(line: 149, column: 54, scope: !654, inlinedAt: !655)
!665 = !DILocation(line: 148, column: 9, scope: !654, inlinedAt: !655)
!666 = !DILocation(line: 150, column: 3, scope: !654, inlinedAt: !655)
!667 = !DILocation(line: 150, column: 13, scope: !654, inlinedAt: !655)
!668 = !DILocation(line: 150, column: 15, scope: !654, inlinedAt: !655)
!669 = !DILocation(line: 150, column: 20, scope: !654, inlinedAt: !655)
!670 = !DILocation(line: 150, column: 30, scope: !654, inlinedAt: !655)
!671 = !DILocation(line: 150, column: 32, scope: !654, inlinedAt: !655)
!672 = !DILocation(line: 150, column: 37, scope: !654, inlinedAt: !655)
!673 = !DILocation(line: 150, column: 47, scope: !654, inlinedAt: !655)
!674 = !DILocation(line: 150, column: 49, scope: !654, inlinedAt: !655)
!675 = !DILocation(line: 150, column: 54, scope: !654, inlinedAt: !655)
!676 = !DILocation(line: 151, column: 3, scope: !654, inlinedAt: !655)
!677 = !DILocation(line: 151, column: 13, scope: !654, inlinedAt: !655)
!678 = !DILocation(line: 151, column: 15, scope: !654, inlinedAt: !655)
!679 = !DILocation(line: 151, column: 20, scope: !654, inlinedAt: !655)
!680 = !DILocation(line: 151, column: 30, scope: !654, inlinedAt: !655)
!681 = !DILocation(line: 151, column: 32, scope: !654, inlinedAt: !655)
!682 = !DILocation(line: 151, column: 37, scope: !654, inlinedAt: !655)
!683 = !DILocation(line: 151, column: 47, scope: !654, inlinedAt: !655)
!684 = !DILocation(line: 151, column: 49, scope: !654, inlinedAt: !655)
!685 = !DILocation(line: 151, column: 54, scope: !654, inlinedAt: !655)
!686 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !4, file: !4, line: 58, type: !687, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!687 = !DISubroutineType(types: !688)
!688 = !{!199, !200, !689}
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !4, file: !4, line: 31, size: 1024, align: 64, elements: !690, identifier: "std_math_matrix$double$.Matrix4x4")
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !689, file: !4, line: 33, baseType: !692, size: 1024, align: 64)
!692 = !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !4, line: 33, size: 1024, align: 64, elements: !693)
!693 = !{!694, !714}
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !4, line: 35, baseType: !695, size: 1024, align: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !692, file: !4, line: 35, size: 1024, align: 64, elements: !696)
!696 = !{!697, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !695, file: !4, line: 37, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !4, file: !4, line: 104, baseType: !155, align: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !695, file: !4, line: 37, baseType: !698, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !695, file: !4, line: 37, baseType: !698, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !695, file: !4, line: 37, baseType: !698, size: 64, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !695, file: !4, line: 38, baseType: !698, size: 64, align: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !695, file: !4, line: 38, baseType: !698, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !695, file: !4, line: 38, baseType: !698, size: 64, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !695, file: !4, line: 38, baseType: !698, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !695, file: !4, line: 39, baseType: !698, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !695, file: !4, line: 39, baseType: !698, size: 64, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !695, file: !4, line: 39, baseType: !698, size: 64, align: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !695, file: !4, line: 39, baseType: !698, size: 64, align: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !695, file: !4, line: 40, baseType: !698, size: 64, align: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !695, file: !4, line: 40, baseType: !698, size: 64, align: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !695, file: !4, line: 40, baseType: !698, size: 64, align: 64, offset: 896)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !695, file: !4, line: 40, baseType: !698, size: 64, align: 64, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !692, file: !4, line: 42, baseType: !715, size: 1024, align: 64)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1024, align: 64, elements: !646)
!716 = !DILocalVariable(name: "self", arg: 1, scope: !686, file: !4, line: 58, type: !199)
!717 = !DILocation(line: 58, column: 24, scope: !686)
!718 = !DILocalVariable(name: "mat", arg: 2, scope: !686, file: !4, line: 58, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !4, file: !4, line: 108, baseType: !689, align: 8)
!720 = !DILocation(line: 58, column: 38, scope: !686)
!721 = !DILocation(line: 149, column: 3, scope: !722, inlinedAt: !723)
!722 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !4, file: !4, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!723 = !DILocation(line: 58, column: 46, scope: !686)
!724 = !DILocation(line: 149, column: 13, scope: !722, inlinedAt: !723)
!725 = !DILocation(line: 149, column: 15, scope: !722, inlinedAt: !723)
!726 = !DILocation(line: 149, column: 20, scope: !722, inlinedAt: !723)
!727 = !DILocation(line: 149, column: 30, scope: !722, inlinedAt: !723)
!728 = !DILocation(line: 149, column: 32, scope: !722, inlinedAt: !723)
!729 = !DILocation(line: 149, column: 37, scope: !722, inlinedAt: !723)
!730 = !DILocation(line: 149, column: 47, scope: !722, inlinedAt: !723)
!731 = !DILocation(line: 149, column: 49, scope: !722, inlinedAt: !723)
!732 = !DILocation(line: 149, column: 54, scope: !722, inlinedAt: !723)
!733 = !DILocation(line: 148, column: 9, scope: !722, inlinedAt: !723)
!734 = !DILocation(line: 150, column: 3, scope: !722, inlinedAt: !723)
!735 = !DILocation(line: 150, column: 13, scope: !722, inlinedAt: !723)
!736 = !DILocation(line: 150, column: 15, scope: !722, inlinedAt: !723)
!737 = !DILocation(line: 150, column: 20, scope: !722, inlinedAt: !723)
!738 = !DILocation(line: 150, column: 30, scope: !722, inlinedAt: !723)
!739 = !DILocation(line: 150, column: 32, scope: !722, inlinedAt: !723)
!740 = !DILocation(line: 150, column: 37, scope: !722, inlinedAt: !723)
!741 = !DILocation(line: 150, column: 47, scope: !722, inlinedAt: !723)
!742 = !DILocation(line: 150, column: 49, scope: !722, inlinedAt: !723)
!743 = !DILocation(line: 150, column: 54, scope: !722, inlinedAt: !723)
!744 = !DILocation(line: 151, column: 3, scope: !722, inlinedAt: !723)
!745 = !DILocation(line: 151, column: 13, scope: !722, inlinedAt: !723)
!746 = !DILocation(line: 151, column: 15, scope: !722, inlinedAt: !723)
!747 = !DILocation(line: 151, column: 20, scope: !722, inlinedAt: !723)
!748 = !DILocation(line: 151, column: 30, scope: !722, inlinedAt: !723)
!749 = !DILocation(line: 151, column: 32, scope: !722, inlinedAt: !723)
!750 = !DILocation(line: 151, column: 37, scope: !722, inlinedAt: !723)
!751 = !DILocation(line: 151, column: 47, scope: !722, inlinedAt: !723)
!752 = !DILocation(line: 151, column: 49, scope: !722, inlinedAt: !723)
!753 = !DILocation(line: 151, column: 54, scope: !722, inlinedAt: !723)
!754 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !4, file: !4, line: 60, type: !755, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!755 = !DISubroutineType(types: !756)
!756 = !{!10, !60, !60}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !754, file: !4, line: 60, type: !59)
!758 = !DILocation(line: 60, column: 22, scope: !754)
!759 = !DILocalVariable(name: "v2", arg: 2, scope: !754, file: !4, line: 60, type: !59)
!760 = !DILocation(line: 60, column: 34, scope: !754)
!761 = !DILocalVariable(name: "len", scope: !762, file: !4, line: 158, type: !10, align: 4)
!762 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !4, file: !4, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !13)
!763 = !DILocation(line: 158, column: 6, scope: !762, inlinedAt: !764)
!764 = !DILocation(line: 60, column: 41, scope: !754)
!765 = !DILocation(line: 158, column: 12, scope: !762, inlinedAt: !764)
!766 = !DILocation(line: 643, column: 60, scope: !767, inlinedAt: !768)
!767 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!768 = !DILocation(line: 644, column: 55, scope: !769, inlinedAt: !765)
!769 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !30, file: !30, line: 644, scopeLine: 644, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!770 = !DILocation(line: 643, column: 64, scope: !767, inlinedAt: !768)
!771 = !DILocation(line: 628, column: 81, scope: !772, inlinedAt: !766)
!772 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!773 = !DILocation(line: 628, column: 78, scope: !772, inlinedAt: !766)
!774 = !DILocalVariable(name: "dot", scope: !762, file: !4, line: 159, type: !10, align: 4)
!775 = !DILocation(line: 159, column: 6, scope: !762, inlinedAt: !764)
!776 = !DILocation(line: 643, column: 60, scope: !777, inlinedAt: !778)
!777 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!778 = !DILocation(line: 159, column: 12, scope: !762, inlinedAt: !764)
!779 = !DILocation(line: 643, column: 64, scope: !777, inlinedAt: !778)
!780 = !DILocation(line: 628, column: 81, scope: !781, inlinedAt: !776)
!781 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!782 = !DILocation(line: 628, column: 78, scope: !781, inlinedAt: !776)
!783 = !DILocation(line: 154, column: 21, scope: !784, inlinedAt: !785)
!784 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !30, file: !30, line: 151, scopeLine: 151, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!785 = !DILocation(line: 160, column: 15, scope: !762, inlinedAt: !764)
!786 = !DILocation(line: 154, column: 10, scope: !784, inlinedAt: !785)
!787 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !4, file: !4, line: 61, type: !788, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!788 = !DISubroutineType(types: !789)
!789 = !{!155, !200, !200}
!790 = !DILocalVariable(name: "self", arg: 1, scope: !787, file: !4, line: 61, type: !199)
!791 = !DILocation(line: 61, column: 22, scope: !787)
!792 = !DILocalVariable(name: "v2", arg: 2, scope: !787, file: !4, line: 61, type: !199)
!793 = !DILocation(line: 61, column: 33, scope: !787)
!794 = !DILocalVariable(name: "len", scope: !795, file: !4, line: 158, type: !155, align: 8)
!795 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !4, file: !4, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !13)
!796 = !DILocation(line: 158, column: 6, scope: !795, inlinedAt: !797)
!797 = !DILocation(line: 61, column: 40, scope: !787)
!798 = !DILocation(line: 158, column: 12, scope: !795, inlinedAt: !797)
!799 = !DILocation(line: 686, column: 64, scope: !800, inlinedAt: !801)
!800 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!801 = !DILocation(line: 687, column: 58, scope: !802, inlinedAt: !798)
!802 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !30, file: !30, line: 687, scopeLine: 687, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!803 = !DILocation(line: 686, column: 68, scope: !800, inlinedAt: !801)
!804 = !DILocation(line: 671, column: 85, scope: !805, inlinedAt: !799)
!805 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!806 = !DILocation(line: 671, column: 82, scope: !805, inlinedAt: !799)
!807 = !DILocalVariable(name: "dot", scope: !795, file: !4, line: 159, type: !155, align: 8)
!808 = !DILocation(line: 159, column: 6, scope: !795, inlinedAt: !797)
!809 = !DILocation(line: 686, column: 64, scope: !810, inlinedAt: !811)
!810 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!811 = !DILocation(line: 159, column: 12, scope: !795, inlinedAt: !797)
!812 = !DILocation(line: 686, column: 68, scope: !810, inlinedAt: !811)
!813 = !DILocation(line: 671, column: 85, scope: !814, inlinedAt: !809)
!814 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!815 = !DILocation(line: 671, column: 82, scope: !814, inlinedAt: !809)
!816 = !DILocation(line: 156, column: 20, scope: !817, inlinedAt: !818)
!817 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !30, file: !30, line: 151, scopeLine: 151, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!818 = !DILocation(line: 160, column: 15, scope: !795, inlinedAt: !797)
!819 = !DILocation(line: 156, column: 10, scope: !817, inlinedAt: !818)
!820 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !4, file: !4, line: 63, type: !57, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!821 = !DILocalVariable(name: "self", arg: 1, scope: !820, file: !4, line: 63, type: !59)
!822 = !DILocation(line: 63, column: 24, scope: !820)
!823 = !DILocalVariable(name: "n", arg: 2, scope: !820, file: !4, line: 63, type: !59)
!824 = !DILocation(line: 63, column: 36, scope: !820)
!825 = !DILocalVariable(name: "r", arg: 3, scope: !820, file: !4, line: 63, type: !10)
!826 = !DILocation(line: 63, column: 45, scope: !820)
!827 = !DILocalVariable(name: "dot", scope: !828, file: !4, line: 241, type: !10, align: 4)
!828 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !4, file: !4, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !13)
!829 = !DILocation(line: 241, column: 6, scope: !828, inlinedAt: !830)
!830 = !DILocation(line: 63, column: 51, scope: !820)
!831 = !DILocation(line: 643, column: 60, scope: !832, inlinedAt: !833)
!832 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 643, scopeLine: 643, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!833 = !DILocation(line: 241, column: 12, scope: !828, inlinedAt: !830)
!834 = !DILocation(line: 643, column: 64, scope: !832, inlinedAt: !833)
!835 = !DILocation(line: 628, column: 81, scope: !836, inlinedAt: !831)
!836 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 628, scopeLine: 628, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!837 = !DILocation(line: 628, column: 78, scope: !836, inlinedAt: !831)
!838 = !DILocalVariable(name: "d", scope: !828, file: !4, line: 242, type: !10, align: 4)
!839 = !DILocation(line: 242, column: 6, scope: !828, inlinedAt: !830)
!840 = !DILocation(line: 242, column: 14, scope: !828, inlinedAt: !830)
!841 = !DILocation(line: 242, column: 18, scope: !828, inlinedAt: !830)
!842 = !DILocation(line: 242, column: 27, scope: !828, inlinedAt: !830)
!843 = !DILocation(line: 242, column: 33, scope: !828, inlinedAt: !830)
!844 = !DILocation(line: 242, column: 23, scope: !828, inlinedAt: !830)
!845 = !DILocation(line: 242, column: 10, scope: !828, inlinedAt: !830)
!846 = !DILocation(line: 244, column: 9, scope: !828, inlinedAt: !830)
!847 = !DILocation(line: 244, column: 17, scope: !828, inlinedAt: !830)
!848 = !DILocation(line: 244, column: 21, scope: !828, inlinedAt: !830)
!849 = !DILocation(line: 244, column: 25, scope: !828, inlinedAt: !830)
!850 = !DILocation(line: 244, column: 30, scope: !828, inlinedAt: !830)
!851 = !DILocation(line: 244, column: 34, scope: !828, inlinedAt: !830)
!852 = !DILocation(line: 25, column: 10, scope: !853, inlinedAt: !854)
!853 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !48, file: !48, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!854 = !DILocation(line: 515, column: 33, scope: !855, inlinedAt: !856)
!855 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !30, file: !30, line: 515, scopeLine: 515, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!856 = !DILocation(line: 244, column: 46, scope: !828, inlinedAt: !830)
!857 = !DILocation(line: 244, column: 57, scope: !828, inlinedAt: !830)
!858 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !4, file: !4, line: 64, type: !197, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!859 = !DILocalVariable(name: "self", arg: 1, scope: !858, file: !4, line: 64, type: !199)
!860 = !DILocation(line: 64, column: 22, scope: !858)
!861 = !DILocalVariable(name: "n", arg: 2, scope: !858, file: !4, line: 64, type: !199)
!862 = !DILocation(line: 64, column: 33, scope: !858)
!863 = !DILocalVariable(name: "r", arg: 3, scope: !858, file: !4, line: 64, type: !155)
!864 = !DILocation(line: 64, column: 43, scope: !858)
!865 = !DILocalVariable(name: "dot", scope: !866, file: !4, line: 241, type: !155, align: 8)
!866 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !4, file: !4, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !13)
!867 = !DILocation(line: 241, column: 6, scope: !866, inlinedAt: !868)
!868 = !DILocation(line: 64, column: 49, scope: !858)
!869 = !DILocation(line: 686, column: 64, scope: !870, inlinedAt: !871)
!870 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !30, file: !30, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!871 = !DILocation(line: 241, column: 12, scope: !866, inlinedAt: !868)
!872 = !DILocation(line: 686, column: 68, scope: !870, inlinedAt: !871)
!873 = !DILocation(line: 671, column: 85, scope: !874, inlinedAt: !869)
!874 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !30, file: !30, line: 671, scopeLine: 671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!875 = !DILocation(line: 671, column: 82, scope: !874, inlinedAt: !869)
!876 = !DILocalVariable(name: "d", scope: !866, file: !4, line: 242, type: !155, align: 8)
!877 = !DILocation(line: 242, column: 6, scope: !866, inlinedAt: !868)
!878 = !DILocation(line: 242, column: 14, scope: !866, inlinedAt: !868)
!879 = !DILocation(line: 242, column: 18, scope: !866, inlinedAt: !868)
!880 = !DILocation(line: 242, column: 27, scope: !866, inlinedAt: !868)
!881 = !DILocation(line: 242, column: 33, scope: !866, inlinedAt: !868)
!882 = !DILocation(line: 242, column: 23, scope: !866, inlinedAt: !868)
!883 = !DILocation(line: 242, column: 10, scope: !866, inlinedAt: !868)
!884 = !DILocation(line: 244, column: 9, scope: !866, inlinedAt: !868)
!885 = !DILocation(line: 244, column: 17, scope: !866, inlinedAt: !868)
!886 = !DILocation(line: 244, column: 21, scope: !866, inlinedAt: !868)
!887 = !DILocation(line: 244, column: 25, scope: !866, inlinedAt: !868)
!888 = !DILocation(line: 244, column: 30, scope: !866, inlinedAt: !868)
!889 = !DILocation(line: 244, column: 34, scope: !866, inlinedAt: !868)
!890 = !DILocation(line: 25, column: 10, scope: !891, inlinedAt: !892)
!891 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !48, file: !48, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!892 = !DILocation(line: 515, column: 33, scope: !893, inlinedAt: !894)
!893 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !30, file: !30, line: 515, scopeLine: 515, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!894 = !DILocation(line: 244, column: 46, scope: !866, inlinedAt: !868)
!895 = !DILocation(line: 244, column: 57, scope: !866, inlinedAt: !868)
!896 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !4, file: !4, line: 72, type: !897, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!897 = !DISubroutineType(types: !898)
!898 = !{!59, !60, !899}
!899 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !4, file: !4, line: 3, size: 128, align: 128, elements: !900, identifier: "std_math_quaternion$float$.Quaternion")
!900 = !{!901, !909}
!901 = !DIDerivedType(tag: DW_TAG_member, scope: !899, file: !4, line: 5, baseType: !902, size: 128, align: 128)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !899, file: !4, line: 5, size: 128, align: 128, elements: !903)
!903 = !{!904, !906, !907, !908}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !902, file: !4, line: 7, baseType: !905, size: 32, align: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !4, file: !4, line: 98, baseType: !10, align: 4)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !902, file: !4, line: 7, baseType: !905, size: 32, align: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !902, file: !4, line: 7, baseType: !905, size: 32, align: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !902, file: !4, line: 7, baseType: !905, size: 32, align: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !899, file: !4, line: 9, baseType: !107, size: 128, align: 128)
!910 = !DILocalVariable(name: "self", arg: 1, scope: !896, file: !4, line: 72, type: !59)
!911 = !DILocation(line: 72, column: 28, scope: !896)
!912 = !DILocalVariable(name: "q", arg: 2, scope: !896, file: !4, line: 72, type: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !4, file: !4, line: 98, baseType: !899, align: 16)
!914 = !DILocation(line: 72, column: 46, scope: !896)
!915 = !DILocation(line: 173, column: 3, scope: !916, inlinedAt: !917)
!916 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !4, file: !4, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!917 = !DILocation(line: 72, column: 52, scope: !896)
!918 = !DILocation(line: 173, column: 5, scope: !916, inlinedAt: !917)
!919 = !DILocation(line: 173, column: 11, scope: !916, inlinedAt: !917)
!920 = !DILocation(line: 173, column: 17, scope: !916, inlinedAt: !917)
!921 = !DILocation(line: 173, column: 23, scope: !916, inlinedAt: !917)
!922 = !DILocation(line: 173, column: 29, scope: !916, inlinedAt: !917)
!923 = !DILocation(line: 173, column: 35, scope: !916, inlinedAt: !917)
!924 = !DILocation(line: 173, column: 41, scope: !916, inlinedAt: !917)
!925 = !DILocation(line: 173, column: 47, scope: !916, inlinedAt: !917)
!926 = !DILocation(line: 173, column: 53, scope: !916, inlinedAt: !917)
!927 = !DILocation(line: 174, column: 6, scope: !916, inlinedAt: !917)
!928 = !DILocation(line: 174, column: 8, scope: !916, inlinedAt: !917)
!929 = !DILocation(line: 174, column: 18, scope: !916, inlinedAt: !917)
!930 = !DILocation(line: 174, column: 14, scope: !916, inlinedAt: !917)
!931 = !DILocation(line: 174, column: 24, scope: !916, inlinedAt: !917)
!932 = !DILocation(line: 174, column: 34, scope: !916, inlinedAt: !917)
!933 = !DILocation(line: 174, column: 30, scope: !916, inlinedAt: !917)
!934 = !DILocation(line: 174, column: 40, scope: !916, inlinedAt: !917)
!935 = !DILocation(line: 175, column: 6, scope: !916, inlinedAt: !917)
!936 = !DILocation(line: 175, column: 8, scope: !916, inlinedAt: !917)
!937 = !DILocation(line: 175, column: 18, scope: !916, inlinedAt: !917)
!938 = !DILocation(line: 175, column: 14, scope: !916, inlinedAt: !917)
!939 = !DILocation(line: 175, column: 24, scope: !916, inlinedAt: !917)
!940 = !DILocation(line: 175, column: 34, scope: !916, inlinedAt: !917)
!941 = !DILocation(line: 175, column: 30, scope: !916, inlinedAt: !917)
!942 = !DILocation(line: 175, column: 40, scope: !916, inlinedAt: !917)
!943 = !DILocation(line: 172, column: 9, scope: !916, inlinedAt: !917)
!944 = !DILocation(line: 176, column: 3, scope: !916, inlinedAt: !917)
!945 = !DILocation(line: 176, column: 5, scope: !916, inlinedAt: !917)
!946 = !DILocation(line: 176, column: 15, scope: !916, inlinedAt: !917)
!947 = !DILocation(line: 176, column: 11, scope: !916, inlinedAt: !917)
!948 = !DILocation(line: 176, column: 21, scope: !916, inlinedAt: !917)
!949 = !DILocation(line: 176, column: 31, scope: !916, inlinedAt: !917)
!950 = !DILocation(line: 176, column: 27, scope: !916, inlinedAt: !917)
!951 = !DILocation(line: 176, column: 37, scope: !916, inlinedAt: !917)
!952 = !DILocation(line: 177, column: 6, scope: !916, inlinedAt: !917)
!953 = !DILocation(line: 177, column: 8, scope: !916, inlinedAt: !917)
!954 = !DILocation(line: 177, column: 14, scope: !916, inlinedAt: !917)
!955 = !DILocation(line: 177, column: 20, scope: !916, inlinedAt: !917)
!956 = !DILocation(line: 177, column: 26, scope: !916, inlinedAt: !917)
!957 = !DILocation(line: 177, column: 32, scope: !916, inlinedAt: !917)
!958 = !DILocation(line: 177, column: 38, scope: !916, inlinedAt: !917)
!959 = !DILocation(line: 177, column: 44, scope: !916, inlinedAt: !917)
!960 = !DILocation(line: 177, column: 50, scope: !916, inlinedAt: !917)
!961 = !DILocation(line: 177, column: 56, scope: !916, inlinedAt: !917)
!962 = !DILocation(line: 178, column: 6, scope: !916, inlinedAt: !917)
!963 = !DILocation(line: 178, column: 8, scope: !916, inlinedAt: !917)
!964 = !DILocation(line: 178, column: 19, scope: !916, inlinedAt: !917)
!965 = !DILocation(line: 178, column: 14, scope: !916, inlinedAt: !917)
!966 = !DILocation(line: 178, column: 25, scope: !916, inlinedAt: !917)
!967 = !DILocation(line: 178, column: 35, scope: !916, inlinedAt: !917)
!968 = !DILocation(line: 178, column: 31, scope: !916, inlinedAt: !917)
!969 = !DILocation(line: 178, column: 41, scope: !916, inlinedAt: !917)
!970 = !DILocation(line: 179, column: 3, scope: !916, inlinedAt: !917)
!971 = !DILocation(line: 179, column: 5, scope: !916, inlinedAt: !917)
!972 = !DILocation(line: 179, column: 16, scope: !916, inlinedAt: !917)
!973 = !DILocation(line: 179, column: 11, scope: !916, inlinedAt: !917)
!974 = !DILocation(line: 179, column: 22, scope: !916, inlinedAt: !917)
!975 = !DILocation(line: 179, column: 32, scope: !916, inlinedAt: !917)
!976 = !DILocation(line: 179, column: 28, scope: !916, inlinedAt: !917)
!977 = !DILocation(line: 179, column: 38, scope: !916, inlinedAt: !917)
!978 = !DILocation(line: 180, column: 6, scope: !916, inlinedAt: !917)
!979 = !DILocation(line: 180, column: 8, scope: !916, inlinedAt: !917)
!980 = !DILocation(line: 180, column: 18, scope: !916, inlinedAt: !917)
!981 = !DILocation(line: 180, column: 14, scope: !916, inlinedAt: !917)
!982 = !DILocation(line: 180, column: 24, scope: !916, inlinedAt: !917)
!983 = !DILocation(line: 180, column: 34, scope: !916, inlinedAt: !917)
!984 = !DILocation(line: 180, column: 30, scope: !916, inlinedAt: !917)
!985 = !DILocation(line: 180, column: 40, scope: !916, inlinedAt: !917)
!986 = !DILocation(line: 181, column: 6, scope: !916, inlinedAt: !917)
!987 = !DILocation(line: 181, column: 8, scope: !916, inlinedAt: !917)
!988 = !DILocation(line: 181, column: 14, scope: !916, inlinedAt: !917)
!989 = !DILocation(line: 181, column: 20, scope: !916, inlinedAt: !917)
!990 = !DILocation(line: 181, column: 26, scope: !916, inlinedAt: !917)
!991 = !DILocation(line: 181, column: 32, scope: !916, inlinedAt: !917)
!992 = !DILocation(line: 181, column: 38, scope: !916, inlinedAt: !917)
!993 = !DILocation(line: 181, column: 44, scope: !916, inlinedAt: !917)
!994 = !DILocation(line: 181, column: 50, scope: !916, inlinedAt: !917)
!995 = !DILocation(line: 181, column: 56, scope: !916, inlinedAt: !917)
!996 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !4, file: !4, line: 73, type: !997, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !13)
!997 = !DISubroutineType(types: !998)
!998 = !{!199, !200, !999}
!999 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !4, file: !4, line: 3, size: 256, align: 256, elements: !1000, identifier: "std_math_quaternion$double$.Quaternion")
!1000 = !{!1001, !1009}
!1001 = !DIDerivedType(tag: DW_TAG_member, scope: !999, file: !4, line: 5, baseType: !1002, size: 256, align: 256)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !999, file: !4, line: 5, size: 256, align: 256, elements: !1003)
!1003 = !{!1004, !1006, !1007, !1008}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1002, file: !4, line: 7, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !4, file: !4, line: 99, baseType: !155, align: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !1002, file: !4, line: 7, baseType: !1005, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1002, file: !4, line: 7, baseType: !1005, size: 64, align: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1002, file: !4, line: 7, baseType: !1005, size: 64, align: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !999, file: !4, line: 9, baseType: !245, size: 256, align: 256)
!1010 = !DILocalVariable(name: "self", arg: 1, scope: !996, file: !4, line: 73, type: !199)
!1011 = !DILocation(line: 73, column: 26, scope: !996)
!1012 = !DILocalVariable(name: "q", arg: 2, scope: !996, file: !4, line: 73, type: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !4, file: !4, line: 99, baseType: !999, align: 32)
!1014 = !DILocation(line: 73, column: 43, scope: !996)
!1015 = !DILocation(line: 173, column: 3, scope: !1016, inlinedAt: !1017)
!1016 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !4, file: !4, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3)
!1017 = !DILocation(line: 73, column: 49, scope: !996)
!1018 = !DILocation(line: 173, column: 5, scope: !1016, inlinedAt: !1017)
!1019 = !DILocation(line: 173, column: 11, scope: !1016, inlinedAt: !1017)
!1020 = !DILocation(line: 173, column: 17, scope: !1016, inlinedAt: !1017)
!1021 = !DILocation(line: 173, column: 23, scope: !1016, inlinedAt: !1017)
!1022 = !DILocation(line: 173, column: 29, scope: !1016, inlinedAt: !1017)
!1023 = !DILocation(line: 173, column: 35, scope: !1016, inlinedAt: !1017)
!1024 = !DILocation(line: 173, column: 41, scope: !1016, inlinedAt: !1017)
!1025 = !DILocation(line: 173, column: 47, scope: !1016, inlinedAt: !1017)
!1026 = !DILocation(line: 173, column: 53, scope: !1016, inlinedAt: !1017)
!1027 = !DILocation(line: 174, column: 6, scope: !1016, inlinedAt: !1017)
!1028 = !DILocation(line: 174, column: 8, scope: !1016, inlinedAt: !1017)
!1029 = !DILocation(line: 174, column: 18, scope: !1016, inlinedAt: !1017)
!1030 = !DILocation(line: 174, column: 14, scope: !1016, inlinedAt: !1017)
!1031 = !DILocation(line: 174, column: 24, scope: !1016, inlinedAt: !1017)
!1032 = !DILocation(line: 174, column: 34, scope: !1016, inlinedAt: !1017)
!1033 = !DILocation(line: 174, column: 30, scope: !1016, inlinedAt: !1017)
!1034 = !DILocation(line: 174, column: 40, scope: !1016, inlinedAt: !1017)
!1035 = !DILocation(line: 175, column: 6, scope: !1016, inlinedAt: !1017)
!1036 = !DILocation(line: 175, column: 8, scope: !1016, inlinedAt: !1017)
!1037 = !DILocation(line: 175, column: 18, scope: !1016, inlinedAt: !1017)
!1038 = !DILocation(line: 175, column: 14, scope: !1016, inlinedAt: !1017)
!1039 = !DILocation(line: 175, column: 24, scope: !1016, inlinedAt: !1017)
!1040 = !DILocation(line: 175, column: 34, scope: !1016, inlinedAt: !1017)
!1041 = !DILocation(line: 175, column: 30, scope: !1016, inlinedAt: !1017)
!1042 = !DILocation(line: 175, column: 40, scope: !1016, inlinedAt: !1017)
!1043 = !DILocation(line: 172, column: 9, scope: !1016, inlinedAt: !1017)
!1044 = !DILocation(line: 176, column: 3, scope: !1016, inlinedAt: !1017)
!1045 = !DILocation(line: 176, column: 5, scope: !1016, inlinedAt: !1017)
!1046 = !DILocation(line: 176, column: 15, scope: !1016, inlinedAt: !1017)
!1047 = !DILocation(line: 176, column: 11, scope: !1016, inlinedAt: !1017)
!1048 = !DILocation(line: 176, column: 21, scope: !1016, inlinedAt: !1017)
!1049 = !DILocation(line: 176, column: 31, scope: !1016, inlinedAt: !1017)
!1050 = !DILocation(line: 176, column: 27, scope: !1016, inlinedAt: !1017)
!1051 = !DILocation(line: 176, column: 37, scope: !1016, inlinedAt: !1017)
!1052 = !DILocation(line: 177, column: 6, scope: !1016, inlinedAt: !1017)
!1053 = !DILocation(line: 177, column: 8, scope: !1016, inlinedAt: !1017)
!1054 = !DILocation(line: 177, column: 14, scope: !1016, inlinedAt: !1017)
!1055 = !DILocation(line: 177, column: 20, scope: !1016, inlinedAt: !1017)
!1056 = !DILocation(line: 177, column: 26, scope: !1016, inlinedAt: !1017)
!1057 = !DILocation(line: 177, column: 32, scope: !1016, inlinedAt: !1017)
