; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%TempState = type { ptr, ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.core.mem.aligned_offset = comdat any

$std.core.mem.ptr_is_aligned = comdat any

$std.core.mem.temp_push = comdat any

$std.core.mem.temp_pop = comdat any

$std.core.mem.malloc = comdat any

$std.core.mem.malloc_aligned = comdat any

$std.core.mem.tmalloc = comdat any

$std.core.mem.calloc = comdat any

$std.core.mem.calloc_aligned = comdat any

$std.core.mem.tcalloc = comdat any

$std.core.mem.realloc = comdat any

$std.core.mem.realloc_aligned = comdat any

$std.core.mem.free = comdat any

$std.core.mem.free_aligned = comdat any

$std.core.mem.trealloc = comdat any

$.dyn_search = comdat any

$"$ct.std.core.mem.TempState" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.mem.AtomicOrdering" = comdat any

$std.core.mem.MAX_MEMORY_ALIGNMENT = comdat any

$std.core.mem.DEFAULT_MEM_ALIGNMENT = comdat any

$"$sel.acquire" = comdat any

$"$ct.anyfault" = comdat any

$"$sel.release" = comdat any

$"$sel.resize" = comdat any

@"$ct.std.core.mem.TempState" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 9, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"CodeView", i32 1}
!9 = !{i32 1, !"uwtable", i32 2}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0, !4}
!12 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 266, type: !13, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !17)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !16}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !{}
!18 = !DILocalVariable(name: "offset", arg: 1, scope: !12, file: !2, line: 266, type: !15)
!19 = !DILocation(line: 266, column: 27, scope: !12)
!20 = !DILocalVariable(name: "alignment", arg: 2, scope: !12, file: !2, line: 266, type: !15)
!21 = !DILocation(line: 266, column: 39, scope: !12)
!22 = !DILocation(line: 999, column: 9, scope: !23, inlinedAt: !25)
!23 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !24, file: !24, line: 997, scopeLine: 997, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!24 = !DIFile(filename: "math.c3", directory: "C:/Dev/C3/c3-windows/lib/std/math")
!25 = !DILocation(line: 264, column: 17, scope: !26)
!26 = distinct !DILexicalBlock(scope: !12, file: !2, line: 267, column: 1)
!27 = !DILocation(line: 999, column: 20, scope: !23, inlinedAt: !25)
!28 = !DILocation(line: 999, column: 25, scope: !23, inlinedAt: !25)
!29 = !DILocation(line: 268, column: 9, scope: !12)
!30 = !DILocation(line: 268, column: 23, scope: !12)
!31 = !DILocation(line: 268, column: 32, scope: !12)
!32 = !DILocation(line: 268, column: 49, scope: !12)
!33 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 279, type: !34, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !17)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !37, !16}
!36 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DILocalVariable(name: "ptr", arg: 1, scope: !33, file: !2, line: 279, type: !37)
!39 = !DILocation(line: 279, column: 30, scope: !33)
!40 = !DILocalVariable(name: "alignment", arg: 2, scope: !33, file: !2, line: 279, type: !15)
!41 = !DILocation(line: 279, column: 39, scope: !33)
!42 = !DILocation(line: 999, column: 9, scope: !43, inlinedAt: !44)
!43 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !24, file: !24, line: 997, scopeLine: 997, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!44 = !DILocation(line: 277, column: 17, scope: !45)
!45 = distinct !DILexicalBlock(scope: !33, file: !2, line: 280, column: 1)
!46 = !DILocation(line: 999, column: 20, scope: !43, inlinedAt: !44)
!47 = !DILocation(line: 999, column: 25, scope: !43, inlinedAt: !44)
!48 = !DILocation(line: 281, column: 10, scope: !33)
!49 = !DILocation(line: 281, column: 23, scope: !33)
!50 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 512, type: !51, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !17)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !56}
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempState", scope: !2, file: !2, line: 503, size: 192, align: 64, elements: !54, identifier: "std.core.mem.TempState")
!54 = !{!55, !82, !83}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !53, file: !2, line: 505, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !58, identifier: "std.core.mem.allocator.TempAllocator")
!58 = !{!59, !65, !79, !80, !81}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !57, file: !2, line: 12, baseType: !60, size: 128, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !61, identifier: "Allocator")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !60, baseType: !37, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !57, file: !2, line: 13, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !68, identifier: "std.core.mem.allocator.TempAllocatorPage")
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !67, file: !2, line: 24, baseType: !66, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !67, file: !2, line: 25, baseType: !37, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !67, file: !2, line: 26, baseType: !15, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !67, file: !2, line: 27, baseType: !15, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !67, file: !2, line: 28, baseType: !15, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !2, line: 29, baseType: !75, align: 8, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, align: 8, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !{!78}
!78 = !DISubrange(count: 0, lowerBound: 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !57, file: !2, line: 14, baseType: !15, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !57, file: !2, line: 15, baseType: !15, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !2, line: 16, baseType: !75, align: 8, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !53, file: !2, line: 506, baseType: !56, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !53, file: !2, line: 507, baseType: !15, size: 64, align: 64, offset: 128)
!84 = !DILocalVariable(name: "other", arg: 1, scope: !50, file: !2, line: 512, type: !56)
!85 = !DILocation(line: 512, column: 39, scope: !50)
!86 = !DILocalVariable(name: "current", scope: !50, file: !2, line: 514, type: !56, align: 8)
!87 = !DILocation(line: 514, column: 17, scope: !50)
!88 = !DILocation(line: 396, column: 7, scope: !89, inlinedAt: !91)
!89 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !90, file: !90, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!90 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!91 = !DILocation(line: 514, column: 38, scope: !50)
!92 = !DILocation(line: 398, column: 3, scope: !93, inlinedAt: !91)
!93 = distinct !DILexicalBlock(scope: !89, file: !90, line: 397, column: 2)
!94 = !DILocation(line: 400, column: 9, scope: !89, inlinedAt: !91)
!95 = !DILocalVariable(name: "old", scope: !50, file: !2, line: 515, type: !56, align: 8)
!96 = !DILocation(line: 515, column: 17, scope: !50)
!97 = !DILocation(line: 515, column: 23, scope: !50)
!98 = !DILocation(line: 516, column: 6, scope: !50)
!99 = !DILocation(line: 516, column: 15, scope: !50)
!100 = !DILocation(line: 518, column: 24, scope: !101)
!101 = distinct !DILexicalBlock(scope: !50, file: !2, line: 517, column: 2)
!102 = !DILocation(line: 520, column: 11, scope: !50)
!103 = !DILocation(line: 520, column: 16, scope: !50)
!104 = !DILocation(line: 520, column: 25, scope: !50)
!105 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 526, type: !106, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !17)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !53}
!108 = !DILocalVariable(name: "old_state", arg: 1, scope: !105, file: !2, line: 526, type: !53)
!109 = !DILocation(line: 526, column: 28, scope: !105)
!110 = !DILocation(line: 528, column: 20, scope: !105)
!111 = !DILocation(line: 528, column: 45, scope: !105)
!112 = !DILocation(line: 529, column: 9, scope: !105)
!113 = !DILocation(line: 529, column: 35, scope: !105)
!114 = !DILocation(line: 530, column: 2, scope: !105)
!115 = !DILocation(line: 530, column: 26, scope: !105)
!116 = !DILocation(line: 531, column: 37, scope: !105)
!117 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 595, type: !118, scopeLine: 595, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !17)
!118 = !DISubroutineType(types: !119)
!119 = !{!37, !16}
!120 = !DILocalVariable(name: "size", arg: 1, scope: !117, file: !2, line: 595, type: !15)
!121 = !DILocation(line: 595, column: 21, scope: !117)
!122 = !DILocation(line: 62, column: 7, scope: !123, inlinedAt: !124)
!123 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !90, file: !90, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!124 = !DILocation(line: 57, column: 9, scope: !125, inlinedAt: !126)
!125 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !90, file: !90, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!126 = !DILocation(line: 597, column: 20, scope: !117)
!127 = !DILocation(line: 62, column: 20, scope: !123, inlinedAt: !124)
!128 = !DILocation(line: 28, column: 71, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !90, file: !90, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!130 = !DILocation(line: 68, column: 10, scope: !123, inlinedAt: !124)
