; ModuleID = 'std_hash_hmac$std.hash.md5.Md5$16$64$'
source_filename = "std_hash_hmac$std.hash.md5.Md5$16$64$"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Hmac = type { %Md5, %Md5 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.update" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.final" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.hash" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.pbkdf2" = comdat any

$"$ct.std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES" = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

@"$ct.std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 304, i64 0, i64 2, [0 x i64] zeroinitializer }, comdat, align 8
@"std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD" = internal unnamed_addr constant i8 54, align 1, !dbg !0
@"std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD" = internal unnamed_addr constant i8 92, align 1, !dbg !4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "IPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "hmac.c3", directory: "C:/Dev/C3/c3-windows/lib/std/hash")
!3 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!11 = !{i32 4, !"PIC Level", i32 2}
!12 = !{i32 1, !"CodeView", i32 1}
!13 = !{i32 1, !"uwtable", i32 2}
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, splitDebugInlining: false)
!15 = !{!0, !4, !6, !9}
!16 = distinct !DISubprogram(name: "init", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init", scope: !2, file: !2, line: 45, type: !17, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !49)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !42}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Hmac*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac", scope: !2, file: !2, line: 4, size: 2432, align: 32, elements: !21, identifier: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac")
!21 = !{!22, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !20, file: !2, line: 6, baseType: !23, size: 1216, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashAlg", scope: !2, file: !2, line: 16, baseType: !24, align: 4)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !25, identifier: "std.hash.md5.Md5")
!25 = !{!26, !28, !29, !30, !31, !32, !33, !37}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !24, file: !2, line: 10, baseType: !27, size: 32, align: 32)
!27 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !24, file: !2, line: 10, baseType: !27, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !24, file: !2, line: 11, baseType: !27, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !24, file: !2, line: 11, baseType: !27, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !24, file: !2, line: 11, baseType: !27, size: 32, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !24, file: !2, line: 11, baseType: !27, size: 32, align: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !24, file: !2, line: 12, baseType: !34, size: 512, align: 8, offset: 192)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, align: 8, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 64, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !24, file: !2, line: 13, baseType: !38, size: 512, align: 32, offset: 704)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 16, lowerBound: 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !20, file: !2, line: 6, baseType: !23, size: 1216, align: 32, offset: 1216)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !43, identifier: "char[]")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !48)
!48 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!49 = !{}
!50 = !DILocation(line: 46, column: 1, scope: !16)
!51 = !DILocalVariable(name: "self", arg: 1, scope: !16, file: !2, line: 45, type: !19)
!52 = !DILocation(line: 45, column: 19, scope: !16)
!53 = !DILocalVariable(name: "key", arg: 2, scope: !16, file: !2, line: 45, type: !42)
!54 = !DILocation(line: 45, column: 33, scope: !16)
!55 = !DILocalVariable(name: "buffer", scope: !16, file: !2, line: 47, type: !34, align: 16)
!56 = !DILocation(line: 47, column: 20, scope: !16)
!57 = !DILocation(line: 48, column: 6, scope: !16)
!58 = !DILocation(line: 50, column: 3, scope: !59)
!59 = distinct !DILexicalBlock(scope: !16, file: !2, line: 49, column: 2)
!60 = !DILocation(line: 51, column: 3, scope: !59)
!61 = !DILocation(line: 52, column: 25, scope: !59)
!62 = !DILocation(line: 52, column: 3, scope: !59)
!63 = !DILocation(line: 56, column: 22, scope: !64)
!64 = distinct !DILexicalBlock(scope: !16, file: !2, line: 55, column: 2)
!65 = !DILocation(line: 56, column: 26, scope: !64)
!66 = !DILocation(line: 56, column: 11, scope: !64)
!67 = !DILocation(line: 56, column: 3, scope: !64)
!68 = !DILocalVariable(name: ".temp", scope: !69, file: !2, line: 59, type: !47, align: 8)
!69 = distinct !DILexicalBlock(scope: !16, file: !2, line: 59, column: 2)
!70 = !DILocation(line: 59, column: 16, scope: !69)
!71 = !DILocalVariable(name: "b", scope: !72, file: !2, line: 59, type: !45, align: 8)
!72 = distinct !DILexicalBlock(scope: !69, file: !2, line: 59, column: 24)
!73 = !DILocation(line: 59, column: 12, scope: !72)
!74 = !DILocation(line: 59, column: 16, scope: !72)
!75 = !DILocation(line: 59, column: 25, scope: !72)
!76 = !DILocation(line: 59, column: 24, scope: !72)
!77 = !DILocation(line: 61, column: 2, scope: !16)
!78 = !DILocation(line: 62, column: 2, scope: !16)
!79 = !DILocation(line: 62, column: 17, scope: !16)
!80 = !DILocalVariable(name: ".temp", scope: !81, file: !2, line: 64, type: !47, align: 8)
!81 = distinct !DILexicalBlock(scope: !16, file: !2, line: 64, column: 2)
!82 = !DILocation(line: 64, column: 16, scope: !81)
!83 = !DILocalVariable(name: "b", scope: !84, file: !2, line: 64, type: !45, align: 8)
!84 = distinct !DILexicalBlock(scope: !81, file: !2, line: 64, column: 24)
!85 = !DILocation(line: 64, column: 12, scope: !84)
!86 = !DILocation(line: 64, column: 16, scope: !84)
!87 = !DILocation(line: 64, column: 25, scope: !84)
!88 = !DILocation(line: 64, column: 24, scope: !84)
!89 = !DILocation(line: 66, column: 2, scope: !16)
!90 = !DILocation(line: 67, column: 2, scope: !16)
!91 = !DILocation(line: 67, column: 17, scope: !16)
!92 = !DILocation(line: 69, column: 22, scope: !16)
!93 = !DILocation(line: 286, column: 11, scope: !94, inlinedAt: !96)
!94 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !95, file: !95, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!95 = !DIFile(filename: "mem.c3", directory: "C:/Dev/C3/c3-windows/lib/std/core")
!96 = !DILocation(line: 69, column: 7, scope: !16)
!97 = !DILocation(line: 286, column: 30, scope: !94, inlinedAt: !96)
!98 = !DILocation(line: 286, column: 40, scope: !94, inlinedAt: !96)
!99 = distinct !DISubprogram(name: "update", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.update", scope: !2, file: !2, line: 72, type: !17, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !49)
!100 = !DILocation(line: 73, column: 1, scope: !99)
!101 = !DILocalVariable(name: "self", arg: 1, scope: !99, file: !2, line: 72, type: !19)
!102 = !DILocation(line: 72, column: 21, scope: !99)
!103 = !DILocalVariable(name: "data", arg: 2, scope: !99, file: !2, line: 72, type: !42)
!104 = !DILocation(line: 72, column: 35, scope: !99)
